RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/**
  ******************************************************************************
  * @file    dsp2_misc_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_MISC_REG_H__
#define __DSP2_MISC_REG_H__

#include "bl808.h"

/* 0x0 : config */
#define DSP2_MISC_CONFIG_OFFSET              (0x0)
#define DSP2_MISC_RG_DVPAS_ENABLE            DSP2_MISC_RG_DVPAS_ENABLE
#define DSP2_MISC_RG_DVPAS_ENABLE_POS        (0U)
#define DSP2_MISC_RG_DVPAS_ENABLE_LEN        (1U)
#define DSP2_MISC_RG_DVPAS_ENABLE_MSK        (((1U << DSP2_MISC_RG_DVPAS_ENABLE_LEN) - 1) << DSP2_MISC_RG_DVPAS_ENABLE_POS)
#define DSP2_MISC_RG_DVPAS_ENABLE_UMSK       (~(((1U << DSP2_MISC_RG_DVPAS_ENABLE_LEN) - 1) << DSP2_MISC_RG_DVPAS_ENABLE_POS))
#define DSP2_MISC_RG_DVPAS_HS_INV            DSP2_MISC_RG_DVPAS_HS_INV
#define DSP2_MISC_RG_DVPAS_HS_INV_POS        (1U)
#define DSP2_MISC_RG_DVPAS_HS_INV_LEN        (1U)
#define DSP2_MISC_RG_DVPAS_HS_INV_MSK        (((1U << DSP2_MISC_RG_DVPAS_HS_INV_LEN) - 1) << DSP2_MISC_RG_DVPAS_HS_INV_POS)
#define DSP2_MISC_RG_DVPAS_HS_INV_UMSK       (~(((1U << DSP2_MISC_RG_DVPAS_HS_INV_LEN) - 1) << DSP2_MISC_RG_DVPAS_HS_INV_POS))
#define DSP2_MISC_RG_DVPAS_VS_INV            DSP2_MISC_RG_DVPAS_VS_INV
#define DSP2_MISC_RG_DVPAS_VS_INV_POS        (2U)
#define DSP2_MISC_RG_DVPAS_VS_INV_LEN        (1U)
#define DSP2_MISC_RG_DVPAS_VS_INV_MSK        (((1U << DSP2_MISC_RG_DVPAS_VS_INV_LEN) - 1) << DSP2_MISC_RG_DVPAS_VS_INV_POS)
#define DSP2_MISC_RG_DVPAS_VS_INV_UMSK       (~(((1U << DSP2_MISC_RG_DVPAS_VS_INV_LEN) - 1) << DSP2_MISC_RG_DVPAS_VS_INV_POS))
#define DSP2_MISC_RG_DVPAS_DA_ORDER          DSP2_MISC_RG_DVPAS_DA_ORDER
#define DSP2_MISC_RG_DVPAS_DA_ORDER_POS      (3U)
#define DSP2_MISC_RG_DVPAS_DA_ORDER_LEN      (1U)
#define DSP2_MISC_RG_DVPAS_DA_ORDER_MSK      (((1U << DSP2_MISC_RG_DVPAS_DA_ORDER_LEN) - 1) << DSP2_MISC_RG_DVPAS_DA_ORDER_POS)
#define DSP2_MISC_RG_DVPAS_DA_ORDER_UMSK     (~(((1U << DSP2_MISC_RG_DVPAS_DA_ORDER_LEN) - 1) << DSP2_MISC_RG_DVPAS_DA_ORDER_POS))
#define DSP2_MISC_RG_DVPAS_FIFO_TH           DSP2_MISC_RG_DVPAS_FIFO_TH
#define DSP2_MISC_RG_DVPAS_FIFO_TH_POS       (16U)
#define DSP2_MISC_RG_DVPAS_FIFO_TH_LEN       (11U)
#define DSP2_MISC_RG_DVPAS_FIFO_TH_MSK       (((1U << DSP2_MISC_RG_DVPAS_FIFO_TH_LEN) - 1) << DSP2_MISC_RG_DVPAS_FIFO_TH_POS)
#define DSP2_MISC_RG_DVPAS_FIFO_TH_UMSK      (~(((1U << DSP2_MISC_RG_DVPAS_FIFO_TH_LEN) - 1) << DSP2_MISC_RG_DVPAS_FIFO_TH_POS))
#define DSP2_MISC_CR_DSP2_DE_AS_HSYNC         DSP2_MISC_CR_DSP2_DE_AS_HSYNC
#define DSP2_MISC_CR_DSP2_DE_AS_HSYNC_POS     (30U)
#define DSP2_MISC_CR_DSP2_DE_AS_HSYNC_LEN     (1U)
#define DSP2_MISC_CR_DSP2_DE_AS_HSYNC_MSK     (((1U << DSP2_MISC_CR_DSP2_DE_AS_HSYNC_LEN) - 1) << DSP2_MISC_CR_DSP2_DE_AS_HSYNC_POS)
#define DSP2_MISC_CR_DSP2_DE_AS_HSYNC_UMSK    (~(((1U << DSP2_MISC_CR_DSP2_DE_AS_HSYNC_LEN) - 1) << DSP2_MISC_CR_DSP2_DE_AS_HSYNC_POS))
#define DSP2_MISC_REG_DSP2_PCLK_FORCE_ON      DSP2_MISC_REG_DSP2_PCLK_FORCE_ON
#define DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_POS  (31U)
#define DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_LEN  (1U)
#define DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_MSK  (((1U << DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_LEN) - 1) << DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_POS)
#define DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_UMSK (~(((1U << DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_LEN) - 1) << DSP2_MISC_REG_DSP2_PCLK_FORCE_ON_POS))

/* 0x4 : pix_data_ctrl */
#define DSP2_MISC_PIX_DATA_CTRL_OFFSET      (0x4)
#define DSP2_MISC_REG_PIX_DATA_CTRL         DSP2_MISC_REG_PIX_DATA_CTRL
#define DSP2_MISC_REG_PIX_DATA_CTRL_POS     (0U)
#define DSP2_MISC_REG_PIX_DATA_CTRL_LEN     (12U)
#define DSP2_MISC_REG_PIX_DATA_CTRL_MSK     (((1U << DSP2_MISC_REG_PIX_DATA_CTRL_LEN) - 1) << DSP2_MISC_REG_PIX_DATA_CTRL_POS)
#define DSP2_MISC_REG_PIX_DATA_CTRL_UMSK    (~(((1U << DSP2_MISC_REG_PIX_DATA_CTRL_LEN) - 1) << DSP2_MISC_REG_PIX_DATA_CTRL_POS))
#define DSP2_MISC_REG_PIX_DATA_SHT_BIT      DSP2_MISC_REG_PIX_DATA_SHT_BIT
#define DSP2_MISC_REG_PIX_DATA_SHT_BIT_POS  (16U)
#define DSP2_MISC_REG_PIX_DATA_SHT_BIT_LEN  (4U)
#define DSP2_MISC_REG_PIX_DATA_SHT_BIT_MSK  (((1U << DSP2_MISC_REG_PIX_DATA_SHT_BIT_LEN) - 1) << DSP2_MISC_REG_PIX_DATA_SHT_BIT_POS)
#define DSP2_MISC_REG_PIX_DATA_SHT_BIT_UMSK (~(((1U << DSP2_MISC_REG_PIX_DATA_SHT_BIT_LEN) - 1) << DSP2_MISC_REG_PIX_DATA_SHT_BIT_POS))
#define DSP2_MISC_REG_PIX_DATA_SHT_DIR      DSP2_MISC_REG_PIX_DATA_SHT_DIR
#define DSP2_MISC_REG_PIX_DATA_SHT_DIR_POS  (20U)
#define DSP2_MISC_REG_PIX_DATA_SHT_DIR_LEN  (1U)
#define DSP2_MISC_REG_PIX_DATA_SHT_DIR_MSK  (((1U << DSP2_MISC_REG_PIX_DATA_SHT_DIR_LEN) - 1) << DSP2_MISC_REG_PIX_DATA_SHT_DIR_POS)
#define DSP2_MISC_REG_PIX_DATA_SHT_DIR_UMSK (~(((1U << DSP2_MISC_REG_PIX_DATA_SHT_DIR_LEN) - 1) << DSP2_MISC_REG_PIX_DATA_SHT_DIR_POS))
#define DSP2_MISC_REG_DSP2_DTSRC_SRC         DSP2_MISC_REG_DSP2_DTSRC_SRC
#define DSP2_MISC_REG_DSP2_DTSRC_SRC_POS     (31U)
#define DSP2_MISC_REG_DSP2_DTSRC_SRC_LEN     (1U)
#define DSP2_MISC_REG_DSP2_DTSRC_SRC_MSK     (((1U << DSP2_MISC_REG_DSP2_DTSRC_SRC_LEN) - 1) << DSP2_MISC_REG_DSP2_DTSRC_SRC_POS)
#define DSP2_MISC_REG_DSP2_DTSRC_SRC_UMSK    (~(((1U << DSP2_MISC_REG_DSP2_DTSRC_SRC_LEN) - 1) << DSP2_MISC_REG_DSP2_DTSRC_SRC_POS))

/* 0x8 : dvp2bus_src_sel_1 */
#define DSP2_MISC_DVP2BUS_SRC_SEL_1_OFFSET (0x8)
#define DSP2_MISC_RG_D2B_DVP_SEL_A         DSP2_MISC_RG_D2B_DVP_SEL_A
#define DSP2_MISC_RG_D2B_DVP_SEL_A_POS     (0U)
#define DSP2_MISC_RG_D2B_DVP_SEL_A_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_A_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_A_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_A_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_A_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_A_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_A_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_A          DSP2_MISC_RG_D2X_ID_SEL_A
#define DSP2_MISC_RG_D2X_ID_SEL_A_POS      (7U)
#define DSP2_MISC_RG_D2X_ID_SEL_A_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_A_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_A_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_A_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_A_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_A_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_A_POS))
#define DSP2_MISC_RG_D2B_DVP_SEL_B         DSP2_MISC_RG_D2B_DVP_SEL_B
#define DSP2_MISC_RG_D2B_DVP_SEL_B_POS     (8U)
#define DSP2_MISC_RG_D2B_DVP_SEL_B_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_B_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_B_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_B_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_B_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_B_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_B_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_B          DSP2_MISC_RG_D2X_ID_SEL_B
#define DSP2_MISC_RG_D2X_ID_SEL_B_POS      (15U)
#define DSP2_MISC_RG_D2X_ID_SEL_B_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_B_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_B_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_B_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_B_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_B_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_B_POS))
#define DSP2_MISC_RG_D2B_DVP_SEL_C         DSP2_MISC_RG_D2B_DVP_SEL_C
#define DSP2_MISC_RG_D2B_DVP_SEL_C_POS     (16U)
#define DSP2_MISC_RG_D2B_DVP_SEL_C_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_C_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_C_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_C_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_C_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_C_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_C_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_C          DSP2_MISC_RG_D2X_ID_SEL_C
#define DSP2_MISC_RG_D2X_ID_SEL_C_POS      (23U)
#define DSP2_MISC_RG_D2X_ID_SEL_C_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_C_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_C_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_C_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_C_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_C_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_C_POS))
#define DSP2_MISC_RG_D2B_DVP_SEL_D         DSP2_MISC_RG_D2B_DVP_SEL_D
#define DSP2_MISC_RG_D2B_DVP_SEL_D_POS     (24U)
#define DSP2_MISC_RG_D2B_DVP_SEL_D_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_D_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_D_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_D_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_D_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_D_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_D_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_D          DSP2_MISC_RG_D2X_ID_SEL_D
#define DSP2_MISC_RG_D2X_ID_SEL_D_POS      (31U)
#define DSP2_MISC_RG_D2X_ID_SEL_D_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_D_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_D_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_D_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_D_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_D_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_D_POS))

/* 0xC : dvp_frame_m_to_n */
#define DSP2_MISC_DVP_FRAME_M_TO_N_OFFSET (0xC)
#define DSP2_MISC_CR_FRAME_M_TO_N_EN      DSP2_MISC_CR_FRAME_M_TO_N_EN
#define DSP2_MISC_CR_FRAME_M_TO_N_EN_POS  (0U)
#define DSP2_MISC_CR_FRAME_M_TO_N_EN_LEN  (1U)
#define DSP2_MISC_CR_FRAME_M_TO_N_EN_MSK  (((1U << DSP2_MISC_CR_FRAME_M_TO_N_EN_LEN) - 1) << DSP2_MISC_CR_FRAME_M_TO_N_EN_POS)
#define DSP2_MISC_CR_FRAME_M_TO_N_EN_UMSK (~(((1U << DSP2_MISC_CR_FRAME_M_TO_N_EN_LEN) - 1) << DSP2_MISC_CR_FRAME_M_TO_N_EN_POS))
#define DSP2_MISC_CR_FRAME_INTERVAL       DSP2_MISC_CR_FRAME_INTERVAL
#define DSP2_MISC_CR_FRAME_INTERVAL_POS   (4U)
#define DSP2_MISC_CR_FRAME_INTERVAL_LEN   (4U)
#define DSP2_MISC_CR_FRAME_INTERVAL_MSK   (((1U << DSP2_MISC_CR_FRAME_INTERVAL_LEN) - 1) << DSP2_MISC_CR_FRAME_INTERVAL_POS)
#define DSP2_MISC_CR_FRAME_INTERVAL_UMSK  (~(((1U << DSP2_MISC_CR_FRAME_INTERVAL_LEN) - 1) << DSP2_MISC_CR_FRAME_INTERVAL_POS))
#define DSP2_MISC_CR_FRAME_CNT_N          DSP2_MISC_CR_FRAME_CNT_N
#define DSP2_MISC_CR_FRAME_CNT_N_POS      (8U)
#define DSP2_MISC_CR_FRAME_CNT_N_LEN      (4U)
#define DSP2_MISC_CR_FRAME_CNT_N_MSK      (((1U << DSP2_MISC_CR_FRAME_CNT_N_LEN) - 1) << DSP2_MISC_CR_FRAME_CNT_N_POS)
#define DSP2_MISC_CR_FRAME_CNT_N_UMSK     (~(((1U << DSP2_MISC_CR_FRAME_CNT_N_LEN) - 1) << DSP2_MISC_CR_FRAME_CNT_N_POS))
#define DSP2_MISC_CR_FRAME_CNT_M          DSP2_MISC_CR_FRAME_CNT_M
#define DSP2_MISC_CR_FRAME_CNT_M_POS      (12U)
#define DSP2_MISC_CR_FRAME_CNT_M_LEN      (4U)
#define DSP2_MISC_CR_FRAME_CNT_M_MSK      (((1U << DSP2_MISC_CR_FRAME_CNT_M_LEN) - 1) << DSP2_MISC_CR_FRAME_CNT_M_POS)
#define DSP2_MISC_CR_FRAME_CNT_M_UMSK     (~(((1U << DSP2_MISC_CR_FRAME_CNT_M_LEN) - 1) << DSP2_MISC_CR_FRAME_CNT_M_POS))

/* 0x10 : dsp2_id_bayer */
#define DSP2_MISC_DSP2_ID_BAYER_OFFSET           (0x10)
#define DSP2_MISC_REG_BAYER_IDGEN_RST           DSP2_MISC_REG_BAYER_IDGEN_RST
#define DSP2_MISC_REG_BAYER_IDGEN_RST_POS       (0U)
#define DSP2_MISC_REG_BAYER_IDGEN_RST_LEN       (1U)
#define DSP2_MISC_REG_BAYER_IDGEN_RST_MSK       (((1U << DSP2_MISC_REG_BAYER_IDGEN_RST_LEN) - 1) << DSP2_MISC_REG_BAYER_IDGEN_RST_POS)
#define DSP2_MISC_REG_BAYER_IDGEN_RST_UMSK      (~(((1U << DSP2_MISC_REG_BAYER_IDGEN_RST_LEN) - 1) << DSP2_MISC_REG_BAYER_IDGEN_RST_POS))
#define DSP2_MISC_REG_BAYER_IDGEN_EDGE          DSP2_MISC_REG_BAYER_IDGEN_EDGE
#define DSP2_MISC_REG_BAYER_IDGEN_EDGE_POS      (1U)
#define DSP2_MISC_REG_BAYER_IDGEN_EDGE_LEN      (1U)
#define DSP2_MISC_REG_BAYER_IDGEN_EDGE_MSK      (((1U << DSP2_MISC_REG_BAYER_IDGEN_EDGE_LEN) - 1) << DSP2_MISC_REG_BAYER_IDGEN_EDGE_POS)
#define DSP2_MISC_REG_BAYER_IDGEN_EDGE_UMSK     (~(((1U << DSP2_MISC_REG_BAYER_IDGEN_EDGE_LEN) - 1) << DSP2_MISC_REG_BAYER_IDGEN_EDGE_POS))
#define DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR      DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR
#define DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_POS  (16U)
#define DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_LEN  (16U)
#define DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_MSK  (((1U << DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_LEN) - 1) << DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_POS)
#define DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_UMSK (~(((1U << DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_LEN) - 1) << DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR_POS))

/* 0x14 : dvp2bus_src_sel_2 */
#define DSP2_MISC_DVP2BUS_SRC_SEL_2_OFFSET (0x14)
#define DSP2_MISC_RG_D2B_DVP_SEL_E         DSP2_MISC_RG_D2B_DVP_SEL_E
#define DSP2_MISC_RG_D2B_DVP_SEL_E_POS     (0U)
#define DSP2_MISC_RG_D2B_DVP_SEL_E_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_E_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_E_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_E_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_E_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_E_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_E_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_E          DSP2_MISC_RG_D2X_ID_SEL_E
#define DSP2_MISC_RG_D2X_ID_SEL_E_POS      (7U)
#define DSP2_MISC_RG_D2X_ID_SEL_E_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_E_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_E_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_E_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_E_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_E_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_E_POS))
#define DSP2_MISC_RG_D2B_DVP_SEL_F         DSP2_MISC_RG_D2B_DVP_SEL_F
#define DSP2_MISC_RG_D2B_DVP_SEL_F_POS     (8U)
#define DSP2_MISC_RG_D2B_DVP_SEL_F_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_F_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_F_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_F_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_F_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_F_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_F_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_F          DSP2_MISC_RG_D2X_ID_SEL_F
#define DSP2_MISC_RG_D2X_ID_SEL_F_POS      (15U)
#define DSP2_MISC_RG_D2X_ID_SEL_F_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_F_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_F_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_F_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_F_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_F_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_F_POS))
#define DSP2_MISC_RG_D2B_DVP_SEL_G         DSP2_MISC_RG_D2B_DVP_SEL_G
#define DSP2_MISC_RG_D2B_DVP_SEL_G_POS     (16U)
#define DSP2_MISC_RG_D2B_DVP_SEL_G_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_G_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_G_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_G_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_G_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_G_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_G_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_G          DSP2_MISC_RG_D2X_ID_SEL_G
#define DSP2_MISC_RG_D2X_ID_SEL_G_POS      (23U)
#define DSP2_MISC_RG_D2X_ID_SEL_G_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_G_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_G_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_G_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_G_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_G_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_G_POS))
#define DSP2_MISC_RG_D2B_DVP_SEL_H         DSP2_MISC_RG_D2B_DVP_SEL_H
#define DSP2_MISC_RG_D2B_DVP_SEL_H_POS     (24U)
#define DSP2_MISC_RG_D2B_DVP_SEL_H_LEN     (6U)
#define DSP2_MISC_RG_D2B_DVP_SEL_H_MSK     (((1U << DSP2_MISC_RG_D2B_DVP_SEL_H_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_H_POS)
#define DSP2_MISC_RG_D2B_DVP_SEL_H_UMSK    (~(((1U << DSP2_MISC_RG_D2B_DVP_SEL_H_LEN) - 1) << DSP2_MISC_RG_D2B_DVP_SEL_H_POS))
#define DSP2_MISC_RG_D2X_ID_SEL_H          DSP2_MISC_RG_D2X_ID_SEL_H
#define DSP2_MISC_RG_D2X_ID_SEL_H_POS      (31U)
#define DSP2_MISC_RG_D2X_ID_SEL_H_LEN      (1U)
#define DSP2_MISC_RG_D2X_ID_SEL_H_MSK      (((1U << DSP2_MISC_RG_D2X_ID_SEL_H_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_H_POS)
#define DSP2_MISC_RG_D2X_ID_SEL_H_UMSK     (~(((1U << DSP2_MISC_RG_D2X_ID_SEL_H_LEN) - 1) << DSP2_MISC_RG_D2X_ID_SEL_H_POS))

/* 0x20 : int_clr */
#define DSP2_MISC_INT_CLR_OFFSET           (0x20)
#define DSP2_MISC_RG_AWB_INT_CLR           DSP2_MISC_RG_AWB_INT_CLR
#define DSP2_MISC_RG_AWB_INT_CLR_POS       (0U)
#define DSP2_MISC_RG_AWB_INT_CLR_LEN       (1U)
#define DSP2_MISC_RG_AWB_INT_CLR_MSK       (((1U << DSP2_MISC_RG_AWB_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AWB_INT_CLR_POS)
#define DSP2_MISC_RG_AWB_INT_CLR_UMSK      (~(((1U << DSP2_MISC_RG_AWB_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AWB_INT_CLR_POS))
#define DSP2_MISC_RG_AE_INT_CLR            DSP2_MISC_RG_AE_INT_CLR
#define DSP2_MISC_RG_AE_INT_CLR_POS        (1U)
#define DSP2_MISC_RG_AE_INT_CLR_LEN        (1U)
#define DSP2_MISC_RG_AE_INT_CLR_MSK        (((1U << DSP2_MISC_RG_AE_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AE_INT_CLR_POS)
#define DSP2_MISC_RG_AE_INT_CLR_UMSK       (~(((1U << DSP2_MISC_RG_AE_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AE_INT_CLR_POS))
#define DSP2_MISC_RG_WDR_INT_CLR           DSP2_MISC_RG_WDR_INT_CLR
#define DSP2_MISC_RG_WDR_INT_CLR_POS       (2U)
#define DSP2_MISC_RG_WDR_INT_CLR_LEN       (1U)
#define DSP2_MISC_RG_WDR_INT_CLR_MSK       (((1U << DSP2_MISC_RG_WDR_INT_CLR_LEN) - 1) << DSP2_MISC_RG_WDR_INT_CLR_POS)
#define DSP2_MISC_RG_WDR_INT_CLR_UMSK      (~(((1U << DSP2_MISC_RG_WDR_INT_CLR_LEN) - 1) << DSP2_MISC_RG_WDR_INT_CLR_POS))
#define DSP2_MISC_RG_AWB2_INT_CLR          DSP2_MISC_RG_AWB2_INT_CLR
#define DSP2_MISC_RG_AWB2_INT_CLR_POS      (3U)
#define DSP2_MISC_RG_AWB2_INT_CLR_LEN      (1U)
#define DSP2_MISC_RG_AWB2_INT_CLR_MSK      (((1U << DSP2_MISC_RG_AWB2_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AWB2_INT_CLR_POS)
#define DSP2_MISC_RG_AWB2_INT_CLR_UMSK     (~(((1U << DSP2_MISC_RG_AWB2_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AWB2_INT_CLR_POS))
#define DSP2_MISC_RG_OSD_PB_INT_CLR        DSP2_MISC_RG_OSD_PB_INT_CLR
#define DSP2_MISC_RG_OSD_PB_INT_CLR_POS    (4U)
#define DSP2_MISC_RG_OSD_PB_INT_CLR_LEN    (1U)
#define DSP2_MISC_RG_OSD_PB_INT_CLR_MSK    (((1U << DSP2_MISC_RG_OSD_PB_INT_CLR_LEN) - 1) << DSP2_MISC_RG_OSD_PB_INT_CLR_POS)
#define DSP2_MISC_RG_OSD_PB_INT_CLR_UMSK   (~(((1U << DSP2_MISC_RG_OSD_PB_INT_CLR_LEN) - 1) << DSP2_MISC_RG_OSD_PB_INT_CLR_POS))
#define DSP2_MISC_RG_SEOF1_INT_CLR         DSP2_MISC_RG_SEOF1_INT_CLR
#define DSP2_MISC_RG_SEOF1_INT_CLR_POS     (8U)
#define DSP2_MISC_RG_SEOF1_INT_CLR_LEN     (1U)
#define DSP2_MISC_RG_SEOF1_INT_CLR_MSK     (((1U << DSP2_MISC_RG_SEOF1_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_CLR_POS)
#define DSP2_MISC_RG_SEOF1_INT_CLR_UMSK    (~(((1U << DSP2_MISC_RG_SEOF1_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_CLR_POS))
#define DSP2_MISC_RG_SEOF2_INT_CLR         DSP2_MISC_RG_SEOF2_INT_CLR
#define DSP2_MISC_RG_SEOF2_INT_CLR_POS     (9U)
#define DSP2_MISC_RG_SEOF2_INT_CLR_LEN     (1U)
#define DSP2_MISC_RG_SEOF2_INT_CLR_MSK     (((1U << DSP2_MISC_RG_SEOF2_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_CLR_POS)
#define DSP2_MISC_RG_SEOF2_INT_CLR_UMSK    (~(((1U << DSP2_MISC_RG_SEOF2_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_CLR_POS))
#define DSP2_MISC_RG_SEOF3_INT_CLR         DSP2_MISC_RG_SEOF3_INT_CLR
#define DSP2_MISC_RG_SEOF3_INT_CLR_POS     (10U)
#define DSP2_MISC_RG_SEOF3_INT_CLR_LEN     (1U)
#define DSP2_MISC_RG_SEOF3_INT_CLR_MSK     (((1U << DSP2_MISC_RG_SEOF3_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_CLR_POS)
#define DSP2_MISC_RG_SEOF3_INT_CLR_UMSK    (~(((1U << DSP2_MISC_RG_SEOF3_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_CLR_POS))
#define DSP2_MISC_RG_AE_HIST_INT_CLR       DSP2_MISC_RG_AE_HIST_INT_CLR
#define DSP2_MISC_RG_AE_HIST_INT_CLR_POS   (11U)
#define DSP2_MISC_RG_AE_HIST_INT_CLR_LEN   (1U)
#define DSP2_MISC_RG_AE_HIST_INT_CLR_MSK   (((1U << DSP2_MISC_RG_AE_HIST_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AE_HIST_INT_CLR_POS)
#define DSP2_MISC_RG_AE_HIST_INT_CLR_UMSK  (~(((1U << DSP2_MISC_RG_AE_HIST_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AE_HIST_INT_CLR_POS))
#define DSP2_MISC_RG_AWB3_INT_CLR          DSP2_MISC_RG_AWB3_INT_CLR
#define DSP2_MISC_RG_AWB3_INT_CLR_POS      (12U)
#define DSP2_MISC_RG_AWB3_INT_CLR_LEN      (1U)
#define DSP2_MISC_RG_AWB3_INT_CLR_MSK      (((1U << DSP2_MISC_RG_AWB3_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AWB3_INT_CLR_POS)
#define DSP2_MISC_RG_AWB3_INT_CLR_UMSK     (~(((1U << DSP2_MISC_RG_AWB3_INT_CLR_LEN) - 1) << DSP2_MISC_RG_AWB3_INT_CLR_POS))
#define DSP2_MISC_RG_DP_SEOF0_INT_CLR      DSP2_MISC_RG_DP_SEOF0_INT_CLR
#define DSP2_MISC_RG_DP_SEOF0_INT_CLR_POS  (13U)
#define DSP2_MISC_RG_DP_SEOF0_INT_CLR_LEN  (1U)
#define DSP2_MISC_RG_DP_SEOF0_INT_CLR_MSK  (((1U << DSP2_MISC_RG_DP_SEOF0_INT_CLR_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_CLR_POS)
#define DSP2_MISC_RG_DP_SEOF0_INT_CLR_UMSK (~(((1U << DSP2_MISC_RG_DP_SEOF0_INT_CLR_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_CLR_POS))
#define DSP2_MISC_RG_SEOF4_INT_CLR         DSP2_MISC_RG_SEOF4_INT_CLR
#define DSP2_MISC_RG_SEOF4_INT_CLR_POS     (14U)
#define DSP2_MISC_RG_SEOF4_INT_CLR_LEN     (1U)
#define DSP2_MISC_RG_SEOF4_INT_CLR_MSK     (((1U << DSP2_MISC_RG_SEOF4_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_CLR_POS)
#define DSP2_MISC_RG_SEOF4_INT_CLR_UMSK    (~(((1U << DSP2_MISC_RG_SEOF4_INT_CLR_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_CLR_POS))

