RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x24 : int_ctrl */
#define DSP2_MISC_INT_CTRL_OFFSET           (0x24)
#define DSP2_MISC_RG_AE_INT_MASK            DSP2_MISC_RG_AE_INT_MASK
#define DSP2_MISC_RG_AE_INT_MASK_POS        (0U)
#define DSP2_MISC_RG_AE_INT_MASK_LEN        (1U)
#define DSP2_MISC_RG_AE_INT_MASK_MSK        (((1U << DSP2_MISC_RG_AE_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AE_INT_MASK_POS)
#define DSP2_MISC_RG_AE_INT_MASK_UMSK       (~(((1U << DSP2_MISC_RG_AE_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AE_INT_MASK_POS))
#define DSP2_MISC_RG_AWB_INT_MASK           DSP2_MISC_RG_AWB_INT_MASK
#define DSP2_MISC_RG_AWB_INT_MASK_POS       (1U)
#define DSP2_MISC_RG_AWB_INT_MASK_LEN       (1U)
#define DSP2_MISC_RG_AWB_INT_MASK_MSK       (((1U << DSP2_MISC_RG_AWB_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AWB_INT_MASK_POS)
#define DSP2_MISC_RG_AWB_INT_MASK_UMSK      (~(((1U << DSP2_MISC_RG_AWB_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AWB_INT_MASK_POS))
#define DSP2_MISC_RG_WDR_INT_MASK           DSP2_MISC_RG_WDR_INT_MASK
#define DSP2_MISC_RG_WDR_INT_MASK_POS       (2U)
#define DSP2_MISC_RG_WDR_INT_MASK_LEN       (1U)
#define DSP2_MISC_RG_WDR_INT_MASK_MSK       (((1U << DSP2_MISC_RG_WDR_INT_MASK_LEN) - 1) << DSP2_MISC_RG_WDR_INT_MASK_POS)
#define DSP2_MISC_RG_WDR_INT_MASK_UMSK      (~(((1U << DSP2_MISC_RG_WDR_INT_MASK_LEN) - 1) << DSP2_MISC_RG_WDR_INT_MASK_POS))
#define DSP2_MISC_RG_AWB2_INT_MASK          DSP2_MISC_RG_AWB2_INT_MASK
#define DSP2_MISC_RG_AWB2_INT_MASK_POS      (3U)
#define DSP2_MISC_RG_AWB2_INT_MASK_LEN      (1U)
#define DSP2_MISC_RG_AWB2_INT_MASK_MSK      (((1U << DSP2_MISC_RG_AWB2_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AWB2_INT_MASK_POS)
#define DSP2_MISC_RG_AWB2_INT_MASK_UMSK     (~(((1U << DSP2_MISC_RG_AWB2_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AWB2_INT_MASK_POS))
#define DSP2_MISC_RG_OSD_PB_INT_MASK        DSP2_MISC_RG_OSD_PB_INT_MASK
#define DSP2_MISC_RG_OSD_PB_INT_MASK_POS    (4U)
#define DSP2_MISC_RG_OSD_PB_INT_MASK_LEN    (1U)
#define DSP2_MISC_RG_OSD_PB_INT_MASK_MSK    (((1U << DSP2_MISC_RG_OSD_PB_INT_MASK_LEN) - 1) << DSP2_MISC_RG_OSD_PB_INT_MASK_POS)
#define DSP2_MISC_RG_OSD_PB_INT_MASK_UMSK   (~(((1U << DSP2_MISC_RG_OSD_PB_INT_MASK_LEN) - 1) << DSP2_MISC_RG_OSD_PB_INT_MASK_POS))
#define DSP2_MISC_RG_SEOF1_INT_MASK         DSP2_MISC_RG_SEOF1_INT_MASK
#define DSP2_MISC_RG_SEOF1_INT_MASK_POS     (8U)
#define DSP2_MISC_RG_SEOF1_INT_MASK_LEN     (1U)
#define DSP2_MISC_RG_SEOF1_INT_MASK_MSK     (((1U << DSP2_MISC_RG_SEOF1_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_MASK_POS)
#define DSP2_MISC_RG_SEOF1_INT_MASK_UMSK    (~(((1U << DSP2_MISC_RG_SEOF1_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_MASK_POS))
#define DSP2_MISC_RG_SEOF1_INT_EDGE         DSP2_MISC_RG_SEOF1_INT_EDGE
#define DSP2_MISC_RG_SEOF1_INT_EDGE_POS     (9U)
#define DSP2_MISC_RG_SEOF1_INT_EDGE_LEN     (1U)
#define DSP2_MISC_RG_SEOF1_INT_EDGE_MSK     (((1U << DSP2_MISC_RG_SEOF1_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_EDGE_POS)
#define DSP2_MISC_RG_SEOF1_INT_EDGE_UMSK    (~(((1U << DSP2_MISC_RG_SEOF1_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_EDGE_POS))
#define DSP2_MISC_RG_SEOF1_INT_SRC          DSP2_MISC_RG_SEOF1_INT_SRC
#define DSP2_MISC_RG_SEOF1_INT_SRC_POS      (10U)
#define DSP2_MISC_RG_SEOF1_INT_SRC_LEN      (2U)
#define DSP2_MISC_RG_SEOF1_INT_SRC_MSK      (((1U << DSP2_MISC_RG_SEOF1_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_SRC_POS)
#define DSP2_MISC_RG_SEOF1_INT_SRC_UMSK     (~(((1U << DSP2_MISC_RG_SEOF1_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF1_INT_SRC_POS))
#define DSP2_MISC_RG_SEOF2_INT_MASK         DSP2_MISC_RG_SEOF2_INT_MASK
#define DSP2_MISC_RG_SEOF2_INT_MASK_POS     (12U)
#define DSP2_MISC_RG_SEOF2_INT_MASK_LEN     (1U)
#define DSP2_MISC_RG_SEOF2_INT_MASK_MSK     (((1U << DSP2_MISC_RG_SEOF2_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_MASK_POS)
#define DSP2_MISC_RG_SEOF2_INT_MASK_UMSK    (~(((1U << DSP2_MISC_RG_SEOF2_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_MASK_POS))
#define DSP2_MISC_RG_SEOF2_INT_EDGE         DSP2_MISC_RG_SEOF2_INT_EDGE
#define DSP2_MISC_RG_SEOF2_INT_EDGE_POS     (13U)
#define DSP2_MISC_RG_SEOF2_INT_EDGE_LEN     (1U)
#define DSP2_MISC_RG_SEOF2_INT_EDGE_MSK     (((1U << DSP2_MISC_RG_SEOF2_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_EDGE_POS)
#define DSP2_MISC_RG_SEOF2_INT_EDGE_UMSK    (~(((1U << DSP2_MISC_RG_SEOF2_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_EDGE_POS))
#define DSP2_MISC_RG_SEOF2_INT_SRC          DSP2_MISC_RG_SEOF2_INT_SRC
#define DSP2_MISC_RG_SEOF2_INT_SRC_POS      (14U)
#define DSP2_MISC_RG_SEOF2_INT_SRC_LEN      (2U)
#define DSP2_MISC_RG_SEOF2_INT_SRC_MSK      (((1U << DSP2_MISC_RG_SEOF2_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_SRC_POS)
#define DSP2_MISC_RG_SEOF2_INT_SRC_UMSK     (~(((1U << DSP2_MISC_RG_SEOF2_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF2_INT_SRC_POS))
#define DSP2_MISC_RG_SEOF3_INT_MASK         DSP2_MISC_RG_SEOF3_INT_MASK
#define DSP2_MISC_RG_SEOF3_INT_MASK_POS     (16U)
#define DSP2_MISC_RG_SEOF3_INT_MASK_LEN     (1U)
#define DSP2_MISC_RG_SEOF3_INT_MASK_MSK     (((1U << DSP2_MISC_RG_SEOF3_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_MASK_POS)
#define DSP2_MISC_RG_SEOF3_INT_MASK_UMSK    (~(((1U << DSP2_MISC_RG_SEOF3_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_MASK_POS))
#define DSP2_MISC_RG_SEOF3_INT_EDGE         DSP2_MISC_RG_SEOF3_INT_EDGE
#define DSP2_MISC_RG_SEOF3_INT_EDGE_POS     (17U)
#define DSP2_MISC_RG_SEOF3_INT_EDGE_LEN     (1U)
#define DSP2_MISC_RG_SEOF3_INT_EDGE_MSK     (((1U << DSP2_MISC_RG_SEOF3_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_EDGE_POS)
#define DSP2_MISC_RG_SEOF3_INT_EDGE_UMSK    (~(((1U << DSP2_MISC_RG_SEOF3_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_EDGE_POS))
#define DSP2_MISC_RG_SEOF3_INT_SRC          DSP2_MISC_RG_SEOF3_INT_SRC
#define DSP2_MISC_RG_SEOF3_INT_SRC_POS      (18U)
#define DSP2_MISC_RG_SEOF3_INT_SRC_LEN      (2U)
#define DSP2_MISC_RG_SEOF3_INT_SRC_MSK      (((1U << DSP2_MISC_RG_SEOF3_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_SRC_POS)
#define DSP2_MISC_RG_SEOF3_INT_SRC_UMSK     (~(((1U << DSP2_MISC_RG_SEOF3_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF3_INT_SRC_POS))
#define DSP2_MISC_RG_AE_HIST_INT_MASK       DSP2_MISC_RG_AE_HIST_INT_MASK
#define DSP2_MISC_RG_AE_HIST_INT_MASK_POS   (20U)
#define DSP2_MISC_RG_AE_HIST_INT_MASK_LEN   (1U)
#define DSP2_MISC_RG_AE_HIST_INT_MASK_MSK   (((1U << DSP2_MISC_RG_AE_HIST_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AE_HIST_INT_MASK_POS)
#define DSP2_MISC_RG_AE_HIST_INT_MASK_UMSK  (~(((1U << DSP2_MISC_RG_AE_HIST_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AE_HIST_INT_MASK_POS))
#define DSP2_MISC_RG_AWB3_INT_MASK          DSP2_MISC_RG_AWB3_INT_MASK
#define DSP2_MISC_RG_AWB3_INT_MASK_POS      (21U)
#define DSP2_MISC_RG_AWB3_INT_MASK_LEN      (1U)
#define DSP2_MISC_RG_AWB3_INT_MASK_MSK      (((1U << DSP2_MISC_RG_AWB3_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AWB3_INT_MASK_POS)
#define DSP2_MISC_RG_AWB3_INT_MASK_UMSK     (~(((1U << DSP2_MISC_RG_AWB3_INT_MASK_LEN) - 1) << DSP2_MISC_RG_AWB3_INT_MASK_POS))
#define DSP2_MISC_RG_DP_SEOF0_INT_SRC       DSP2_MISC_RG_DP_SEOF0_INT_SRC
#define DSP2_MISC_RG_DP_SEOF0_INT_SRC_POS   (22U)
#define DSP2_MISC_RG_DP_SEOF0_INT_SRC_LEN   (1U)
#define DSP2_MISC_RG_DP_SEOF0_INT_SRC_MSK   (((1U << DSP2_MISC_RG_DP_SEOF0_INT_SRC_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_SRC_POS)
#define DSP2_MISC_RG_DP_SEOF0_INT_SRC_UMSK  (~(((1U << DSP2_MISC_RG_DP_SEOF0_INT_SRC_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_SRC_POS))
#define DSP2_MISC_RG_DP_SEOF0_INT_EDGE      DSP2_MISC_RG_DP_SEOF0_INT_EDGE
#define DSP2_MISC_RG_DP_SEOF0_INT_EDGE_POS  (23U)
#define DSP2_MISC_RG_DP_SEOF0_INT_EDGE_LEN  (1U)
#define DSP2_MISC_RG_DP_SEOF0_INT_EDGE_MSK  (((1U << DSP2_MISC_RG_DP_SEOF0_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_EDGE_POS)
#define DSP2_MISC_RG_DP_SEOF0_INT_EDGE_UMSK (~(((1U << DSP2_MISC_RG_DP_SEOF0_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_EDGE_POS))
#define DSP2_MISC_RG_DP_SEOF0_INT_MASK      DSP2_MISC_RG_DP_SEOF0_INT_MASK
#define DSP2_MISC_RG_DP_SEOF0_INT_MASK_POS  (24U)
#define DSP2_MISC_RG_DP_SEOF0_INT_MASK_LEN  (1U)
#define DSP2_MISC_RG_DP_SEOF0_INT_MASK_MSK  (((1U << DSP2_MISC_RG_DP_SEOF0_INT_MASK_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_MASK_POS)
#define DSP2_MISC_RG_DP_SEOF0_INT_MASK_UMSK (~(((1U << DSP2_MISC_RG_DP_SEOF0_INT_MASK_LEN) - 1) << DSP2_MISC_RG_DP_SEOF0_INT_MASK_POS))
#define DSP2_MISC_RG_SEOF4_INT_MASK         DSP2_MISC_RG_SEOF4_INT_MASK
#define DSP2_MISC_RG_SEOF4_INT_MASK_POS     (28U)
#define DSP2_MISC_RG_SEOF4_INT_MASK_LEN     (1U)
#define DSP2_MISC_RG_SEOF4_INT_MASK_MSK     (((1U << DSP2_MISC_RG_SEOF4_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_MASK_POS)
#define DSP2_MISC_RG_SEOF4_INT_MASK_UMSK    (~(((1U << DSP2_MISC_RG_SEOF4_INT_MASK_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_MASK_POS))
#define DSP2_MISC_RG_SEOF4_INT_EDGE         DSP2_MISC_RG_SEOF4_INT_EDGE
#define DSP2_MISC_RG_SEOF4_INT_EDGE_POS     (29U)
#define DSP2_MISC_RG_SEOF4_INT_EDGE_LEN     (1U)
#define DSP2_MISC_RG_SEOF4_INT_EDGE_MSK     (((1U << DSP2_MISC_RG_SEOF4_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_EDGE_POS)
#define DSP2_MISC_RG_SEOF4_INT_EDGE_UMSK    (~(((1U << DSP2_MISC_RG_SEOF4_INT_EDGE_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_EDGE_POS))
#define DSP2_MISC_RG_SEOF4_INT_SRC          DSP2_MISC_RG_SEOF4_INT_SRC
#define DSP2_MISC_RG_SEOF4_INT_SRC_POS      (30U)
#define DSP2_MISC_RG_SEOF4_INT_SRC_LEN      (2U)
#define DSP2_MISC_RG_SEOF4_INT_SRC_MSK      (((1U << DSP2_MISC_RG_SEOF4_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_SRC_POS)
#define DSP2_MISC_RG_SEOF4_INT_SRC_UMSK     (~(((1U << DSP2_MISC_RG_SEOF4_INT_SRC_LEN) - 1) << DSP2_MISC_RG_SEOF4_INT_SRC_POS))

/* 0x28 : dsp2_id_yuv */
#define DSP2_MISC_DSP2_ID_YUV_OFFSET           (0x28)
#define DSP2_MISC_REG_YUV_IDGEN_RST           DSP2_MISC_REG_YUV_IDGEN_RST
#define DSP2_MISC_REG_YUV_IDGEN_RST_POS       (0U)
#define DSP2_MISC_REG_YUV_IDGEN_RST_LEN       (1U)
#define DSP2_MISC_REG_YUV_IDGEN_RST_MSK       (((1U << DSP2_MISC_REG_YUV_IDGEN_RST_LEN) - 1) << DSP2_MISC_REG_YUV_IDGEN_RST_POS)
#define DSP2_MISC_REG_YUV_IDGEN_RST_UMSK      (~(((1U << DSP2_MISC_REG_YUV_IDGEN_RST_LEN) - 1) << DSP2_MISC_REG_YUV_IDGEN_RST_POS))
#define DSP2_MISC_REG_YUV_IDGEN_EDGE          DSP2_MISC_REG_YUV_IDGEN_EDGE
#define DSP2_MISC_REG_YUV_IDGEN_EDGE_POS      (1U)
#define DSP2_MISC_REG_YUV_IDGEN_EDGE_LEN      (1U)
#define DSP2_MISC_REG_YUV_IDGEN_EDGE_MSK      (((1U << DSP2_MISC_REG_YUV_IDGEN_EDGE_LEN) - 1) << DSP2_MISC_REG_YUV_IDGEN_EDGE_POS)
#define DSP2_MISC_REG_YUV_IDGEN_EDGE_UMSK     (~(((1U << DSP2_MISC_REG_YUV_IDGEN_EDGE_LEN) - 1) << DSP2_MISC_REG_YUV_IDGEN_EDGE_POS))
#define DSP2_MISC_REG_YUV_IDGEN_CNT_INCR      DSP2_MISC_REG_YUV_IDGEN_CNT_INCR
#define DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_POS  (16U)
#define DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_LEN  (16U)
#define DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_MSK  (((1U << DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_LEN) - 1) << DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_POS)
#define DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_UMSK (~(((1U << DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_LEN) - 1) << DSP2_MISC_REG_YUV_IDGEN_CNT_INCR_POS))

/* 0x2C : dvp_reshape */
#define DSP2_MISC_DVP_RESHAPE_OFFSET      (0x2C)
#define DSP2_MISC_REG_RSHP_TGL_COUNT      DSP2_MISC_REG_RSHP_TGL_COUNT
#define DSP2_MISC_REG_RSHP_TGL_COUNT_POS  (0U)
#define DSP2_MISC_REG_RSHP_TGL_COUNT_LEN  (5U)
#define DSP2_MISC_REG_RSHP_TGL_COUNT_MSK  (((1U << DSP2_MISC_REG_RSHP_TGL_COUNT_LEN) - 1) << DSP2_MISC_REG_RSHP_TGL_COUNT_POS)
#define DSP2_MISC_REG_RSHP_TGL_COUNT_UMSK (~(((1U << DSP2_MISC_REG_RSHP_TGL_COUNT_LEN) - 1) << DSP2_MISC_REG_RSHP_TGL_COUNT_POS))
#define DSP2_MISC_REG_RSHP_HSYNC_INV      DSP2_MISC_REG_RSHP_HSYNC_INV
#define DSP2_MISC_REG_RSHP_HSYNC_INV_POS  (5U)
#define DSP2_MISC_REG_RSHP_HSYNC_INV_LEN  (1U)
#define DSP2_MISC_REG_RSHP_HSYNC_INV_MSK  (((1U << DSP2_MISC_REG_RSHP_HSYNC_INV_LEN) - 1) << DSP2_MISC_REG_RSHP_HSYNC_INV_POS)
#define DSP2_MISC_REG_RSHP_HSYNC_INV_UMSK (~(((1U << DSP2_MISC_REG_RSHP_HSYNC_INV_LEN) - 1) << DSP2_MISC_REG_RSHP_HSYNC_INV_POS))
#define DSP2_MISC_REG_RSHP_VSYNC_INV      DSP2_MISC_REG_RSHP_VSYNC_INV
#define DSP2_MISC_REG_RSHP_VSYNC_INV_POS  (6U)
#define DSP2_MISC_REG_RSHP_VSYNC_INV_LEN  (1U)
#define DSP2_MISC_REG_RSHP_VSYNC_INV_MSK  (((1U << DSP2_MISC_REG_RSHP_VSYNC_INV_LEN) - 1) << DSP2_MISC_REG_RSHP_VSYNC_INV_POS)
#define DSP2_MISC_REG_RSHP_VSYNC_INV_UMSK (~(((1U << DSP2_MISC_REG_RSHP_VSYNC_INV_LEN) - 1) << DSP2_MISC_REG_RSHP_VSYNC_INV_POS))
#define DSP2_MISC_REG_RSHP_CLR            DSP2_MISC_REG_RSHP_CLR
#define DSP2_MISC_REG_RSHP_CLR_POS        (7U)
#define DSP2_MISC_REG_RSHP_CLR_LEN        (1U)
#define DSP2_MISC_REG_RSHP_CLR_MSK        (((1U << DSP2_MISC_REG_RSHP_CLR_LEN) - 1) << DSP2_MISC_REG_RSHP_CLR_POS)
#define DSP2_MISC_REG_RSHP_CLR_UMSK       (~(((1U << DSP2_MISC_REG_RSHP_CLR_LEN) - 1) << DSP2_MISC_REG_RSHP_CLR_POS))
#define DSP2_MISC_REG_RSHP_EN             DSP2_MISC_REG_RSHP_EN
#define DSP2_MISC_REG_RSHP_EN_POS         (8U)
#define DSP2_MISC_REG_RSHP_EN_LEN         (1U)
#define DSP2_MISC_REG_RSHP_EN_MSK         (((1U << DSP2_MISC_REG_RSHP_EN_LEN) - 1) << DSP2_MISC_REG_RSHP_EN_POS)
#define DSP2_MISC_REG_RSHP_EN_UMSK        (~(((1U << DSP2_MISC_REG_RSHP_EN_LEN) - 1) << DSP2_MISC_REG_RSHP_EN_POS))

/* 0x40 : scalerA_i_size */
#define DSP2_MISC_SCALERA_I_SIZE_OFFSET  (0x40)
#define DSP2_MISC_RG_SCALERA_I_W         DSP2_MISC_RG_SCALERA_I_W
#define DSP2_MISC_RG_SCALERA_I_W_POS     (0U)
#define DSP2_MISC_RG_SCALERA_I_W_LEN     (11U)
#define DSP2_MISC_RG_SCALERA_I_W_MSK     (((1U << DSP2_MISC_RG_SCALERA_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERA_I_W_POS)
#define DSP2_MISC_RG_SCALERA_I_W_UMSK    (~(((1U << DSP2_MISC_RG_SCALERA_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERA_I_W_POS))
#define DSP2_MISC_RG_SCALERA_I_H         DSP2_MISC_RG_SCALERA_I_H
#define DSP2_MISC_RG_SCALERA_I_H_POS     (16U)
#define DSP2_MISC_RG_SCALERA_I_H_LEN     (11U)
#define DSP2_MISC_RG_SCALERA_I_H_MSK     (((1U << DSP2_MISC_RG_SCALERA_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERA_I_H_POS)
#define DSP2_MISC_RG_SCALERA_I_H_UMSK    (~(((1U << DSP2_MISC_RG_SCALERA_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERA_I_H_POS))
#define DSP2_MISC_RG_SCLRA_SW_SH         DSP2_MISC_RG_SCLRA_SW_SH
#define DSP2_MISC_RG_SCLRA_SW_SH_POS     (27U)
#define DSP2_MISC_RG_SCLRA_SW_SH_LEN     (1U)
#define DSP2_MISC_RG_SCLRA_SW_SH_MSK     (((1U << DSP2_MISC_RG_SCLRA_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRA_SW_SH_POS)
#define DSP2_MISC_RG_SCLRA_SW_SH_UMSK    (~(((1U << DSP2_MISC_RG_SCLRA_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRA_SW_SH_POS))
#define DSP2_MISC_RG_SCALERA_BYPASS      DSP2_MISC_RG_SCALERA_BYPASS
#define DSP2_MISC_RG_SCALERA_BYPASS_POS  (28U)
#define DSP2_MISC_RG_SCALERA_BYPASS_LEN  (1U)
#define DSP2_MISC_RG_SCALERA_BYPASS_MSK  (((1U << DSP2_MISC_RG_SCALERA_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERA_BYPASS_POS)
#define DSP2_MISC_RG_SCALERA_BYPASS_UMSK (~(((1U << DSP2_MISC_RG_SCALERA_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERA_BYPASS_POS))
#define DSP2_MISC_RG_SCALERA_SEL         DSP2_MISC_RG_SCALERA_SEL
#define DSP2_MISC_RG_SCALERA_SEL_POS     (29U)
#define DSP2_MISC_RG_SCALERA_SEL_LEN     (3U)
#define DSP2_MISC_RG_SCALERA_SEL_MSK     (((1U << DSP2_MISC_RG_SCALERA_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERA_SEL_POS)
#define DSP2_MISC_RG_SCALERA_SEL_UMSK    (~(((1U << DSP2_MISC_RG_SCALERA_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERA_SEL_POS))

/* 0x44 : scalerA_o_size */
#define DSP2_MISC_SCALERA_O_SIZE_OFFSET (0x44)
#define DSP2_MISC_RG_SCALERA_O_W        DSP2_MISC_RG_SCALERA_O_W
#define DSP2_MISC_RG_SCALERA_O_W_POS    (0U)
#define DSP2_MISC_RG_SCALERA_O_W_LEN    (11U)
#define DSP2_MISC_RG_SCALERA_O_W_MSK    (((1U << DSP2_MISC_RG_SCALERA_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERA_O_W_POS)
#define DSP2_MISC_RG_SCALERA_O_W_UMSK   (~(((1U << DSP2_MISC_RG_SCALERA_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERA_O_W_POS))
#define DSP2_MISC_RG_SCALERA_O_H        DSP2_MISC_RG_SCALERA_O_H
#define DSP2_MISC_RG_SCALERA_O_H_POS    (16U)
#define DSP2_MISC_RG_SCALERA_O_H_LEN    (11U)
#define DSP2_MISC_RG_SCALERA_O_H_MSK    (((1U << DSP2_MISC_RG_SCALERA_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERA_O_H_POS)
#define DSP2_MISC_RG_SCALERA_O_H_UMSK   (~(((1U << DSP2_MISC_RG_SCALERA_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERA_O_H_POS))

