RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x48 : scalerB_i_size */
#define DSP2_MISC_SCALERB_I_SIZE_OFFSET  (0x48)
#define DSP2_MISC_RG_SCALERB_I_W         DSP2_MISC_RG_SCALERB_I_W
#define DSP2_MISC_RG_SCALERB_I_W_POS     (0U)
#define DSP2_MISC_RG_SCALERB_I_W_LEN     (11U)
#define DSP2_MISC_RG_SCALERB_I_W_MSK     (((1U << DSP2_MISC_RG_SCALERB_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERB_I_W_POS)
#define DSP2_MISC_RG_SCALERB_I_W_UMSK    (~(((1U << DSP2_MISC_RG_SCALERB_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERB_I_W_POS))
#define DSP2_MISC_RG_SCALERB_I_H         DSP2_MISC_RG_SCALERB_I_H
#define DSP2_MISC_RG_SCALERB_I_H_POS     (16U)
#define DSP2_MISC_RG_SCALERB_I_H_LEN     (11U)
#define DSP2_MISC_RG_SCALERB_I_H_MSK     (((1U << DSP2_MISC_RG_SCALERB_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERB_I_H_POS)
#define DSP2_MISC_RG_SCALERB_I_H_UMSK    (~(((1U << DSP2_MISC_RG_SCALERB_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERB_I_H_POS))
#define DSP2_MISC_RG_SCLRB_SW_SH         DSP2_MISC_RG_SCLRB_SW_SH
#define DSP2_MISC_RG_SCLRB_SW_SH_POS     (27U)
#define DSP2_MISC_RG_SCLRB_SW_SH_LEN     (1U)
#define DSP2_MISC_RG_SCLRB_SW_SH_MSK     (((1U << DSP2_MISC_RG_SCLRB_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRB_SW_SH_POS)
#define DSP2_MISC_RG_SCLRB_SW_SH_UMSK    (~(((1U << DSP2_MISC_RG_SCLRB_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRB_SW_SH_POS))
#define DSP2_MISC_RG_SCALERB_BYPASS      DSP2_MISC_RG_SCALERB_BYPASS
#define DSP2_MISC_RG_SCALERB_BYPASS_POS  (28U)
#define DSP2_MISC_RG_SCALERB_BYPASS_LEN  (1U)
#define DSP2_MISC_RG_SCALERB_BYPASS_MSK  (((1U << DSP2_MISC_RG_SCALERB_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERB_BYPASS_POS)
#define DSP2_MISC_RG_SCALERB_BYPASS_UMSK (~(((1U << DSP2_MISC_RG_SCALERB_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERB_BYPASS_POS))
#define DSP2_MISC_RG_SCALERB_SEL         DSP2_MISC_RG_SCALERB_SEL
#define DSP2_MISC_RG_SCALERB_SEL_POS     (29U)
#define DSP2_MISC_RG_SCALERB_SEL_LEN     (3U)
#define DSP2_MISC_RG_SCALERB_SEL_MSK     (((1U << DSP2_MISC_RG_SCALERB_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERB_SEL_POS)
#define DSP2_MISC_RG_SCALERB_SEL_UMSK    (~(((1U << DSP2_MISC_RG_SCALERB_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERB_SEL_POS))

/* 0x4C : scalerB_o_size */
#define DSP2_MISC_SCALERB_O_SIZE_OFFSET (0x4C)
#define DSP2_MISC_RG_SCALERB_O_W        DSP2_MISC_RG_SCALERB_O_W
#define DSP2_MISC_RG_SCALERB_O_W_POS    (0U)
#define DSP2_MISC_RG_SCALERB_O_W_LEN    (11U)
#define DSP2_MISC_RG_SCALERB_O_W_MSK    (((1U << DSP2_MISC_RG_SCALERB_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERB_O_W_POS)
#define DSP2_MISC_RG_SCALERB_O_W_UMSK   (~(((1U << DSP2_MISC_RG_SCALERB_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERB_O_W_POS))
#define DSP2_MISC_RG_SCALERB_O_H        DSP2_MISC_RG_SCALERB_O_H
#define DSP2_MISC_RG_SCALERB_O_H_POS    (16U)
#define DSP2_MISC_RG_SCALERB_O_H_LEN    (11U)
#define DSP2_MISC_RG_SCALERB_O_H_MSK    (((1U << DSP2_MISC_RG_SCALERB_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERB_O_H_POS)
#define DSP2_MISC_RG_SCALERB_O_H_UMSK   (~(((1U << DSP2_MISC_RG_SCALERB_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERB_O_H_POS))

/* 0x50 : scalerC_i_size */
#define DSP2_MISC_SCALERC_I_SIZE_OFFSET  (0x50)
#define DSP2_MISC_RG_SCALERC_I_W         DSP2_MISC_RG_SCALERC_I_W
#define DSP2_MISC_RG_SCALERC_I_W_POS     (0U)
#define DSP2_MISC_RG_SCALERC_I_W_LEN     (11U)
#define DSP2_MISC_RG_SCALERC_I_W_MSK     (((1U << DSP2_MISC_RG_SCALERC_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERC_I_W_POS)
#define DSP2_MISC_RG_SCALERC_I_W_UMSK    (~(((1U << DSP2_MISC_RG_SCALERC_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERC_I_W_POS))
#define DSP2_MISC_RG_SCALERC_I_H         DSP2_MISC_RG_SCALERC_I_H
#define DSP2_MISC_RG_SCALERC_I_H_POS     (16U)
#define DSP2_MISC_RG_SCALERC_I_H_LEN     (11U)
#define DSP2_MISC_RG_SCALERC_I_H_MSK     (((1U << DSP2_MISC_RG_SCALERC_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERC_I_H_POS)
#define DSP2_MISC_RG_SCALERC_I_H_UMSK    (~(((1U << DSP2_MISC_RG_SCALERC_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERC_I_H_POS))
#define DSP2_MISC_RG_SCLRC_SW_SH         DSP2_MISC_RG_SCLRC_SW_SH
#define DSP2_MISC_RG_SCLRC_SW_SH_POS     (27U)
#define DSP2_MISC_RG_SCLRC_SW_SH_LEN     (1U)
#define DSP2_MISC_RG_SCLRC_SW_SH_MSK     (((1U << DSP2_MISC_RG_SCLRC_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRC_SW_SH_POS)
#define DSP2_MISC_RG_SCLRC_SW_SH_UMSK    (~(((1U << DSP2_MISC_RG_SCLRC_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRC_SW_SH_POS))
#define DSP2_MISC_RG_SCALERC_BYPASS      DSP2_MISC_RG_SCALERC_BYPASS
#define DSP2_MISC_RG_SCALERC_BYPASS_POS  (28U)
#define DSP2_MISC_RG_SCALERC_BYPASS_LEN  (1U)
#define DSP2_MISC_RG_SCALERC_BYPASS_MSK  (((1U << DSP2_MISC_RG_SCALERC_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERC_BYPASS_POS)
#define DSP2_MISC_RG_SCALERC_BYPASS_UMSK (~(((1U << DSP2_MISC_RG_SCALERC_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERC_BYPASS_POS))
#define DSP2_MISC_RG_SCALERC_SEL         DSP2_MISC_RG_SCALERC_SEL
#define DSP2_MISC_RG_SCALERC_SEL_POS     (29U)
#define DSP2_MISC_RG_SCALERC_SEL_LEN     (3U)
#define DSP2_MISC_RG_SCALERC_SEL_MSK     (((1U << DSP2_MISC_RG_SCALERC_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERC_SEL_POS)
#define DSP2_MISC_RG_SCALERC_SEL_UMSK    (~(((1U << DSP2_MISC_RG_SCALERC_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERC_SEL_POS))

/* 0x54 : scalerC_o_size */
#define DSP2_MISC_SCALERC_O_SIZE_OFFSET (0x54)
#define DSP2_MISC_RG_SCALERC_O_W        DSP2_MISC_RG_SCALERC_O_W
#define DSP2_MISC_RG_SCALERC_O_W_POS    (0U)
#define DSP2_MISC_RG_SCALERC_O_W_LEN    (11U)
#define DSP2_MISC_RG_SCALERC_O_W_MSK    (((1U << DSP2_MISC_RG_SCALERC_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERC_O_W_POS)
#define DSP2_MISC_RG_SCALERC_O_W_UMSK   (~(((1U << DSP2_MISC_RG_SCALERC_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERC_O_W_POS))
#define DSP2_MISC_RG_SCALERC_O_H        DSP2_MISC_RG_SCALERC_O_H
#define DSP2_MISC_RG_SCALERC_O_H_POS    (16U)
#define DSP2_MISC_RG_SCALERC_O_H_LEN    (11U)
#define DSP2_MISC_RG_SCALERC_O_H_MSK    (((1U << DSP2_MISC_RG_SCALERC_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERC_O_H_POS)
#define DSP2_MISC_RG_SCALERC_O_H_UMSK   (~(((1U << DSP2_MISC_RG_SCALERC_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERC_O_H_POS))

/* 0x58 : scalerD_i_size */
#define DSP2_MISC_SCALERD_I_SIZE_OFFSET  (0x58)
#define DSP2_MISC_RG_SCALERD_I_W         DSP2_MISC_RG_SCALERD_I_W
#define DSP2_MISC_RG_SCALERD_I_W_POS     (0U)
#define DSP2_MISC_RG_SCALERD_I_W_LEN     (11U)
#define DSP2_MISC_RG_SCALERD_I_W_MSK     (((1U << DSP2_MISC_RG_SCALERD_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERD_I_W_POS)
#define DSP2_MISC_RG_SCALERD_I_W_UMSK    (~(((1U << DSP2_MISC_RG_SCALERD_I_W_LEN) - 1) << DSP2_MISC_RG_SCALERD_I_W_POS))
#define DSP2_MISC_RG_SCALERD_I_H         DSP2_MISC_RG_SCALERD_I_H
#define DSP2_MISC_RG_SCALERD_I_H_POS     (16U)
#define DSP2_MISC_RG_SCALERD_I_H_LEN     (11U)
#define DSP2_MISC_RG_SCALERD_I_H_MSK     (((1U << DSP2_MISC_RG_SCALERD_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERD_I_H_POS)
#define DSP2_MISC_RG_SCALERD_I_H_UMSK    (~(((1U << DSP2_MISC_RG_SCALERD_I_H_LEN) - 1) << DSP2_MISC_RG_SCALERD_I_H_POS))
#define DSP2_MISC_RG_SCLRD_SW_SH         DSP2_MISC_RG_SCLRD_SW_SH
#define DSP2_MISC_RG_SCLRD_SW_SH_POS     (27U)
#define DSP2_MISC_RG_SCLRD_SW_SH_LEN     (1U)
#define DSP2_MISC_RG_SCLRD_SW_SH_MSK     (((1U << DSP2_MISC_RG_SCLRD_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRD_SW_SH_POS)
#define DSP2_MISC_RG_SCLRD_SW_SH_UMSK    (~(((1U << DSP2_MISC_RG_SCLRD_SW_SH_LEN) - 1) << DSP2_MISC_RG_SCLRD_SW_SH_POS))
#define DSP2_MISC_RG_SCALERD_BYPASS      DSP2_MISC_RG_SCALERD_BYPASS
#define DSP2_MISC_RG_SCALERD_BYPASS_POS  (28U)
#define DSP2_MISC_RG_SCALERD_BYPASS_LEN  (1U)
#define DSP2_MISC_RG_SCALERD_BYPASS_MSK  (((1U << DSP2_MISC_RG_SCALERD_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERD_BYPASS_POS)
#define DSP2_MISC_RG_SCALERD_BYPASS_UMSK (~(((1U << DSP2_MISC_RG_SCALERD_BYPASS_LEN) - 1) << DSP2_MISC_RG_SCALERD_BYPASS_POS))
#define DSP2_MISC_RG_SCALERD_SEL         DSP2_MISC_RG_SCALERD_SEL
#define DSP2_MISC_RG_SCALERD_SEL_POS     (29U)
#define DSP2_MISC_RG_SCALERD_SEL_LEN     (3U)
#define DSP2_MISC_RG_SCALERD_SEL_MSK     (((1U << DSP2_MISC_RG_SCALERD_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERD_SEL_POS)
#define DSP2_MISC_RG_SCALERD_SEL_UMSK    (~(((1U << DSP2_MISC_RG_SCALERD_SEL_LEN) - 1) << DSP2_MISC_RG_SCALERD_SEL_POS))

/* 0x5C : scalerD_o_size */
#define DSP2_MISC_SCALERD_O_SIZE_OFFSET (0x5C)
#define DSP2_MISC_RG_SCALERD_O_W        DSP2_MISC_RG_SCALERD_O_W
#define DSP2_MISC_RG_SCALERD_O_W_POS    (0U)
#define DSP2_MISC_RG_SCALERD_O_W_LEN    (11U)
#define DSP2_MISC_RG_SCALERD_O_W_MSK    (((1U << DSP2_MISC_RG_SCALERD_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERD_O_W_POS)
#define DSP2_MISC_RG_SCALERD_O_W_UMSK   (~(((1U << DSP2_MISC_RG_SCALERD_O_W_LEN) - 1) << DSP2_MISC_RG_SCALERD_O_W_POS))
#define DSP2_MISC_RG_SCALERD_O_H        DSP2_MISC_RG_SCALERD_O_H
#define DSP2_MISC_RG_SCALERD_O_H_POS    (16U)
#define DSP2_MISC_RG_SCALERD_O_H_LEN    (11U)
#define DSP2_MISC_RG_SCALERD_O_H_MSK    (((1U << DSP2_MISC_RG_SCALERD_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERD_O_H_POS)
#define DSP2_MISC_RG_SCALERD_O_H_UMSK   (~(((1U << DSP2_MISC_RG_SCALERD_O_H_LEN) - 1) << DSP2_MISC_RG_SCALERD_O_H_POS))

/* 0x60 : disp_config */
#define DSP2_MISC_DISP_CONFIG_OFFSET     (0x60)
#define DSP2_MISC_RG_DISP_BT656_EN       DSP2_MISC_RG_DISP_BT656_EN
#define DSP2_MISC_RG_DISP_BT656_EN_POS   (4U)
#define DSP2_MISC_RG_DISP_BT656_EN_LEN   (1U)
#define DSP2_MISC_RG_DISP_BT656_EN_MSK   (((1U << DSP2_MISC_RG_DISP_BT656_EN_LEN) - 1) << DSP2_MISC_RG_DISP_BT656_EN_POS)
#define DSP2_MISC_RG_DISP_BT656_EN_UMSK  (~(((1U << DSP2_MISC_RG_DISP_BT656_EN_LEN) - 1) << DSP2_MISC_RG_DISP_BT656_EN_POS))
#define DSP2_MISC_RG_DISP_BT1120_EN      DSP2_MISC_RG_DISP_BT1120_EN
#define DSP2_MISC_RG_DISP_BT1120_EN_POS  (5U)
#define DSP2_MISC_RG_DISP_BT1120_EN_LEN  (1U)
#define DSP2_MISC_RG_DISP_BT1120_EN_MSK  (((1U << DSP2_MISC_RG_DISP_BT1120_EN_LEN) - 1) << DSP2_MISC_RG_DISP_BT1120_EN_POS)
#define DSP2_MISC_RG_DISP_BT1120_EN_UMSK (~(((1U << DSP2_MISC_RG_DISP_BT1120_EN_LEN) - 1) << DSP2_MISC_RG_DISP_BT1120_EN_POS))
#define DSP2_MISC_RG_DISP_DPI_EN         DSP2_MISC_RG_DISP_DPI_EN
#define DSP2_MISC_RG_DISP_DPI_EN_POS     (6U)
#define DSP2_MISC_RG_DISP_DPI_EN_LEN     (1U)
#define DSP2_MISC_RG_DISP_DPI_EN_MSK     (((1U << DSP2_MISC_RG_DISP_DPI_EN_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_EN_POS)
#define DSP2_MISC_RG_DISP_DPI_EN_UMSK    (~(((1U << DSP2_MISC_RG_DISP_DPI_EN_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_EN_POS))
#define DSP2_MISC_RG_DISP_HDMI_EN        DSP2_MISC_RG_DISP_HDMI_EN
#define DSP2_MISC_RG_DISP_HDMI_EN_POS    (7U)
#define DSP2_MISC_RG_DISP_HDMI_EN_LEN    (1U)
#define DSP2_MISC_RG_DISP_HDMI_EN_MSK    (((1U << DSP2_MISC_RG_DISP_HDMI_EN_LEN) - 1) << DSP2_MISC_RG_DISP_HDMI_EN_POS)
#define DSP2_MISC_RG_DISP_HDMI_EN_UMSK   (~(((1U << DSP2_MISC_RG_DISP_HDMI_EN_LEN) - 1) << DSP2_MISC_RG_DISP_HDMI_EN_POS))
#define DSP2_MISC_RG_DISP_MUX_SEL        DSP2_MISC_RG_DISP_MUX_SEL
#define DSP2_MISC_RG_DISP_MUX_SEL_POS    (8U)
#define DSP2_MISC_RG_DISP_MUX_SEL_LEN    (2U)
#define DSP2_MISC_RG_DISP_MUX_SEL_MSK    (((1U << DSP2_MISC_RG_DISP_MUX_SEL_LEN) - 1) << DSP2_MISC_RG_DISP_MUX_SEL_POS)
#define DSP2_MISC_RG_DISP_MUX_SEL_UMSK   (~(((1U << DSP2_MISC_RG_DISP_MUX_SEL_LEN) - 1) << DSP2_MISC_RG_DISP_MUX_SEL_POS))
#define DSP2_MISC_RG_OSDDP_SEL           DSP2_MISC_RG_OSDDP_SEL
#define DSP2_MISC_RG_OSDDP_SEL_POS       (12U)
#define DSP2_MISC_RG_OSDDP_SEL_LEN       (2U)
#define DSP2_MISC_RG_OSDDP_SEL_MSK       (((1U << DSP2_MISC_RG_OSDDP_SEL_LEN) - 1) << DSP2_MISC_RG_OSDDP_SEL_POS)
#define DSP2_MISC_RG_OSDDP_SEL_UMSK      (~(((1U << DSP2_MISC_RG_OSDDP_SEL_LEN) - 1) << DSP2_MISC_RG_OSDDP_SEL_POS))
#define DSP2_MISC_RG_DISP_CLKO_INV       DSP2_MISC_RG_DISP_CLKO_INV
#define DSP2_MISC_RG_DISP_CLKO_INV_POS   (31U)
#define DSP2_MISC_RG_DISP_CLKO_INV_LEN   (1U)
#define DSP2_MISC_RG_DISP_CLKO_INV_MSK   (((1U << DSP2_MISC_RG_DISP_CLKO_INV_LEN) - 1) << DSP2_MISC_RG_DISP_CLKO_INV_POS)
#define DSP2_MISC_RG_DISP_CLKO_INV_UMSK  (~(((1U << DSP2_MISC_RG_DISP_CLKO_INV_LEN) - 1) << DSP2_MISC_RG_DISP_CLKO_INV_POS))

