RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x64 : disp_dpi_config */
#define DSP2_MISC_DISP_DPI_CONFIG_OFFSET (0x64)
#define DSP2_MISC_RG_DISP_DPI_HS_W       DSP2_MISC_RG_DISP_DPI_HS_W
#define DSP2_MISC_RG_DISP_DPI_HS_W_POS   (0U)
#define DSP2_MISC_RG_DISP_DPI_HS_W_LEN   (8U)
#define DSP2_MISC_RG_DISP_DPI_HS_W_MSK   (((1U << DSP2_MISC_RG_DISP_DPI_HS_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_HS_W_POS)
#define DSP2_MISC_RG_DISP_DPI_HS_W_UMSK  (~(((1U << DSP2_MISC_RG_DISP_DPI_HS_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_HS_W_POS))
#define DSP2_MISC_RG_DISP_DPI_HFP_W      DSP2_MISC_RG_DISP_DPI_HFP_W
#define DSP2_MISC_RG_DISP_DPI_HFP_W_POS  (8U)
#define DSP2_MISC_RG_DISP_DPI_HFP_W_LEN  (8U)
#define DSP2_MISC_RG_DISP_DPI_HFP_W_MSK  (((1U << DSP2_MISC_RG_DISP_DPI_HFP_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_HFP_W_POS)
#define DSP2_MISC_RG_DISP_DPI_HFP_W_UMSK (~(((1U << DSP2_MISC_RG_DISP_DPI_HFP_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_HFP_W_POS))
#define DSP2_MISC_RG_DISP_DPI_VS_W       DSP2_MISC_RG_DISP_DPI_VS_W
#define DSP2_MISC_RG_DISP_DPI_VS_W_POS   (16U)
#define DSP2_MISC_RG_DISP_DPI_VS_W_LEN   (8U)
#define DSP2_MISC_RG_DISP_DPI_VS_W_MSK   (((1U << DSP2_MISC_RG_DISP_DPI_VS_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_VS_W_POS)
#define DSP2_MISC_RG_DISP_DPI_VS_W_UMSK  (~(((1U << DSP2_MISC_RG_DISP_DPI_VS_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_VS_W_POS))
#define DSP2_MISC_RG_DISP_DPI_VFP_W      DSP2_MISC_RG_DISP_DPI_VFP_W
#define DSP2_MISC_RG_DISP_DPI_VFP_W_POS  (24U)
#define DSP2_MISC_RG_DISP_DPI_VFP_W_LEN  (8U)
#define DSP2_MISC_RG_DISP_DPI_VFP_W_MSK  (((1U << DSP2_MISC_RG_DISP_DPI_VFP_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_VFP_W_POS)
#define DSP2_MISC_RG_DISP_DPI_VFP_W_UMSK (~(((1U << DSP2_MISC_RG_DISP_DPI_VFP_W_LEN) - 1) << DSP2_MISC_RG_DISP_DPI_VFP_W_POS))

/* 0x68 : disp_yuv_rgb_config_0 */
#define DSP2_MISC_DISP_YUV_RGB_CONFIG_0_OFFSET (0x68)
#define DSP2_MISC_RG_DISP_Y2R_PRE_0            DSP2_MISC_RG_DISP_Y2R_PRE_0
#define DSP2_MISC_RG_DISP_Y2R_PRE_0_POS        (0U)
#define DSP2_MISC_RG_DISP_Y2R_PRE_0_LEN        (9U)
#define DSP2_MISC_RG_DISP_Y2R_PRE_0_MSK        (((1U << DSP2_MISC_RG_DISP_Y2R_PRE_0_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_PRE_0_POS)
#define DSP2_MISC_RG_DISP_Y2R_PRE_0_UMSK       (~(((1U << DSP2_MISC_RG_DISP_Y2R_PRE_0_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_PRE_0_POS))
#define DSP2_MISC_RG_DISP_Y2R_PRE_1            DSP2_MISC_RG_DISP_Y2R_PRE_1
#define DSP2_MISC_RG_DISP_Y2R_PRE_1_POS        (10U)
#define DSP2_MISC_RG_DISP_Y2R_PRE_1_LEN        (9U)
#define DSP2_MISC_RG_DISP_Y2R_PRE_1_MSK        (((1U << DSP2_MISC_RG_DISP_Y2R_PRE_1_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_PRE_1_POS)
#define DSP2_MISC_RG_DISP_Y2R_PRE_1_UMSK       (~(((1U << DSP2_MISC_RG_DISP_Y2R_PRE_1_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_PRE_1_POS))
#define DSP2_MISC_RG_DISP_Y2R_PRE_2            DSP2_MISC_RG_DISP_Y2R_PRE_2
#define DSP2_MISC_RG_DISP_Y2R_PRE_2_POS        (20U)
#define DSP2_MISC_RG_DISP_Y2R_PRE_2_LEN        (9U)
#define DSP2_MISC_RG_DISP_Y2R_PRE_2_MSK        (((1U << DSP2_MISC_RG_DISP_Y2R_PRE_2_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_PRE_2_POS)
#define DSP2_MISC_RG_DISP_Y2R_PRE_2_UMSK       (~(((1U << DSP2_MISC_RG_DISP_Y2R_PRE_2_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_PRE_2_POS))
#define DSP2_MISC_RG_DISP_Y2R_EN               DSP2_MISC_RG_DISP_Y2R_EN
#define DSP2_MISC_RG_DISP_Y2R_EN_POS           (31U)
#define DSP2_MISC_RG_DISP_Y2R_EN_LEN           (1U)
#define DSP2_MISC_RG_DISP_Y2R_EN_MSK           (((1U << DSP2_MISC_RG_DISP_Y2R_EN_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_EN_POS)
#define DSP2_MISC_RG_DISP_Y2R_EN_UMSK          (~(((1U << DSP2_MISC_RG_DISP_Y2R_EN_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_EN_POS))

/* 0x6C : disp_yuv_rgb_config_1 */
#define DSP2_MISC_DISP_YUV_RGB_CONFIG_1_OFFSET (0x6C)
#define DSP2_MISC_RG_DISP_Y2R_POS_0            DSP2_MISC_RG_DISP_Y2R_POS_0
#define DSP2_MISC_RG_DISP_Y2R_POS_0_POS        (0U)
#define DSP2_MISC_RG_DISP_Y2R_POS_0_LEN        (9U)
#define DSP2_MISC_RG_DISP_Y2R_POS_0_MSK        (((1U << DSP2_MISC_RG_DISP_Y2R_POS_0_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_POS_0_POS)
#define DSP2_MISC_RG_DISP_Y2R_POS_0_UMSK       (~(((1U << DSP2_MISC_RG_DISP_Y2R_POS_0_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_POS_0_POS))
#define DSP2_MISC_RG_DISP_Y2R_POS_1            DSP2_MISC_RG_DISP_Y2R_POS_1
#define DSP2_MISC_RG_DISP_Y2R_POS_1_POS        (10U)
#define DSP2_MISC_RG_DISP_Y2R_POS_1_LEN        (9U)
#define DSP2_MISC_RG_DISP_Y2R_POS_1_MSK        (((1U << DSP2_MISC_RG_DISP_Y2R_POS_1_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_POS_1_POS)
#define DSP2_MISC_RG_DISP_Y2R_POS_1_UMSK       (~(((1U << DSP2_MISC_RG_DISP_Y2R_POS_1_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_POS_1_POS))
#define DSP2_MISC_RG_DISP_Y2R_POS_2            DSP2_MISC_RG_DISP_Y2R_POS_2
#define DSP2_MISC_RG_DISP_Y2R_POS_2_POS        (20U)
#define DSP2_MISC_RG_DISP_Y2R_POS_2_LEN        (9U)
#define DSP2_MISC_RG_DISP_Y2R_POS_2_MSK        (((1U << DSP2_MISC_RG_DISP_Y2R_POS_2_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_POS_2_POS)
#define DSP2_MISC_RG_DISP_Y2R_POS_2_UMSK       (~(((1U << DSP2_MISC_RG_DISP_Y2R_POS_2_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_POS_2_POS))

/* 0x70 : disp_yuv_rgb_config_2 */
#define DSP2_MISC_DISP_YUV_RGB_CONFIG_2_OFFSET (0x70)
#define DSP2_MISC_RG_DISP_Y2R_MTX_00           DSP2_MISC_RG_DISP_Y2R_MTX_00
#define DSP2_MISC_RG_DISP_Y2R_MTX_00_POS       (0U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_00_LEN       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_00_MSK       (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_00_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_00_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_00_UMSK      (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_00_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_00_POS))
#define DSP2_MISC_RG_DISP_Y2R_MTX_01           DSP2_MISC_RG_DISP_Y2R_MTX_01
#define DSP2_MISC_RG_DISP_Y2R_MTX_01_POS       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_01_LEN       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_01_MSK       (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_01_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_01_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_01_UMSK      (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_01_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_01_POS))
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_L         DSP2_MISC_RG_DISP_Y2R_MTX_02_L
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_L_POS     (24U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_L_LEN     (8U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_L_MSK     (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_02_L_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_02_L_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_L_UMSK    (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_02_L_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_02_L_POS))

