RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x74 : disp_yuv_rgb_config_3 */
#define DSP2_MISC_DISP_YUV_RGB_CONFIG_3_OFFSET (0x74)
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_U         DSP2_MISC_RG_DISP_Y2R_MTX_02_U
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_U_POS     (0U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_U_LEN     (4U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_U_MSK     (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_02_U_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_02_U_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_02_U_UMSK    (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_02_U_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_02_U_POS))
#define DSP2_MISC_RG_DISP_Y2R_MTX_10           DSP2_MISC_RG_DISP_Y2R_MTX_10
#define DSP2_MISC_RG_DISP_Y2R_MTX_10_POS       (4U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_10_LEN       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_10_MSK       (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_10_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_10_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_10_UMSK      (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_10_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_10_POS))
#define DSP2_MISC_RG_DISP_Y2R_MTX_11           DSP2_MISC_RG_DISP_Y2R_MTX_11
#define DSP2_MISC_RG_DISP_Y2R_MTX_11_POS       (16U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_11_LEN       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_11_MSK       (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_11_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_11_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_11_UMSK      (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_11_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_11_POS))
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_L         DSP2_MISC_RG_DISP_Y2R_MTX_12_L
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_L_POS     (28U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_L_LEN     (4U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_L_MSK     (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_12_L_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_12_L_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_L_UMSK    (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_12_L_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_12_L_POS))

/* 0x78 : disp_yuv_rgb_config_4 */
#define DSP2_MISC_DISP_YUV_RGB_CONFIG_4_OFFSET (0x78)
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_U         DSP2_MISC_RG_DISP_Y2R_MTX_12_U
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_U_POS     (0U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_U_LEN     (8U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_U_MSK     (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_12_U_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_12_U_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_12_U_UMSK    (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_12_U_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_12_U_POS))
#define DSP2_MISC_RG_DISP_Y2R_MTX_20           DSP2_MISC_RG_DISP_Y2R_MTX_20
#define DSP2_MISC_RG_DISP_Y2R_MTX_20_POS       (8U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_20_LEN       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_20_MSK       (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_20_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_20_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_20_UMSK      (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_20_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_20_POS))
#define DSP2_MISC_RG_DISP_Y2R_MTX_21           DSP2_MISC_RG_DISP_Y2R_MTX_21
#define DSP2_MISC_RG_DISP_Y2R_MTX_21_POS       (20U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_21_LEN       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_21_MSK       (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_21_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_21_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_21_UMSK      (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_21_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_21_POS))

/* 0x7C : disp_yuv_rgb_config_5 */
#define DSP2_MISC_DISP_YUV_RGB_CONFIG_5_OFFSET (0x7C)
#define DSP2_MISC_RG_DISP_Y2R_MTX_22           DSP2_MISC_RG_DISP_Y2R_MTX_22
#define DSP2_MISC_RG_DISP_Y2R_MTX_22_POS       (0U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_22_LEN       (12U)
#define DSP2_MISC_RG_DISP_Y2R_MTX_22_MSK       (((1U << DSP2_MISC_RG_DISP_Y2R_MTX_22_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_22_POS)
#define DSP2_MISC_RG_DISP_Y2R_MTX_22_UMSK      (~(((1U << DSP2_MISC_RG_DISP_Y2R_MTX_22_LEN) - 1) << DSP2_MISC_RG_DISP_Y2R_MTX_22_POS))

/* 0x80 : dsp2_subsys_bus_ctrl */
#define DSP2_MISC_DSP2_SUBSYS_BUS_CTRL_OFFSET     (0x80)
#define DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON       DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON
#define DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_POS   (0U)
#define DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_LEN   (16U)
#define DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_MSK   (((1U << DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_LEN) - 1) << DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_POS)
#define DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_UMSK  (~(((1U << DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_LEN) - 1) << DSP2_MISC_RG_DSP2_SUB_PCLK_FORCE_ON_POS))
#define DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON      DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON
#define DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_POS  (16U)
#define DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_LEN  (16U)
#define DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_MSK  (((1U << DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_LEN) - 1) << DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_POS)
#define DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_UMSK (~(((1U << DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_LEN) - 1) << DSP2_MISC_RG_DSP2_PERI_PCLK_FORCE_ON_POS))

/* 0xA0 : osdA_i_ctrl */
#define DSP2_MISC_OSDA_I_CTRL_OFFSET (0xA0)
#define DSP2_MISC_RG_OSD_PB_SEL      DSP2_MISC_RG_OSD_PB_SEL
#define DSP2_MISC_RG_OSD_PB_SEL_POS  (0U)
#define DSP2_MISC_RG_OSD_PB_SEL_LEN  (1U)
#define DSP2_MISC_RG_OSD_PB_SEL_MSK  (((1U << DSP2_MISC_RG_OSD_PB_SEL_LEN) - 1) << DSP2_MISC_RG_OSD_PB_SEL_POS)
#define DSP2_MISC_RG_OSD_PB_SEL_UMSK (~(((1U << DSP2_MISC_RG_OSD_PB_SEL_LEN) - 1) << DSP2_MISC_RG_OSD_PB_SEL_POS))
#define DSP2_MISC_RG_OSDA_SEL        DSP2_MISC_RG_OSDA_SEL
#define DSP2_MISC_RG_OSDA_SEL_POS    (29U)
#define DSP2_MISC_RG_OSDA_SEL_LEN    (3U)
#define DSP2_MISC_RG_OSDA_SEL_MSK    (((1U << DSP2_MISC_RG_OSDA_SEL_LEN) - 1) << DSP2_MISC_RG_OSDA_SEL_POS)
#define DSP2_MISC_RG_OSDA_SEL_UMSK   (~(((1U << DSP2_MISC_RG_OSDA_SEL_LEN) - 1) << DSP2_MISC_RG_OSDA_SEL_POS))

/* 0xA4 : osdB_i_ctrl */
#define DSP2_MISC_OSDB_I_CTRL_OFFSET (0xA4)
#define DSP2_MISC_RG_OSDB_SEL        DSP2_MISC_RG_OSDB_SEL
#define DSP2_MISC_RG_OSDB_SEL_POS    (29U)
#define DSP2_MISC_RG_OSDB_SEL_LEN    (3U)
#define DSP2_MISC_RG_OSDB_SEL_MSK    (((1U << DSP2_MISC_RG_OSDB_SEL_LEN) - 1) << DSP2_MISC_RG_OSDB_SEL_POS)
#define DSP2_MISC_RG_OSDB_SEL_UMSK   (~(((1U << DSP2_MISC_RG_OSDB_SEL_LEN) - 1) << DSP2_MISC_RG_OSDB_SEL_POS))

