RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0xA8 : osdC_i_ctrl */
#define DSP2_MISC_OSDC_I_CTRL_OFFSET (0xA8)
#define DSP2_MISC_RG_OSDC_SEL        DSP2_MISC_RG_OSDC_SEL
#define DSP2_MISC_RG_OSDC_SEL_POS    (29U)
#define DSP2_MISC_RG_OSDC_SEL_LEN    (3U)
#define DSP2_MISC_RG_OSDC_SEL_MSK    (((1U << DSP2_MISC_RG_OSDC_SEL_LEN) - 1) << DSP2_MISC_RG_OSDC_SEL_POS)
#define DSP2_MISC_RG_OSDC_SEL_UMSK   (~(((1U << DSP2_MISC_RG_OSDC_SEL_LEN) - 1) << DSP2_MISC_RG_OSDC_SEL_POS))

/* 0xAC : osdD_i_ctrl */
#define DSP2_MISC_OSDD_I_CTRL_OFFSET (0xAC)
#define DSP2_MISC_RG_OSDD_SEL        DSP2_MISC_RG_OSDD_SEL
#define DSP2_MISC_RG_OSDD_SEL_POS    (29U)
#define DSP2_MISC_RG_OSDD_SEL_LEN    (3U)
#define DSP2_MISC_RG_OSDD_SEL_MSK    (((1U << DSP2_MISC_RG_OSDD_SEL_LEN) - 1) << DSP2_MISC_RG_OSDD_SEL_POS)
#define DSP2_MISC_RG_OSDD_SEL_UMSK   (~(((1U << DSP2_MISC_RG_OSDD_SEL_LEN) - 1) << DSP2_MISC_RG_OSDD_SEL_POS))

/* 0xC0 : dsp2_subsys_dbg_sel */
#define DSP2_MISC_DSP2_SUBSYS_DBG_SEL_OFFSET (0xC0)
#define DSP2_MISC_REG_DSP2_SUB_DBG_EN        DSP2_MISC_REG_DSP2_SUB_DBG_EN
#define DSP2_MISC_REG_DSP2_SUB_DBG_EN_POS    (0U)
#define DSP2_MISC_REG_DSP2_SUB_DBG_EN_LEN    (1U)
#define DSP2_MISC_REG_DSP2_SUB_DBG_EN_MSK    (((1U << DSP2_MISC_REG_DSP2_SUB_DBG_EN_LEN) - 1) << DSP2_MISC_REG_DSP2_SUB_DBG_EN_POS)
#define DSP2_MISC_REG_DSP2_SUB_DBG_EN_UMSK   (~(((1U << DSP2_MISC_REG_DSP2_SUB_DBG_EN_LEN) - 1) << DSP2_MISC_REG_DSP2_SUB_DBG_EN_POS))
#define DSP2_MISC_REG_DSP2_SUB_DBG_SEL       DSP2_MISC_REG_DSP2_SUB_DBG_SEL
#define DSP2_MISC_REG_DSP2_SUB_DBG_SEL_POS   (4U)
#define DSP2_MISC_REG_DSP2_SUB_DBG_SEL_LEN   (4U)
#define DSP2_MISC_REG_DSP2_SUB_DBG_SEL_MSK   (((1U << DSP2_MISC_REG_DSP2_SUB_DBG_SEL_LEN) - 1) << DSP2_MISC_REG_DSP2_SUB_DBG_SEL_POS)
#define DSP2_MISC_REG_DSP2_SUB_DBG_SEL_UMSK  (~(((1U << DSP2_MISC_REG_DSP2_SUB_DBG_SEL_LEN) - 1) << DSP2_MISC_REG_DSP2_SUB_DBG_SEL_POS))

/* 0xFC : DSP2_MISC_Dummy */
#define DSP2_MISC_DUMMY_OFFSET   (0xFC)
#define DSP2_MISC_DUMMY_REG      DSP2_MISC_DUMMY_REG
#define DSP2_MISC_DUMMY_REG_POS  (0U)
#define DSP2_MISC_DUMMY_REG_LEN  (32U)
#define DSP2_MISC_DUMMY_REG_MSK  (((1U << DSP2_MISC_DUMMY_REG_LEN) - 1) << DSP2_MISC_DUMMY_REG_POS)
#define DSP2_MISC_DUMMY_REG_UMSK (~(((1U << DSP2_MISC_DUMMY_REG_LEN) - 1) << DSP2_MISC_DUMMY_REG_POS))

/* 0x100 : adjA_ctrl_0 */
#define DSP2_MISC_ADJA_CTRL_0_OFFSET   (0x100)
#define DSP2_MISC_REG_ADJA_ADJ_EB      DSP2_MISC_REG_ADJA_ADJ_EB
#define DSP2_MISC_REG_ADJA_ADJ_EB_POS  (0U)
#define DSP2_MISC_REG_ADJA_ADJ_EB_LEN  (1U)
#define DSP2_MISC_REG_ADJA_ADJ_EB_MSK  (((1U << DSP2_MISC_REG_ADJA_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJA_ADJ_EB_POS)
#define DSP2_MISC_REG_ADJA_ADJ_EB_UMSK (~(((1U << DSP2_MISC_REG_ADJA_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJA_ADJ_EB_POS))
#define DSP2_MISC_REG_ADJA_Y_LUMA      DSP2_MISC_REG_ADJA_Y_LUMA
#define DSP2_MISC_REG_ADJA_Y_LUMA_POS  (1U)
#define DSP2_MISC_REG_ADJA_Y_LUMA_LEN  (9U)
#define DSP2_MISC_REG_ADJA_Y_LUMA_MSK  (((1U << DSP2_MISC_REG_ADJA_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_LUMA_POS)
#define DSP2_MISC_REG_ADJA_Y_LUMA_UMSK (~(((1U << DSP2_MISC_REG_ADJA_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_LUMA_POS))
#define DSP2_MISC_REG_ADJA_Y_MUL0      DSP2_MISC_REG_ADJA_Y_MUL0
#define DSP2_MISC_REG_ADJA_Y_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJA_Y_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJA_Y_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJA_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MUL0_POS)
#define DSP2_MISC_REG_ADJA_Y_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJA_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MUL0_POS))
#define DSP2_MISC_REG_ADJA_Y_MUL1      DSP2_MISC_REG_ADJA_Y_MUL1
#define DSP2_MISC_REG_ADJA_Y_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJA_Y_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJA_Y_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJA_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MUL1_POS)
#define DSP2_MISC_REG_ADJA_Y_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJA_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MUL1_POS))

/* 0x104 : adjA_ctrl_1 */
#define DSP2_MISC_ADJA_CTRL_1_OFFSET   (0x104)
#define DSP2_MISC_REG_ADJA_Y_MIN       DSP2_MISC_REG_ADJA_Y_MIN
#define DSP2_MISC_REG_ADJA_Y_MIN_POS   (0U)
#define DSP2_MISC_REG_ADJA_Y_MIN_LEN   (8U)
#define DSP2_MISC_REG_ADJA_Y_MIN_MSK   (((1U << DSP2_MISC_REG_ADJA_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MIN_POS)
#define DSP2_MISC_REG_ADJA_Y_MIN_UMSK  (~(((1U << DSP2_MISC_REG_ADJA_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MIN_POS))
#define DSP2_MISC_REG_ADJA_Y_MAX       DSP2_MISC_REG_ADJA_Y_MAX
#define DSP2_MISC_REG_ADJA_Y_MAX_POS   (8U)
#define DSP2_MISC_REG_ADJA_Y_MAX_LEN   (8U)
#define DSP2_MISC_REG_ADJA_Y_MAX_MSK   (((1U << DSP2_MISC_REG_ADJA_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MAX_POS)
#define DSP2_MISC_REG_ADJA_Y_MAX_UMSK  (~(((1U << DSP2_MISC_REG_ADJA_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJA_Y_MAX_POS))
#define DSP2_MISC_REG_ADJA_UV_MIN      DSP2_MISC_REG_ADJA_UV_MIN
#define DSP2_MISC_REG_ADJA_UV_MIN_POS  (16U)
#define DSP2_MISC_REG_ADJA_UV_MIN_LEN  (8U)
#define DSP2_MISC_REG_ADJA_UV_MIN_MSK  (((1U << DSP2_MISC_REG_ADJA_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MIN_POS)
#define DSP2_MISC_REG_ADJA_UV_MIN_UMSK (~(((1U << DSP2_MISC_REG_ADJA_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MIN_POS))
#define DSP2_MISC_REG_ADJA_UV_MAX      DSP2_MISC_REG_ADJA_UV_MAX
#define DSP2_MISC_REG_ADJA_UV_MAX_POS  (24U)
#define DSP2_MISC_REG_ADJA_UV_MAX_LEN  (8U)
#define DSP2_MISC_REG_ADJA_UV_MAX_MSK  (((1U << DSP2_MISC_REG_ADJA_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MAX_POS)
#define DSP2_MISC_REG_ADJA_UV_MAX_UMSK (~(((1U << DSP2_MISC_REG_ADJA_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MAX_POS))

/* 0x108 : adjA_ctrl_2 */
#define DSP2_MISC_ADJA_CTRL_2_OFFSET    (0x108)
#define DSP2_MISC_RG_ADJA_SEL           DSP2_MISC_RG_ADJA_SEL
#define DSP2_MISC_RG_ADJA_SEL_POS       (0U)
#define DSP2_MISC_RG_ADJA_SEL_LEN       (4U)
#define DSP2_MISC_RG_ADJA_SEL_MSK       (((1U << DSP2_MISC_RG_ADJA_SEL_LEN) - 1) << DSP2_MISC_RG_ADJA_SEL_POS)
#define DSP2_MISC_RG_ADJA_SEL_UMSK      (~(((1U << DSP2_MISC_RG_ADJA_SEL_LEN) - 1) << DSP2_MISC_RG_ADJA_SEL_POS))
#define DSP2_MISC_REG_ADJA_UV_MUL0      DSP2_MISC_REG_ADJA_UV_MUL0
#define DSP2_MISC_REG_ADJA_UV_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJA_UV_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJA_UV_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJA_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MUL0_POS)
#define DSP2_MISC_REG_ADJA_UV_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJA_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MUL0_POS))
#define DSP2_MISC_REG_ADJA_UV_MUL1      DSP2_MISC_REG_ADJA_UV_MUL1
#define DSP2_MISC_REG_ADJA_UV_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJA_UV_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJA_UV_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJA_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MUL1_POS)
#define DSP2_MISC_REG_ADJA_UV_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJA_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJA_UV_MUL1_POS))

