RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x110 : adjB_ctrl_0 */
#define DSP2_MISC_ADJB_CTRL_0_OFFSET   (0x110)
#define DSP2_MISC_REG_ADJB_ADJ_EB      DSP2_MISC_REG_ADJB_ADJ_EB
#define DSP2_MISC_REG_ADJB_ADJ_EB_POS  (0U)
#define DSP2_MISC_REG_ADJB_ADJ_EB_LEN  (1U)
#define DSP2_MISC_REG_ADJB_ADJ_EB_MSK  (((1U << DSP2_MISC_REG_ADJB_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJB_ADJ_EB_POS)
#define DSP2_MISC_REG_ADJB_ADJ_EB_UMSK (~(((1U << DSP2_MISC_REG_ADJB_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJB_ADJ_EB_POS))
#define DSP2_MISC_REG_ADJB_Y_LUMA      DSP2_MISC_REG_ADJB_Y_LUMA
#define DSP2_MISC_REG_ADJB_Y_LUMA_POS  (1U)
#define DSP2_MISC_REG_ADJB_Y_LUMA_LEN  (9U)
#define DSP2_MISC_REG_ADJB_Y_LUMA_MSK  (((1U << DSP2_MISC_REG_ADJB_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_LUMA_POS)
#define DSP2_MISC_REG_ADJB_Y_LUMA_UMSK (~(((1U << DSP2_MISC_REG_ADJB_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_LUMA_POS))
#define DSP2_MISC_REG_ADJB_Y_MUL0      DSP2_MISC_REG_ADJB_Y_MUL0
#define DSP2_MISC_REG_ADJB_Y_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJB_Y_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJB_Y_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJB_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MUL0_POS)
#define DSP2_MISC_REG_ADJB_Y_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJB_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MUL0_POS))
#define DSP2_MISC_REG_ADJB_Y_MUL1      DSP2_MISC_REG_ADJB_Y_MUL1
#define DSP2_MISC_REG_ADJB_Y_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJB_Y_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJB_Y_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJB_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MUL1_POS)
#define DSP2_MISC_REG_ADJB_Y_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJB_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MUL1_POS))

/* 0x114 : adjB_ctrl_1 */
#define DSP2_MISC_ADJB_CTRL_1_OFFSET   (0x114)
#define DSP2_MISC_REG_ADJB_Y_MIN       DSP2_MISC_REG_ADJB_Y_MIN
#define DSP2_MISC_REG_ADJB_Y_MIN_POS   (0U)
#define DSP2_MISC_REG_ADJB_Y_MIN_LEN   (8U)
#define DSP2_MISC_REG_ADJB_Y_MIN_MSK   (((1U << DSP2_MISC_REG_ADJB_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MIN_POS)
#define DSP2_MISC_REG_ADJB_Y_MIN_UMSK  (~(((1U << DSP2_MISC_REG_ADJB_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MIN_POS))
#define DSP2_MISC_REG_ADJB_Y_MAX       DSP2_MISC_REG_ADJB_Y_MAX
#define DSP2_MISC_REG_ADJB_Y_MAX_POS   (8U)
#define DSP2_MISC_REG_ADJB_Y_MAX_LEN   (8U)
#define DSP2_MISC_REG_ADJB_Y_MAX_MSK   (((1U << DSP2_MISC_REG_ADJB_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MAX_POS)
#define DSP2_MISC_REG_ADJB_Y_MAX_UMSK  (~(((1U << DSP2_MISC_REG_ADJB_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJB_Y_MAX_POS))
#define DSP2_MISC_REG_ADJB_UV_MIN      DSP2_MISC_REG_ADJB_UV_MIN
#define DSP2_MISC_REG_ADJB_UV_MIN_POS  (16U)
#define DSP2_MISC_REG_ADJB_UV_MIN_LEN  (8U)
#define DSP2_MISC_REG_ADJB_UV_MIN_MSK  (((1U << DSP2_MISC_REG_ADJB_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MIN_POS)
#define DSP2_MISC_REG_ADJB_UV_MIN_UMSK (~(((1U << DSP2_MISC_REG_ADJB_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MIN_POS))
#define DSP2_MISC_REG_ADJB_UV_MAX      DSP2_MISC_REG_ADJB_UV_MAX
#define DSP2_MISC_REG_ADJB_UV_MAX_POS  (24U)
#define DSP2_MISC_REG_ADJB_UV_MAX_LEN  (8U)
#define DSP2_MISC_REG_ADJB_UV_MAX_MSK  (((1U << DSP2_MISC_REG_ADJB_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MAX_POS)
#define DSP2_MISC_REG_ADJB_UV_MAX_UMSK (~(((1U << DSP2_MISC_REG_ADJB_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MAX_POS))

/* 0x118 : adjB_ctrl_2 */
#define DSP2_MISC_ADJB_CTRL_2_OFFSET    (0x118)
#define DSP2_MISC_RG_ADJB_SEL           DSP2_MISC_RG_ADJB_SEL
#define DSP2_MISC_RG_ADJB_SEL_POS       (0U)
#define DSP2_MISC_RG_ADJB_SEL_LEN       (4U)
#define DSP2_MISC_RG_ADJB_SEL_MSK       (((1U << DSP2_MISC_RG_ADJB_SEL_LEN) - 1) << DSP2_MISC_RG_ADJB_SEL_POS)
#define DSP2_MISC_RG_ADJB_SEL_UMSK      (~(((1U << DSP2_MISC_RG_ADJB_SEL_LEN) - 1) << DSP2_MISC_RG_ADJB_SEL_POS))
#define DSP2_MISC_REG_ADJB_UV_MUL0      DSP2_MISC_REG_ADJB_UV_MUL0
#define DSP2_MISC_REG_ADJB_UV_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJB_UV_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJB_UV_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJB_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MUL0_POS)
#define DSP2_MISC_REG_ADJB_UV_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJB_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MUL0_POS))
#define DSP2_MISC_REG_ADJB_UV_MUL1      DSP2_MISC_REG_ADJB_UV_MUL1
#define DSP2_MISC_REG_ADJB_UV_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJB_UV_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJB_UV_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJB_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MUL1_POS)
#define DSP2_MISC_REG_ADJB_UV_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJB_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJB_UV_MUL1_POS))

/* 0x120 : adjC_ctrl_0 */
#define DSP2_MISC_ADJC_CTRL_0_OFFSET   (0x120)
#define DSP2_MISC_REG_ADJC_ADJ_EB      DSP2_MISC_REG_ADJC_ADJ_EB
#define DSP2_MISC_REG_ADJC_ADJ_EB_POS  (0U)
#define DSP2_MISC_REG_ADJC_ADJ_EB_LEN  (1U)
#define DSP2_MISC_REG_ADJC_ADJ_EB_MSK  (((1U << DSP2_MISC_REG_ADJC_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJC_ADJ_EB_POS)
#define DSP2_MISC_REG_ADJC_ADJ_EB_UMSK (~(((1U << DSP2_MISC_REG_ADJC_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJC_ADJ_EB_POS))
#define DSP2_MISC_REG_ADJC_Y_LUMA      DSP2_MISC_REG_ADJC_Y_LUMA
#define DSP2_MISC_REG_ADJC_Y_LUMA_POS  (1U)
#define DSP2_MISC_REG_ADJC_Y_LUMA_LEN  (9U)
#define DSP2_MISC_REG_ADJC_Y_LUMA_MSK  (((1U << DSP2_MISC_REG_ADJC_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_LUMA_POS)
#define DSP2_MISC_REG_ADJC_Y_LUMA_UMSK (~(((1U << DSP2_MISC_REG_ADJC_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_LUMA_POS))
#define DSP2_MISC_REG_ADJC_Y_MUL0      DSP2_MISC_REG_ADJC_Y_MUL0
#define DSP2_MISC_REG_ADJC_Y_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJC_Y_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJC_Y_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJC_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MUL0_POS)
#define DSP2_MISC_REG_ADJC_Y_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJC_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MUL0_POS))
#define DSP2_MISC_REG_ADJC_Y_MUL1      DSP2_MISC_REG_ADJC_Y_MUL1
#define DSP2_MISC_REG_ADJC_Y_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJC_Y_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJC_Y_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJC_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MUL1_POS)
#define DSP2_MISC_REG_ADJC_Y_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJC_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MUL1_POS))

/* 0x124 : adjC_ctrl_1 */
#define DSP2_MISC_ADJC_CTRL_1_OFFSET   (0x124)
#define DSP2_MISC_REG_ADJC_Y_MIN       DSP2_MISC_REG_ADJC_Y_MIN
#define DSP2_MISC_REG_ADJC_Y_MIN_POS   (0U)
#define DSP2_MISC_REG_ADJC_Y_MIN_LEN   (8U)
#define DSP2_MISC_REG_ADJC_Y_MIN_MSK   (((1U << DSP2_MISC_REG_ADJC_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MIN_POS)
#define DSP2_MISC_REG_ADJC_Y_MIN_UMSK  (~(((1U << DSP2_MISC_REG_ADJC_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MIN_POS))
#define DSP2_MISC_REG_ADJC_Y_MAX       DSP2_MISC_REG_ADJC_Y_MAX
#define DSP2_MISC_REG_ADJC_Y_MAX_POS   (8U)
#define DSP2_MISC_REG_ADJC_Y_MAX_LEN   (8U)
#define DSP2_MISC_REG_ADJC_Y_MAX_MSK   (((1U << DSP2_MISC_REG_ADJC_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MAX_POS)
#define DSP2_MISC_REG_ADJC_Y_MAX_UMSK  (~(((1U << DSP2_MISC_REG_ADJC_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJC_Y_MAX_POS))
#define DSP2_MISC_REG_ADJC_UV_MIN      DSP2_MISC_REG_ADJC_UV_MIN
#define DSP2_MISC_REG_ADJC_UV_MIN_POS  (16U)
#define DSP2_MISC_REG_ADJC_UV_MIN_LEN  (8U)
#define DSP2_MISC_REG_ADJC_UV_MIN_MSK  (((1U << DSP2_MISC_REG_ADJC_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MIN_POS)
#define DSP2_MISC_REG_ADJC_UV_MIN_UMSK (~(((1U << DSP2_MISC_REG_ADJC_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MIN_POS))
#define DSP2_MISC_REG_ADJC_UV_MAX      DSP2_MISC_REG_ADJC_UV_MAX
#define DSP2_MISC_REG_ADJC_UV_MAX_POS  (24U)
#define DSP2_MISC_REG_ADJC_UV_MAX_LEN  (8U)
#define DSP2_MISC_REG_ADJC_UV_MAX_MSK  (((1U << DSP2_MISC_REG_ADJC_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MAX_POS)
#define DSP2_MISC_REG_ADJC_UV_MAX_UMSK (~(((1U << DSP2_MISC_REG_ADJC_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MAX_POS))

/* 0x128 : adjC_ctrl_2 */
#define DSP2_MISC_ADJC_CTRL_2_OFFSET    (0x128)
#define DSP2_MISC_RG_ADJC_SEL           DSP2_MISC_RG_ADJC_SEL
#define DSP2_MISC_RG_ADJC_SEL_POS       (0U)
#define DSP2_MISC_RG_ADJC_SEL_LEN       (4U)
#define DSP2_MISC_RG_ADJC_SEL_MSK       (((1U << DSP2_MISC_RG_ADJC_SEL_LEN) - 1) << DSP2_MISC_RG_ADJC_SEL_POS)
#define DSP2_MISC_RG_ADJC_SEL_UMSK      (~(((1U << DSP2_MISC_RG_ADJC_SEL_LEN) - 1) << DSP2_MISC_RG_ADJC_SEL_POS))
#define DSP2_MISC_REG_ADJC_UV_MUL0      DSP2_MISC_REG_ADJC_UV_MUL0
#define DSP2_MISC_REG_ADJC_UV_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJC_UV_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJC_UV_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJC_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MUL0_POS)
#define DSP2_MISC_REG_ADJC_UV_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJC_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MUL0_POS))
#define DSP2_MISC_REG_ADJC_UV_MUL1      DSP2_MISC_REG_ADJC_UV_MUL1
#define DSP2_MISC_REG_ADJC_UV_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJC_UV_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJC_UV_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJC_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MUL1_POS)
#define DSP2_MISC_REG_ADJC_UV_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJC_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJC_UV_MUL1_POS))

/* 0x130 : adjD_ctrl_0 */
#define DSP2_MISC_ADJD_CTRL_0_OFFSET   (0x130)
#define DSP2_MISC_REG_ADJD_ADJ_EB      DSP2_MISC_REG_ADJD_ADJ_EB
#define DSP2_MISC_REG_ADJD_ADJ_EB_POS  (0U)
#define DSP2_MISC_REG_ADJD_ADJ_EB_LEN  (1U)
#define DSP2_MISC_REG_ADJD_ADJ_EB_MSK  (((1U << DSP2_MISC_REG_ADJD_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJD_ADJ_EB_POS)
#define DSP2_MISC_REG_ADJD_ADJ_EB_UMSK (~(((1U << DSP2_MISC_REG_ADJD_ADJ_EB_LEN) - 1) << DSP2_MISC_REG_ADJD_ADJ_EB_POS))
#define DSP2_MISC_REG_ADJD_Y_LUMA      DSP2_MISC_REG_ADJD_Y_LUMA
#define DSP2_MISC_REG_ADJD_Y_LUMA_POS  (1U)
#define DSP2_MISC_REG_ADJD_Y_LUMA_LEN  (9U)
#define DSP2_MISC_REG_ADJD_Y_LUMA_MSK  (((1U << DSP2_MISC_REG_ADJD_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_LUMA_POS)
#define DSP2_MISC_REG_ADJD_Y_LUMA_UMSK (~(((1U << DSP2_MISC_REG_ADJD_Y_LUMA_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_LUMA_POS))
#define DSP2_MISC_REG_ADJD_Y_MUL0      DSP2_MISC_REG_ADJD_Y_MUL0
#define DSP2_MISC_REG_ADJD_Y_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJD_Y_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJD_Y_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJD_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MUL0_POS)
#define DSP2_MISC_REG_ADJD_Y_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJD_Y_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MUL0_POS))
#define DSP2_MISC_REG_ADJD_Y_MUL1      DSP2_MISC_REG_ADJD_Y_MUL1
#define DSP2_MISC_REG_ADJD_Y_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJD_Y_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJD_Y_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJD_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MUL1_POS)
#define DSP2_MISC_REG_ADJD_Y_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJD_Y_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MUL1_POS))

/* 0x134 : adjD_ctrl_1 */
#define DSP2_MISC_ADJD_CTRL_1_OFFSET   (0x134)
#define DSP2_MISC_REG_ADJD_Y_MIN       DSP2_MISC_REG_ADJD_Y_MIN
#define DSP2_MISC_REG_ADJD_Y_MIN_POS   (0U)
#define DSP2_MISC_REG_ADJD_Y_MIN_LEN   (8U)
#define DSP2_MISC_REG_ADJD_Y_MIN_MSK   (((1U << DSP2_MISC_REG_ADJD_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MIN_POS)
#define DSP2_MISC_REG_ADJD_Y_MIN_UMSK  (~(((1U << DSP2_MISC_REG_ADJD_Y_MIN_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MIN_POS))
#define DSP2_MISC_REG_ADJD_Y_MAX       DSP2_MISC_REG_ADJD_Y_MAX
#define DSP2_MISC_REG_ADJD_Y_MAX_POS   (8U)
#define DSP2_MISC_REG_ADJD_Y_MAX_LEN   (8U)
#define DSP2_MISC_REG_ADJD_Y_MAX_MSK   (((1U << DSP2_MISC_REG_ADJD_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MAX_POS)
#define DSP2_MISC_REG_ADJD_Y_MAX_UMSK  (~(((1U << DSP2_MISC_REG_ADJD_Y_MAX_LEN) - 1) << DSP2_MISC_REG_ADJD_Y_MAX_POS))
#define DSP2_MISC_REG_ADJD_UV_MIN      DSP2_MISC_REG_ADJD_UV_MIN
#define DSP2_MISC_REG_ADJD_UV_MIN_POS  (16U)
#define DSP2_MISC_REG_ADJD_UV_MIN_LEN  (8U)
#define DSP2_MISC_REG_ADJD_UV_MIN_MSK  (((1U << DSP2_MISC_REG_ADJD_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MIN_POS)
#define DSP2_MISC_REG_ADJD_UV_MIN_UMSK (~(((1U << DSP2_MISC_REG_ADJD_UV_MIN_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MIN_POS))
#define DSP2_MISC_REG_ADJD_UV_MAX      DSP2_MISC_REG_ADJD_UV_MAX
#define DSP2_MISC_REG_ADJD_UV_MAX_POS  (24U)
#define DSP2_MISC_REG_ADJD_UV_MAX_LEN  (8U)
#define DSP2_MISC_REG_ADJD_UV_MAX_MSK  (((1U << DSP2_MISC_REG_ADJD_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MAX_POS)
#define DSP2_MISC_REG_ADJD_UV_MAX_UMSK (~(((1U << DSP2_MISC_REG_ADJD_UV_MAX_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MAX_POS))

/* 0x138 : adjD_ctrl_2 */
#define DSP2_MISC_ADJD_CTRL_2_OFFSET    (0x138)
#define DSP2_MISC_RG_ADJD_SEL           DSP2_MISC_RG_ADJD_SEL
#define DSP2_MISC_RG_ADJD_SEL_POS       (0U)
#define DSP2_MISC_RG_ADJD_SEL_LEN       (4U)
#define DSP2_MISC_RG_ADJD_SEL_MSK       (((1U << DSP2_MISC_RG_ADJD_SEL_LEN) - 1) << DSP2_MISC_RG_ADJD_SEL_POS)
#define DSP2_MISC_RG_ADJD_SEL_UMSK      (~(((1U << DSP2_MISC_RG_ADJD_SEL_LEN) - 1) << DSP2_MISC_RG_ADJD_SEL_POS))
#define DSP2_MISC_REG_ADJD_UV_MUL0      DSP2_MISC_REG_ADJD_UV_MUL0
#define DSP2_MISC_REG_ADJD_UV_MUL0_POS  (10U)
#define DSP2_MISC_REG_ADJD_UV_MUL0_LEN  (11U)
#define DSP2_MISC_REG_ADJD_UV_MUL0_MSK  (((1U << DSP2_MISC_REG_ADJD_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MUL0_POS)
#define DSP2_MISC_REG_ADJD_UV_MUL0_UMSK (~(((1U << DSP2_MISC_REG_ADJD_UV_MUL0_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MUL0_POS))
#define DSP2_MISC_REG_ADJD_UV_MUL1      DSP2_MISC_REG_ADJD_UV_MUL1
#define DSP2_MISC_REG_ADJD_UV_MUL1_POS  (21U)
#define DSP2_MISC_REG_ADJD_UV_MUL1_LEN  (11U)
#define DSP2_MISC_REG_ADJD_UV_MUL1_MSK  (((1U << DSP2_MISC_REG_ADJD_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MUL1_POS)
#define DSP2_MISC_REG_ADJD_UV_MUL1_UMSK (~(((1U << DSP2_MISC_REG_ADJD_UV_MUL1_LEN) - 1) << DSP2_MISC_REG_ADJD_UV_MUL1_POS))

/* 0x160 : y2rA_config_0 */
#define DSP2_MISC_Y2RA_CONFIG_0_OFFSET (0x160)
#define DSP2_MISC_RG_Y2RA_PRE_0        DSP2_MISC_RG_Y2RA_PRE_0
#define DSP2_MISC_RG_Y2RA_PRE_0_POS    (0U)
#define DSP2_MISC_RG_Y2RA_PRE_0_LEN    (9U)
#define DSP2_MISC_RG_Y2RA_PRE_0_MSK    (((1U << DSP2_MISC_RG_Y2RA_PRE_0_LEN) - 1) << DSP2_MISC_RG_Y2RA_PRE_0_POS)
#define DSP2_MISC_RG_Y2RA_PRE_0_UMSK   (~(((1U << DSP2_MISC_RG_Y2RA_PRE_0_LEN) - 1) << DSP2_MISC_RG_Y2RA_PRE_0_POS))
#define DSP2_MISC_RG_Y2RA_POS_0        DSP2_MISC_RG_Y2RA_POS_0
#define DSP2_MISC_RG_Y2RA_POS_0_POS    (16U)
#define DSP2_MISC_RG_Y2RA_POS_0_LEN    (9U)
#define DSP2_MISC_RG_Y2RA_POS_0_MSK    (((1U << DSP2_MISC_RG_Y2RA_POS_0_LEN) - 1) << DSP2_MISC_RG_Y2RA_POS_0_POS)
#define DSP2_MISC_RG_Y2RA_POS_0_UMSK   (~(((1U << DSP2_MISC_RG_Y2RA_POS_0_LEN) - 1) << DSP2_MISC_RG_Y2RA_POS_0_POS))
#define DSP2_MISC_RG_Y2RA_EN           DSP2_MISC_RG_Y2RA_EN
#define DSP2_MISC_RG_Y2RA_EN_POS       (27U)
#define DSP2_MISC_RG_Y2RA_EN_LEN       (1U)
#define DSP2_MISC_RG_Y2RA_EN_MSK       (((1U << DSP2_MISC_RG_Y2RA_EN_LEN) - 1) << DSP2_MISC_RG_Y2RA_EN_POS)
#define DSP2_MISC_RG_Y2RA_EN_UMSK      (~(((1U << DSP2_MISC_RG_Y2RA_EN_LEN) - 1) << DSP2_MISC_RG_Y2RA_EN_POS))
#define DSP2_MISC_RG_Y2RA_SEL          DSP2_MISC_RG_Y2RA_SEL
#define DSP2_MISC_RG_Y2RA_SEL_POS      (28U)
#define DSP2_MISC_RG_Y2RA_SEL_LEN      (4U)
#define DSP2_MISC_RG_Y2RA_SEL_MSK      (((1U << DSP2_MISC_RG_Y2RA_SEL_LEN) - 1) << DSP2_MISC_RG_Y2RA_SEL_POS)
#define DSP2_MISC_RG_Y2RA_SEL_UMSK     (~(((1U << DSP2_MISC_RG_Y2RA_SEL_LEN) - 1) << DSP2_MISC_RG_Y2RA_SEL_POS))

/* 0x164 : y2rA_config_1 */
#define DSP2_MISC_Y2RA_CONFIG_1_OFFSET (0x164)
#define DSP2_MISC_RG_Y2RA_PRE_1        DSP2_MISC_RG_Y2RA_PRE_1
#define DSP2_MISC_RG_Y2RA_PRE_1_POS    (0U)
#define DSP2_MISC_RG_Y2RA_PRE_1_LEN    (9U)
#define DSP2_MISC_RG_Y2RA_PRE_1_MSK    (((1U << DSP2_MISC_RG_Y2RA_PRE_1_LEN) - 1) << DSP2_MISC_RG_Y2RA_PRE_1_POS)
#define DSP2_MISC_RG_Y2RA_PRE_1_UMSK   (~(((1U << DSP2_MISC_RG_Y2RA_PRE_1_LEN) - 1) << DSP2_MISC_RG_Y2RA_PRE_1_POS))
#define DSP2_MISC_RG_Y2RA_POS_1        DSP2_MISC_RG_Y2RA_POS_1
#define DSP2_MISC_RG_Y2RA_POS_1_POS    (16U)
#define DSP2_MISC_RG_Y2RA_POS_1_LEN    (9U)
#define DSP2_MISC_RG_Y2RA_POS_1_MSK    (((1U << DSP2_MISC_RG_Y2RA_POS_1_LEN) - 1) << DSP2_MISC_RG_Y2RA_POS_1_POS)
#define DSP2_MISC_RG_Y2RA_POS_1_UMSK   (~(((1U << DSP2_MISC_RG_Y2RA_POS_1_LEN) - 1) << DSP2_MISC_RG_Y2RA_POS_1_POS))

