RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x168 : y2rA_config_2 */
#define DSP2_MISC_Y2RA_CONFIG_2_OFFSET (0x168)
#define DSP2_MISC_RG_Y2RA_PRE_2        DSP2_MISC_RG_Y2RA_PRE_2
#define DSP2_MISC_RG_Y2RA_PRE_2_POS    (0U)
#define DSP2_MISC_RG_Y2RA_PRE_2_LEN    (9U)
#define DSP2_MISC_RG_Y2RA_PRE_2_MSK    (((1U << DSP2_MISC_RG_Y2RA_PRE_2_LEN) - 1) << DSP2_MISC_RG_Y2RA_PRE_2_POS)
#define DSP2_MISC_RG_Y2RA_PRE_2_UMSK   (~(((1U << DSP2_MISC_RG_Y2RA_PRE_2_LEN) - 1) << DSP2_MISC_RG_Y2RA_PRE_2_POS))
#define DSP2_MISC_RG_Y2RA_POS_2        DSP2_MISC_RG_Y2RA_POS_2
#define DSP2_MISC_RG_Y2RA_POS_2_POS    (16U)
#define DSP2_MISC_RG_Y2RA_POS_2_LEN    (9U)
#define DSP2_MISC_RG_Y2RA_POS_2_MSK    (((1U << DSP2_MISC_RG_Y2RA_POS_2_LEN) - 1) << DSP2_MISC_RG_Y2RA_POS_2_POS)
#define DSP2_MISC_RG_Y2RA_POS_2_UMSK   (~(((1U << DSP2_MISC_RG_Y2RA_POS_2_LEN) - 1) << DSP2_MISC_RG_Y2RA_POS_2_POS))

/* 0x16C : y2rA_config_3 */
#define DSP2_MISC_Y2RA_CONFIG_3_OFFSET (0x16C)
#define DSP2_MISC_RG_Y2RA_MTX_00       DSP2_MISC_RG_Y2RA_MTX_00
#define DSP2_MISC_RG_Y2RA_MTX_00_POS   (0U)
#define DSP2_MISC_RG_Y2RA_MTX_00_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_00_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_00_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_00_POS)
#define DSP2_MISC_RG_Y2RA_MTX_00_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_00_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_00_POS))
#define DSP2_MISC_RG_Y2RA_MTX_01       DSP2_MISC_RG_Y2RA_MTX_01
#define DSP2_MISC_RG_Y2RA_MTX_01_POS   (16U)
#define DSP2_MISC_RG_Y2RA_MTX_01_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_01_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_01_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_01_POS)
#define DSP2_MISC_RG_Y2RA_MTX_01_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_01_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_01_POS))

/* 0x170 : y2rA_config_4 */
#define DSP2_MISC_Y2RA_CONFIG_4_OFFSET (0x170)
#define DSP2_MISC_RG_Y2RA_MTX_02       DSP2_MISC_RG_Y2RA_MTX_02
#define DSP2_MISC_RG_Y2RA_MTX_02_POS   (0U)
#define DSP2_MISC_RG_Y2RA_MTX_02_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_02_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_02_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_02_POS)
#define DSP2_MISC_RG_Y2RA_MTX_02_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_02_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_02_POS))
#define DSP2_MISC_RG_Y2RA_MTX_10       DSP2_MISC_RG_Y2RA_MTX_10
#define DSP2_MISC_RG_Y2RA_MTX_10_POS   (16U)
#define DSP2_MISC_RG_Y2RA_MTX_10_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_10_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_10_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_10_POS)
#define DSP2_MISC_RG_Y2RA_MTX_10_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_10_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_10_POS))

/* 0x174 : y2rA_config_5 */
#define DSP2_MISC_Y2RA_CONFIG_5_OFFSET (0x174)
#define DSP2_MISC_RG_Y2RA_MTX_11       DSP2_MISC_RG_Y2RA_MTX_11
#define DSP2_MISC_RG_Y2RA_MTX_11_POS   (0U)
#define DSP2_MISC_RG_Y2RA_MTX_11_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_11_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_11_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_11_POS)
#define DSP2_MISC_RG_Y2RA_MTX_11_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_11_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_11_POS))
#define DSP2_MISC_RG_Y2RA_MTX_12       DSP2_MISC_RG_Y2RA_MTX_12
#define DSP2_MISC_RG_Y2RA_MTX_12_POS   (16U)
#define DSP2_MISC_RG_Y2RA_MTX_12_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_12_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_12_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_12_POS)
#define DSP2_MISC_RG_Y2RA_MTX_12_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_12_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_12_POS))

/* 0x178 : y2rA_config_6 */
#define DSP2_MISC_Y2RA_CONFIG_6_OFFSET (0x178)
#define DSP2_MISC_RG_Y2RA_MTX_20       DSP2_MISC_RG_Y2RA_MTX_20
#define DSP2_MISC_RG_Y2RA_MTX_20_POS   (0U)
#define DSP2_MISC_RG_Y2RA_MTX_20_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_20_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_20_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_20_POS)
#define DSP2_MISC_RG_Y2RA_MTX_20_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_20_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_20_POS))
#define DSP2_MISC_RG_Y2RA_MTX_21       DSP2_MISC_RG_Y2RA_MTX_21
#define DSP2_MISC_RG_Y2RA_MTX_21_POS   (16U)
#define DSP2_MISC_RG_Y2RA_MTX_21_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_21_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_21_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_21_POS)
#define DSP2_MISC_RG_Y2RA_MTX_21_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_21_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_21_POS))

/* 0x17C : y2rA_config_7 */
#define DSP2_MISC_Y2RA_CONFIG_7_OFFSET (0x17C)
#define DSP2_MISC_RG_Y2RA_MTX_22       DSP2_MISC_RG_Y2RA_MTX_22
#define DSP2_MISC_RG_Y2RA_MTX_22_POS   (0U)
#define DSP2_MISC_RG_Y2RA_MTX_22_LEN   (12U)
#define DSP2_MISC_RG_Y2RA_MTX_22_MSK   (((1U << DSP2_MISC_RG_Y2RA_MTX_22_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_22_POS)
#define DSP2_MISC_RG_Y2RA_MTX_22_UMSK  (~(((1U << DSP2_MISC_RG_Y2RA_MTX_22_LEN) - 1) << DSP2_MISC_RG_Y2RA_MTX_22_POS))

/* 0x180 : disp_rgb2yuv_config_0 */
#define DSP2_MISC_DISP_RGB2YUV_CONFIG_0_OFFSET (0x180)
#define DSP2_MISC_RG_DISP_R2Y_PRE_0            DSP2_MISC_RG_DISP_R2Y_PRE_0
#define DSP2_MISC_RG_DISP_R2Y_PRE_0_POS        (0U)
#define DSP2_MISC_RG_DISP_R2Y_PRE_0_LEN        (9U)
#define DSP2_MISC_RG_DISP_R2Y_PRE_0_MSK        (((1U << DSP2_MISC_RG_DISP_R2Y_PRE_0_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_PRE_0_POS)
#define DSP2_MISC_RG_DISP_R2Y_PRE_0_UMSK       (~(((1U << DSP2_MISC_RG_DISP_R2Y_PRE_0_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_PRE_0_POS))
#define DSP2_MISC_RG_DISP_R2Y_PRE_1            DSP2_MISC_RG_DISP_R2Y_PRE_1
#define DSP2_MISC_RG_DISP_R2Y_PRE_1_POS        (10U)
#define DSP2_MISC_RG_DISP_R2Y_PRE_1_LEN        (9U)
#define DSP2_MISC_RG_DISP_R2Y_PRE_1_MSK        (((1U << DSP2_MISC_RG_DISP_R2Y_PRE_1_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_PRE_1_POS)
#define DSP2_MISC_RG_DISP_R2Y_PRE_1_UMSK       (~(((1U << DSP2_MISC_RG_DISP_R2Y_PRE_1_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_PRE_1_POS))
#define DSP2_MISC_RG_DISP_R2Y_PRE_2            DSP2_MISC_RG_DISP_R2Y_PRE_2
#define DSP2_MISC_RG_DISP_R2Y_PRE_2_POS        (20U)
#define DSP2_MISC_RG_DISP_R2Y_PRE_2_LEN        (9U)
#define DSP2_MISC_RG_DISP_R2Y_PRE_2_MSK        (((1U << DSP2_MISC_RG_DISP_R2Y_PRE_2_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_PRE_2_POS)
#define DSP2_MISC_RG_DISP_R2Y_PRE_2_UMSK       (~(((1U << DSP2_MISC_RG_DISP_R2Y_PRE_2_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_PRE_2_POS))
#define DSP2_MISC_RG_DISP_R2Y_EN               DSP2_MISC_RG_DISP_R2Y_EN
#define DSP2_MISC_RG_DISP_R2Y_EN_POS           (31U)
#define DSP2_MISC_RG_DISP_R2Y_EN_LEN           (1U)
#define DSP2_MISC_RG_DISP_R2Y_EN_MSK           (((1U << DSP2_MISC_RG_DISP_R2Y_EN_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_EN_POS)
#define DSP2_MISC_RG_DISP_R2Y_EN_UMSK          (~(((1U << DSP2_MISC_RG_DISP_R2Y_EN_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_EN_POS))

/* 0x184 : disp_rgb2yuv_config_1 */
#define DSP2_MISC_DISP_RGB2YUV_CONFIG_1_OFFSET (0x184)
#define DSP2_MISC_RG_DISP_R2Y_POS_0            DSP2_MISC_RG_DISP_R2Y_POS_0
#define DSP2_MISC_RG_DISP_R2Y_POS_0_POS        (0U)
#define DSP2_MISC_RG_DISP_R2Y_POS_0_LEN        (9U)
#define DSP2_MISC_RG_DISP_R2Y_POS_0_MSK        (((1U << DSP2_MISC_RG_DISP_R2Y_POS_0_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_POS_0_POS)
#define DSP2_MISC_RG_DISP_R2Y_POS_0_UMSK       (~(((1U << DSP2_MISC_RG_DISP_R2Y_POS_0_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_POS_0_POS))
#define DSP2_MISC_RG_DISP_R2Y_POS_1            DSP2_MISC_RG_DISP_R2Y_POS_1
#define DSP2_MISC_RG_DISP_R2Y_POS_1_POS        (10U)
#define DSP2_MISC_RG_DISP_R2Y_POS_1_LEN        (9U)
#define DSP2_MISC_RG_DISP_R2Y_POS_1_MSK        (((1U << DSP2_MISC_RG_DISP_R2Y_POS_1_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_POS_1_POS)
#define DSP2_MISC_RG_DISP_R2Y_POS_1_UMSK       (~(((1U << DSP2_MISC_RG_DISP_R2Y_POS_1_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_POS_1_POS))
#define DSP2_MISC_RG_DISP_R2Y_POS_2            DSP2_MISC_RG_DISP_R2Y_POS_2
#define DSP2_MISC_RG_DISP_R2Y_POS_2_POS        (20U)
#define DSP2_MISC_RG_DISP_R2Y_POS_2_LEN        (9U)
#define DSP2_MISC_RG_DISP_R2Y_POS_2_MSK        (((1U << DSP2_MISC_RG_DISP_R2Y_POS_2_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_POS_2_POS)
#define DSP2_MISC_RG_DISP_R2Y_POS_2_UMSK       (~(((1U << DSP2_MISC_RG_DISP_R2Y_POS_2_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_POS_2_POS))

/* 0x188 : disp_rgb2yuv_config_2 */
#define DSP2_MISC_DISP_RGB2YUV_CONFIG_2_OFFSET (0x188)
#define DSP2_MISC_RG_DISP_R2Y_MTX_00           DSP2_MISC_RG_DISP_R2Y_MTX_00
#define DSP2_MISC_RG_DISP_R2Y_MTX_00_POS       (0U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_00_LEN       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_00_MSK       (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_00_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_00_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_00_UMSK      (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_00_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_00_POS))
#define DSP2_MISC_RG_DISP_R2Y_MTX_01           DSP2_MISC_RG_DISP_R2Y_MTX_01
#define DSP2_MISC_RG_DISP_R2Y_MTX_01_POS       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_01_LEN       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_01_MSK       (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_01_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_01_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_01_UMSK      (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_01_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_01_POS))
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_L         DSP2_MISC_RG_DISP_R2Y_MTX_02_L
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_L_POS     (24U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_L_LEN     (8U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_L_MSK     (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_02_L_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_02_L_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_L_UMSK    (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_02_L_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_02_L_POS))

/* 0x18C : disp_rgb2yuv_config_3 */
#define DSP2_MISC_DISP_RGB2YUV_CONFIG_3_OFFSET (0x18C)
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_U         DSP2_MISC_RG_DISP_R2Y_MTX_02_U
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_U_POS     (0U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_U_LEN     (4U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_U_MSK     (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_02_U_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_02_U_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_02_U_UMSK    (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_02_U_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_02_U_POS))
#define DSP2_MISC_RG_DISP_R2Y_MTX_10           DSP2_MISC_RG_DISP_R2Y_MTX_10
#define DSP2_MISC_RG_DISP_R2Y_MTX_10_POS       (4U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_10_LEN       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_10_MSK       (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_10_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_10_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_10_UMSK      (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_10_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_10_POS))
#define DSP2_MISC_RG_DISP_R2Y_MTX_11           DSP2_MISC_RG_DISP_R2Y_MTX_11
#define DSP2_MISC_RG_DISP_R2Y_MTX_11_POS       (16U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_11_LEN       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_11_MSK       (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_11_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_11_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_11_UMSK      (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_11_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_11_POS))
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_L         DSP2_MISC_RG_DISP_R2Y_MTX_12_L
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_L_POS     (28U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_L_LEN     (4U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_L_MSK     (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_12_L_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_12_L_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_L_UMSK    (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_12_L_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_12_L_POS))

/* 0x190 : disp_rgb2yuv_config_4 */
#define DSP2_MISC_DISP_RGB2YUV_CONFIG_4_OFFSET (0x190)
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_U         DSP2_MISC_RG_DISP_R2Y_MTX_12_U
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_U_POS     (0U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_U_LEN     (8U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_U_MSK     (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_12_U_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_12_U_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_12_U_UMSK    (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_12_U_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_12_U_POS))
#define DSP2_MISC_RG_DISP_R2Y_MTX_20           DSP2_MISC_RG_DISP_R2Y_MTX_20
#define DSP2_MISC_RG_DISP_R2Y_MTX_20_POS       (8U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_20_LEN       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_20_MSK       (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_20_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_20_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_20_UMSK      (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_20_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_20_POS))
#define DSP2_MISC_RG_DISP_R2Y_MTX_21           DSP2_MISC_RG_DISP_R2Y_MTX_21
#define DSP2_MISC_RG_DISP_R2Y_MTX_21_POS       (20U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_21_LEN       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_21_MSK       (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_21_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_21_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_21_UMSK      (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_21_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_21_POS))

