RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x194 : disp_rgb2yuv_config_5 */
#define DSP2_MISC_DISP_RGB2YUV_CONFIG_5_OFFSET (0x194)
#define DSP2_MISC_RG_DISP_R2Y_MTX_22           DSP2_MISC_RG_DISP_R2Y_MTX_22
#define DSP2_MISC_RG_DISP_R2Y_MTX_22_POS       (0U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_22_LEN       (12U)
#define DSP2_MISC_RG_DISP_R2Y_MTX_22_MSK       (((1U << DSP2_MISC_RG_DISP_R2Y_MTX_22_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_22_POS)
#define DSP2_MISC_RG_DISP_R2Y_MTX_22_UMSK      (~(((1U << DSP2_MISC_RG_DISP_R2Y_MTX_22_LEN) - 1) << DSP2_MISC_RG_DISP_R2Y_MTX_22_POS))

/* 0x1C0 : cropA_hsync */
#define DSP2_MISC_CROPA_HSYNC_OFFSET         (0x1C0)
#define DSP2_MISC_REG_CROPA_HSYNC_START      DSP2_MISC_REG_CROPA_HSYNC_START
#define DSP2_MISC_REG_CROPA_HSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPA_HSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPA_HSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPA_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPA_HSYNC_START_POS)
#define DSP2_MISC_REG_CROPA_HSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPA_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPA_HSYNC_START_POS))
#define DSP2_MISC_REG_CROPA_HSYNC_END        DSP2_MISC_REG_CROPA_HSYNC_END
#define DSP2_MISC_REG_CROPA_HSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPA_HSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPA_HSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPA_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPA_HSYNC_END_POS)
#define DSP2_MISC_REG_CROPA_HSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPA_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPA_HSYNC_END_POS))

/* 0x1C4 : cropA_vsync */
#define DSP2_MISC_CROPA_VSYNC_OFFSET         (0x1C4)
#define DSP2_MISC_REG_CROPA_VSYNC_START      DSP2_MISC_REG_CROPA_VSYNC_START
#define DSP2_MISC_REG_CROPA_VSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPA_VSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPA_VSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPA_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPA_VSYNC_START_POS)
#define DSP2_MISC_REG_CROPA_VSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPA_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPA_VSYNC_START_POS))
#define DSP2_MISC_REG_CROPA_VSYNC_END        DSP2_MISC_REG_CROPA_VSYNC_END
#define DSP2_MISC_REG_CROPA_VSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPA_VSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPA_VSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPA_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPA_VSYNC_END_POS)
#define DSP2_MISC_REG_CROPA_VSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPA_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPA_VSYNC_END_POS))

/* 0x1C8 : cropB_hsync */
#define DSP2_MISC_CROPB_HSYNC_OFFSET         (0x1C8)
#define DSP2_MISC_REG_CROPB_HSYNC_START      DSP2_MISC_REG_CROPB_HSYNC_START
#define DSP2_MISC_REG_CROPB_HSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPB_HSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPB_HSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPB_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPB_HSYNC_START_POS)
#define DSP2_MISC_REG_CROPB_HSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPB_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPB_HSYNC_START_POS))
#define DSP2_MISC_REG_CROPB_HSYNC_END        DSP2_MISC_REG_CROPB_HSYNC_END
#define DSP2_MISC_REG_CROPB_HSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPB_HSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPB_HSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPB_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPB_HSYNC_END_POS)
#define DSP2_MISC_REG_CROPB_HSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPB_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPB_HSYNC_END_POS))

/* 0x1CC : cropB_vsync */
#define DSP2_MISC_CROPB_VSYNC_OFFSET         (0x1CC)
#define DSP2_MISC_REG_CROPB_VSYNC_START      DSP2_MISC_REG_CROPB_VSYNC_START
#define DSP2_MISC_REG_CROPB_VSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPB_VSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPB_VSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPB_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPB_VSYNC_START_POS)
#define DSP2_MISC_REG_CROPB_VSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPB_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPB_VSYNC_START_POS))
#define DSP2_MISC_REG_CROPB_VSYNC_END        DSP2_MISC_REG_CROPB_VSYNC_END
#define DSP2_MISC_REG_CROPB_VSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPB_VSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPB_VSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPB_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPB_VSYNC_END_POS)
#define DSP2_MISC_REG_CROPB_VSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPB_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPB_VSYNC_END_POS))

/* 0x1D0 : cropC_hsync */
#define DSP2_MISC_CROPC_HSYNC_OFFSET         (0x1D0)
#define DSP2_MISC_REG_CROPC_HSYNC_START      DSP2_MISC_REG_CROPC_HSYNC_START
#define DSP2_MISC_REG_CROPC_HSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPC_HSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPC_HSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPC_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPC_HSYNC_START_POS)
#define DSP2_MISC_REG_CROPC_HSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPC_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPC_HSYNC_START_POS))
#define DSP2_MISC_REG_CROPC_HSYNC_END        DSP2_MISC_REG_CROPC_HSYNC_END
#define DSP2_MISC_REG_CROPC_HSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPC_HSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPC_HSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPC_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPC_HSYNC_END_POS)
#define DSP2_MISC_REG_CROPC_HSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPC_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPC_HSYNC_END_POS))

/* 0x1D4 : cropC_vsync */
#define DSP2_MISC_CROPC_VSYNC_OFFSET         (0x1D4)
#define DSP2_MISC_REG_CROPC_VSYNC_START      DSP2_MISC_REG_CROPC_VSYNC_START
#define DSP2_MISC_REG_CROPC_VSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPC_VSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPC_VSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPC_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPC_VSYNC_START_POS)
#define DSP2_MISC_REG_CROPC_VSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPC_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPC_VSYNC_START_POS))
#define DSP2_MISC_REG_CROPC_VSYNC_END        DSP2_MISC_REG_CROPC_VSYNC_END
#define DSP2_MISC_REG_CROPC_VSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPC_VSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPC_VSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPC_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPC_VSYNC_END_POS)
#define DSP2_MISC_REG_CROPC_VSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPC_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPC_VSYNC_END_POS))

