RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x1D8 : cropD_hsync */
#define DSP2_MISC_CROPD_HSYNC_OFFSET         (0x1D8)
#define DSP2_MISC_REG_CROPD_HSYNC_START      DSP2_MISC_REG_CROPD_HSYNC_START
#define DSP2_MISC_REG_CROPD_HSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPD_HSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPD_HSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPD_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPD_HSYNC_START_POS)
#define DSP2_MISC_REG_CROPD_HSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPD_HSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPD_HSYNC_START_POS))
#define DSP2_MISC_REG_CROPD_HSYNC_END        DSP2_MISC_REG_CROPD_HSYNC_END
#define DSP2_MISC_REG_CROPD_HSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPD_HSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPD_HSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPD_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPD_HSYNC_END_POS)
#define DSP2_MISC_REG_CROPD_HSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPD_HSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPD_HSYNC_END_POS))

/* 0x1DC : cropD_vsync */
#define DSP2_MISC_CROPD_VSYNC_OFFSET         (0x1DC)
#define DSP2_MISC_REG_CROPD_VSYNC_START      DSP2_MISC_REG_CROPD_VSYNC_START
#define DSP2_MISC_REG_CROPD_VSYNC_START_POS  (0U)
#define DSP2_MISC_REG_CROPD_VSYNC_START_LEN  (16U)
#define DSP2_MISC_REG_CROPD_VSYNC_START_MSK  (((1U << DSP2_MISC_REG_CROPD_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPD_VSYNC_START_POS)
#define DSP2_MISC_REG_CROPD_VSYNC_START_UMSK (~(((1U << DSP2_MISC_REG_CROPD_VSYNC_START_LEN) - 1) << DSP2_MISC_REG_CROPD_VSYNC_START_POS))
#define DSP2_MISC_REG_CROPD_VSYNC_END        DSP2_MISC_REG_CROPD_VSYNC_END
#define DSP2_MISC_REG_CROPD_VSYNC_END_POS    (16U)
#define DSP2_MISC_REG_CROPD_VSYNC_END_LEN    (16U)
#define DSP2_MISC_REG_CROPD_VSYNC_END_MSK    (((1U << DSP2_MISC_REG_CROPD_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPD_VSYNC_END_POS)
#define DSP2_MISC_REG_CROPD_VSYNC_END_UMSK   (~(((1U << DSP2_MISC_REG_CROPD_VSYNC_END_LEN) - 1) << DSP2_MISC_REG_CROPD_VSYNC_END_POS))

/* 0x1E0 : crop_enable */
#define DSP2_MISC_CROP_ENABLE_OFFSET    (0x1E0)
#define DSP2_MISC_REG_CROPA_ENABLE      DSP2_MISC_REG_CROPA_ENABLE
#define DSP2_MISC_REG_CROPA_ENABLE_POS  (0U)
#define DSP2_MISC_REG_CROPA_ENABLE_LEN  (1U)
#define DSP2_MISC_REG_CROPA_ENABLE_MSK  (((1U << DSP2_MISC_REG_CROPA_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPA_ENABLE_POS)
#define DSP2_MISC_REG_CROPA_ENABLE_UMSK (~(((1U << DSP2_MISC_REG_CROPA_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPA_ENABLE_POS))
#define DSP2_MISC_REG_CROPB_ENABLE      DSP2_MISC_REG_CROPB_ENABLE
#define DSP2_MISC_REG_CROPB_ENABLE_POS  (1U)
#define DSP2_MISC_REG_CROPB_ENABLE_LEN  (1U)
#define DSP2_MISC_REG_CROPB_ENABLE_MSK  (((1U << DSP2_MISC_REG_CROPB_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPB_ENABLE_POS)
#define DSP2_MISC_REG_CROPB_ENABLE_UMSK (~(((1U << DSP2_MISC_REG_CROPB_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPB_ENABLE_POS))
#define DSP2_MISC_REG_CROPC_ENABLE      DSP2_MISC_REG_CROPC_ENABLE
#define DSP2_MISC_REG_CROPC_ENABLE_POS  (2U)
#define DSP2_MISC_REG_CROPC_ENABLE_LEN  (1U)
#define DSP2_MISC_REG_CROPC_ENABLE_MSK  (((1U << DSP2_MISC_REG_CROPC_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPC_ENABLE_POS)
#define DSP2_MISC_REG_CROPC_ENABLE_UMSK (~(((1U << DSP2_MISC_REG_CROPC_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPC_ENABLE_POS))
#define DSP2_MISC_REG_CROPD_ENABLE      DSP2_MISC_REG_CROPD_ENABLE
#define DSP2_MISC_REG_CROPD_ENABLE_POS  (3U)
#define DSP2_MISC_REG_CROPD_ENABLE_LEN  (1U)
#define DSP2_MISC_REG_CROPD_ENABLE_MSK  (((1U << DSP2_MISC_REG_CROPD_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPD_ENABLE_POS)
#define DSP2_MISC_REG_CROPD_ENABLE_UMSK (~(((1U << DSP2_MISC_REG_CROPD_ENABLE_LEN) - 1) << DSP2_MISC_REG_CROPD_ENABLE_POS))

/* 0x1FC : disp_gma_cfg */
#define DSP2_MISC_DISP_GMA_CFG_OFFSET    (0x1FC)
#define DSP2_MISC_REG_DP_GMA_CH0_EN      DSP2_MISC_REG_DP_GMA_CH0_EN
#define DSP2_MISC_REG_DP_GMA_CH0_EN_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CH0_EN_LEN  (1U)
#define DSP2_MISC_REG_DP_GMA_CH0_EN_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CH0_EN_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CH0_EN_POS)
#define DSP2_MISC_REG_DP_GMA_CH0_EN_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CH0_EN_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CH0_EN_POS))
#define DSP2_MISC_REG_DP_GMA_CH1_EN      DSP2_MISC_REG_DP_GMA_CH1_EN
#define DSP2_MISC_REG_DP_GMA_CH1_EN_POS  (1U)
#define DSP2_MISC_REG_DP_GMA_CH1_EN_LEN  (1U)
#define DSP2_MISC_REG_DP_GMA_CH1_EN_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CH1_EN_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CH1_EN_POS)
#define DSP2_MISC_REG_DP_GMA_CH1_EN_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CH1_EN_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CH1_EN_POS))
#define DSP2_MISC_REG_DP_GMA_CH2_EN      DSP2_MISC_REG_DP_GMA_CH2_EN
#define DSP2_MISC_REG_DP_GMA_CH2_EN_POS  (2U)
#define DSP2_MISC_REG_DP_GMA_CH2_EN_LEN  (1U)
#define DSP2_MISC_REG_DP_GMA_CH2_EN_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CH2_EN_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CH2_EN_POS)
#define DSP2_MISC_REG_DP_GMA_CH2_EN_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CH2_EN_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CH2_EN_POS))

/* 0x200 : disp_gma_curve_00 */
#define DSP2_MISC_DISP_GMA_CURVE_00_OFFSET (0x200)
#define DSP2_MISC_REG_DP_GMA_CURVE_00      DSP2_MISC_REG_DP_GMA_CURVE_00
#define DSP2_MISC_REG_DP_GMA_CURVE_00_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_00_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_00_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_00_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_00_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_00_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_00_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_00_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_01      DSP2_MISC_REG_DP_GMA_CURVE_01
#define DSP2_MISC_REG_DP_GMA_CURVE_01_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_01_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_01_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_01_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_01_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_01_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_01_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_01_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_02      DSP2_MISC_REG_DP_GMA_CURVE_02
#define DSP2_MISC_REG_DP_GMA_CURVE_02_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_02_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_02_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_02_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_02_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_02_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_02_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_02_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_03      DSP2_MISC_REG_DP_GMA_CURVE_03
#define DSP2_MISC_REG_DP_GMA_CURVE_03_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_03_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_03_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_03_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_03_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_03_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_03_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_03_POS))

/* 0x204 : disp_gma_curve_04 */
#define DSP2_MISC_DISP_GMA_CURVE_04_OFFSET (0x204)
#define DSP2_MISC_REG_DP_GMA_CURVE_04      DSP2_MISC_REG_DP_GMA_CURVE_04
#define DSP2_MISC_REG_DP_GMA_CURVE_04_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_04_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_04_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_04_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_04_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_04_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_04_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_04_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_05      DSP2_MISC_REG_DP_GMA_CURVE_05
#define DSP2_MISC_REG_DP_GMA_CURVE_05_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_05_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_05_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_05_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_05_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_05_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_05_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_05_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_06      DSP2_MISC_REG_DP_GMA_CURVE_06
#define DSP2_MISC_REG_DP_GMA_CURVE_06_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_06_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_06_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_06_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_06_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_06_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_06_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_06_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_07      DSP2_MISC_REG_DP_GMA_CURVE_07
#define DSP2_MISC_REG_DP_GMA_CURVE_07_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_07_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_07_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_07_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_07_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_07_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_07_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_07_POS))

