RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x208 : disp_gma_curve_08 */
#define DSP2_MISC_DISP_GMA_CURVE_08_OFFSET (0x208)
#define DSP2_MISC_REG_DP_GMA_CURVE_08      DSP2_MISC_REG_DP_GMA_CURVE_08
#define DSP2_MISC_REG_DP_GMA_CURVE_08_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_08_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_08_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_08_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_08_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_08_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_08_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_08_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_09      DSP2_MISC_REG_DP_GMA_CURVE_09
#define DSP2_MISC_REG_DP_GMA_CURVE_09_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_09_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_09_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_09_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_09_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_09_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_09_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_09_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_0A      DSP2_MISC_REG_DP_GMA_CURVE_0A
#define DSP2_MISC_REG_DP_GMA_CURVE_0A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_0A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_0A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_0A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_0B      DSP2_MISC_REG_DP_GMA_CURVE_0B
#define DSP2_MISC_REG_DP_GMA_CURVE_0B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_0B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_0B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_0B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0B_POS))

/* 0x20C : disp_gma_curve_0c */
#define DSP2_MISC_DISP_GMA_CURVE_0C_OFFSET (0x20C)
#define DSP2_MISC_REG_DP_GMA_CURVE_0C      DSP2_MISC_REG_DP_GMA_CURVE_0C
#define DSP2_MISC_REG_DP_GMA_CURVE_0C_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0C_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0C_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_0C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0C_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_0C_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_0C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0C_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_0D      DSP2_MISC_REG_DP_GMA_CURVE_0D
#define DSP2_MISC_REG_DP_GMA_CURVE_0D_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0D_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0D_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_0D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0D_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_0D_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_0D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0D_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_0E      DSP2_MISC_REG_DP_GMA_CURVE_0E
#define DSP2_MISC_REG_DP_GMA_CURVE_0E_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0E_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0E_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_0E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0E_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_0E_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_0E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0E_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_0F      DSP2_MISC_REG_DP_GMA_CURVE_0F
#define DSP2_MISC_REG_DP_GMA_CURVE_0F_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0F_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_0F_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_0F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0F_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_0F_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_0F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_0F_POS))

/* 0x210 : disp_gma_curve_10 */
#define DSP2_MISC_DISP_GMA_CURVE_10_OFFSET (0x210)
#define DSP2_MISC_REG_DP_GMA_CURVE_10      DSP2_MISC_REG_DP_GMA_CURVE_10
#define DSP2_MISC_REG_DP_GMA_CURVE_10_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_10_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_10_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_10_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_10_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_10_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_10_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_10_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_11      DSP2_MISC_REG_DP_GMA_CURVE_11
#define DSP2_MISC_REG_DP_GMA_CURVE_11_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_11_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_11_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_11_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_11_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_11_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_11_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_11_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_12      DSP2_MISC_REG_DP_GMA_CURVE_12
#define DSP2_MISC_REG_DP_GMA_CURVE_12_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_12_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_12_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_12_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_12_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_12_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_12_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_12_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_13      DSP2_MISC_REG_DP_GMA_CURVE_13
#define DSP2_MISC_REG_DP_GMA_CURVE_13_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_13_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_13_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_13_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_13_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_13_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_13_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_13_POS))

/* 0x214 : disp_gma_curve_14 */
#define DSP2_MISC_DISP_GMA_CURVE_14_OFFSET (0x214)
#define DSP2_MISC_REG_DP_GMA_CURVE_14      DSP2_MISC_REG_DP_GMA_CURVE_14
#define DSP2_MISC_REG_DP_GMA_CURVE_14_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_14_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_14_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_14_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_14_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_14_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_14_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_14_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_15      DSP2_MISC_REG_DP_GMA_CURVE_15
#define DSP2_MISC_REG_DP_GMA_CURVE_15_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_15_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_15_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_15_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_15_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_15_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_15_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_15_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_16      DSP2_MISC_REG_DP_GMA_CURVE_16
#define DSP2_MISC_REG_DP_GMA_CURVE_16_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_16_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_16_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_16_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_16_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_16_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_16_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_16_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_17      DSP2_MISC_REG_DP_GMA_CURVE_17
#define DSP2_MISC_REG_DP_GMA_CURVE_17_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_17_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_17_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_17_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_17_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_17_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_17_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_17_POS))

/* 0x218 : disp_gma_curve_18 */
#define DSP2_MISC_DISP_GMA_CURVE_18_OFFSET (0x218)
#define DSP2_MISC_REG_DP_GMA_CURVE_18      DSP2_MISC_REG_DP_GMA_CURVE_18
#define DSP2_MISC_REG_DP_GMA_CURVE_18_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_18_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_18_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_18_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_18_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_18_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_18_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_18_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_19      DSP2_MISC_REG_DP_GMA_CURVE_19
#define DSP2_MISC_REG_DP_GMA_CURVE_19_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_19_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_19_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_19_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_19_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_19_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_19_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_19_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_1A      DSP2_MISC_REG_DP_GMA_CURVE_1A
#define DSP2_MISC_REG_DP_GMA_CURVE_1A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_1A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_1A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_1A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_1B      DSP2_MISC_REG_DP_GMA_CURVE_1B
#define DSP2_MISC_REG_DP_GMA_CURVE_1B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_1B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_1B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_1B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1B_POS))

/* 0x21C : disp_gma_curve_1c */
#define DSP2_MISC_DISP_GMA_CURVE_1C_OFFSET (0x21C)
#define DSP2_MISC_REG_DP_GMA_CURVE_1C      DSP2_MISC_REG_DP_GMA_CURVE_1C
#define DSP2_MISC_REG_DP_GMA_CURVE_1C_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1C_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1C_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_1C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1C_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_1C_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_1C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1C_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_1D      DSP2_MISC_REG_DP_GMA_CURVE_1D
#define DSP2_MISC_REG_DP_GMA_CURVE_1D_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1D_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1D_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_1D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1D_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_1D_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_1D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1D_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_1E      DSP2_MISC_REG_DP_GMA_CURVE_1E
#define DSP2_MISC_REG_DP_GMA_CURVE_1E_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1E_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1E_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_1E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1E_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_1E_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_1E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1E_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_1F      DSP2_MISC_REG_DP_GMA_CURVE_1F
#define DSP2_MISC_REG_DP_GMA_CURVE_1F_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1F_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_1F_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_1F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1F_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_1F_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_1F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_1F_POS))

