RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x220 : disp_gma_curve_20 */
#define DSP2_MISC_DISP_GMA_CURVE_20_OFFSET (0x220)
#define DSP2_MISC_REG_DP_GMA_CURVE_20      DSP2_MISC_REG_DP_GMA_CURVE_20
#define DSP2_MISC_REG_DP_GMA_CURVE_20_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_20_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_20_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_20_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_20_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_20_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_20_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_20_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_21      DSP2_MISC_REG_DP_GMA_CURVE_21
#define DSP2_MISC_REG_DP_GMA_CURVE_21_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_21_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_21_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_21_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_21_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_21_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_21_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_21_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_22      DSP2_MISC_REG_DP_GMA_CURVE_22
#define DSP2_MISC_REG_DP_GMA_CURVE_22_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_22_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_22_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_22_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_22_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_22_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_22_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_22_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_23      DSP2_MISC_REG_DP_GMA_CURVE_23
#define DSP2_MISC_REG_DP_GMA_CURVE_23_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_23_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_23_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_23_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_23_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_23_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_23_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_23_POS))

/* 0x224 : disp_gma_curve_24 */
#define DSP2_MISC_DISP_GMA_CURVE_24_OFFSET (0x224)
#define DSP2_MISC_REG_DP_GMA_CURVE_24      DSP2_MISC_REG_DP_GMA_CURVE_24
#define DSP2_MISC_REG_DP_GMA_CURVE_24_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_24_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_24_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_24_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_24_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_24_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_24_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_24_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_25      DSP2_MISC_REG_DP_GMA_CURVE_25
#define DSP2_MISC_REG_DP_GMA_CURVE_25_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_25_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_25_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_25_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_25_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_25_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_25_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_25_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_26      DSP2_MISC_REG_DP_GMA_CURVE_26
#define DSP2_MISC_REG_DP_GMA_CURVE_26_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_26_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_26_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_26_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_26_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_26_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_26_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_26_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_27      DSP2_MISC_REG_DP_GMA_CURVE_27
#define DSP2_MISC_REG_DP_GMA_CURVE_27_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_27_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_27_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_27_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_27_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_27_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_27_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_27_POS))

/* 0x228 : disp_gma_curve_28 */
#define DSP2_MISC_DISP_GMA_CURVE_28_OFFSET (0x228)
#define DSP2_MISC_REG_DP_GMA_CURVE_28      DSP2_MISC_REG_DP_GMA_CURVE_28
#define DSP2_MISC_REG_DP_GMA_CURVE_28_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_28_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_28_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_28_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_28_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_28_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_28_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_28_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_29      DSP2_MISC_REG_DP_GMA_CURVE_29
#define DSP2_MISC_REG_DP_GMA_CURVE_29_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_29_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_29_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_29_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_29_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_29_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_29_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_29_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_2A      DSP2_MISC_REG_DP_GMA_CURVE_2A
#define DSP2_MISC_REG_DP_GMA_CURVE_2A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_2A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_2A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_2A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_2B      DSP2_MISC_REG_DP_GMA_CURVE_2B
#define DSP2_MISC_REG_DP_GMA_CURVE_2B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_2B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_2B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_2B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2B_POS))

/* 0x22C : disp_gma_curve_2c */
#define DSP2_MISC_DISP_GMA_CURVE_2C_OFFSET (0x22C)
#define DSP2_MISC_REG_DP_GMA_CURVE_2C      DSP2_MISC_REG_DP_GMA_CURVE_2C
#define DSP2_MISC_REG_DP_GMA_CURVE_2C_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2C_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2C_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_2C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2C_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_2C_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_2C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2C_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_2D      DSP2_MISC_REG_DP_GMA_CURVE_2D
#define DSP2_MISC_REG_DP_GMA_CURVE_2D_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2D_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2D_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_2D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2D_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_2D_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_2D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2D_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_2E      DSP2_MISC_REG_DP_GMA_CURVE_2E
#define DSP2_MISC_REG_DP_GMA_CURVE_2E_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2E_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2E_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_2E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2E_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_2E_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_2E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2E_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_2F      DSP2_MISC_REG_DP_GMA_CURVE_2F
#define DSP2_MISC_REG_DP_GMA_CURVE_2F_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2F_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_2F_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_2F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2F_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_2F_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_2F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_2F_POS))

/* 0x230 : disp_gma_curve_30 */
#define DSP2_MISC_DISP_GMA_CURVE_30_OFFSET (0x230)
#define DSP2_MISC_REG_DP_GMA_CURVE_30      DSP2_MISC_REG_DP_GMA_CURVE_30
#define DSP2_MISC_REG_DP_GMA_CURVE_30_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_30_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_30_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_30_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_30_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_30_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_30_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_30_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_31      DSP2_MISC_REG_DP_GMA_CURVE_31
#define DSP2_MISC_REG_DP_GMA_CURVE_31_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_31_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_31_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_31_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_31_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_31_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_31_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_31_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_32      DSP2_MISC_REG_DP_GMA_CURVE_32
#define DSP2_MISC_REG_DP_GMA_CURVE_32_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_32_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_32_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_32_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_32_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_32_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_32_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_32_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_33      DSP2_MISC_REG_DP_GMA_CURVE_33
#define DSP2_MISC_REG_DP_GMA_CURVE_33_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_33_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_33_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_33_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_33_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_33_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_33_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_33_POS))

/* 0x234 : disp_gma_curve_34 */
#define DSP2_MISC_DISP_GMA_CURVE_34_OFFSET (0x234)
#define DSP2_MISC_REG_DP_GMA_CURVE_34      DSP2_MISC_REG_DP_GMA_CURVE_34
#define DSP2_MISC_REG_DP_GMA_CURVE_34_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_34_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_34_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_34_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_34_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_34_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_34_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_34_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_35      DSP2_MISC_REG_DP_GMA_CURVE_35
#define DSP2_MISC_REG_DP_GMA_CURVE_35_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_35_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_35_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_35_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_35_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_35_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_35_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_35_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_36      DSP2_MISC_REG_DP_GMA_CURVE_36
#define DSP2_MISC_REG_DP_GMA_CURVE_36_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_36_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_36_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_36_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_36_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_36_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_36_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_36_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_37      DSP2_MISC_REG_DP_GMA_CURVE_37
#define DSP2_MISC_REG_DP_GMA_CURVE_37_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_37_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_37_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_37_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_37_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_37_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_37_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_37_POS))

/* 0x238 : disp_gma_curve_38 */
#define DSP2_MISC_DISP_GMA_CURVE_38_OFFSET (0x238)
#define DSP2_MISC_REG_DP_GMA_CURVE_38      DSP2_MISC_REG_DP_GMA_CURVE_38
#define DSP2_MISC_REG_DP_GMA_CURVE_38_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_38_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_38_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_38_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_38_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_38_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_38_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_38_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_39      DSP2_MISC_REG_DP_GMA_CURVE_39
#define DSP2_MISC_REG_DP_GMA_CURVE_39_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_39_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_39_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_39_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_39_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_39_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_39_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_39_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_3A      DSP2_MISC_REG_DP_GMA_CURVE_3A
#define DSP2_MISC_REG_DP_GMA_CURVE_3A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_3A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_3A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_3A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_3B      DSP2_MISC_REG_DP_GMA_CURVE_3B
#define DSP2_MISC_REG_DP_GMA_CURVE_3B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_3B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_3B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_3B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3B_POS))

