RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x23C : disp_gma_curve_3c */
#define DSP2_MISC_DISP_GMA_CURVE_3C_OFFSET (0x23C)
#define DSP2_MISC_REG_DP_GMA_CURVE_3C      DSP2_MISC_REG_DP_GMA_CURVE_3C
#define DSP2_MISC_REG_DP_GMA_CURVE_3C_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3C_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3C_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_3C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3C_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_3C_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_3C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3C_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_3D      DSP2_MISC_REG_DP_GMA_CURVE_3D
#define DSP2_MISC_REG_DP_GMA_CURVE_3D_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3D_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3D_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_3D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3D_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_3D_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_3D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3D_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_3E      DSP2_MISC_REG_DP_GMA_CURVE_3E
#define DSP2_MISC_REG_DP_GMA_CURVE_3E_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3E_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3E_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_3E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3E_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_3E_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_3E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3E_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_3F      DSP2_MISC_REG_DP_GMA_CURVE_3F
#define DSP2_MISC_REG_DP_GMA_CURVE_3F_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3F_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_3F_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_3F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3F_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_3F_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_3F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_3F_POS))

/* 0x240 : disp_gma_curve_40 */
#define DSP2_MISC_DISP_GMA_CURVE_40_OFFSET (0x240)
#define DSP2_MISC_REG_DP_GMA_CURVE_40      DSP2_MISC_REG_DP_GMA_CURVE_40
#define DSP2_MISC_REG_DP_GMA_CURVE_40_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_40_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_40_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_40_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_40_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_40_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_40_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_40_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_41      DSP2_MISC_REG_DP_GMA_CURVE_41
#define DSP2_MISC_REG_DP_GMA_CURVE_41_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_41_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_41_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_41_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_41_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_41_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_41_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_41_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_42      DSP2_MISC_REG_DP_GMA_CURVE_42
#define DSP2_MISC_REG_DP_GMA_CURVE_42_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_42_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_42_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_42_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_42_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_42_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_42_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_42_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_43      DSP2_MISC_REG_DP_GMA_CURVE_43
#define DSP2_MISC_REG_DP_GMA_CURVE_43_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_43_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_43_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_43_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_43_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_43_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_43_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_43_POS))

/* 0x244 : disp_gma_curve_44 */
#define DSP2_MISC_DISP_GMA_CURVE_44_OFFSET (0x244)
#define DSP2_MISC_REG_DP_GMA_CURVE_44      DSP2_MISC_REG_DP_GMA_CURVE_44
#define DSP2_MISC_REG_DP_GMA_CURVE_44_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_44_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_44_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_44_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_44_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_44_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_44_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_44_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_45      DSP2_MISC_REG_DP_GMA_CURVE_45
#define DSP2_MISC_REG_DP_GMA_CURVE_45_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_45_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_45_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_45_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_45_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_45_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_45_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_45_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_46      DSP2_MISC_REG_DP_GMA_CURVE_46
#define DSP2_MISC_REG_DP_GMA_CURVE_46_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_46_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_46_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_46_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_46_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_46_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_46_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_46_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_47      DSP2_MISC_REG_DP_GMA_CURVE_47
#define DSP2_MISC_REG_DP_GMA_CURVE_47_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_47_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_47_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_47_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_47_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_47_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_47_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_47_POS))

/* 0x248 : disp_gma_curve_48 */
#define DSP2_MISC_DISP_GMA_CURVE_48_OFFSET (0x248)
#define DSP2_MISC_REG_DP_GMA_CURVE_48      DSP2_MISC_REG_DP_GMA_CURVE_48
#define DSP2_MISC_REG_DP_GMA_CURVE_48_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_48_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_48_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_48_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_48_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_48_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_48_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_48_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_49      DSP2_MISC_REG_DP_GMA_CURVE_49
#define DSP2_MISC_REG_DP_GMA_CURVE_49_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_49_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_49_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_49_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_49_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_49_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_49_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_49_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_4A      DSP2_MISC_REG_DP_GMA_CURVE_4A
#define DSP2_MISC_REG_DP_GMA_CURVE_4A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_4A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_4A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_4A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_4A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_4A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_4A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_4A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_4B      DSP2_MISC_REG_DP_GMA_CURVE_4B
#define DSP2_MISC_REG_DP_GMA_CURVE_4B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_4B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_4B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_4B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_4B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_4B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_4B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_4B_POS))

