RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x278 : disp_gma_curve_78 */
#define DSP2_MISC_DISP_GMA_CURVE_78_OFFSET (0x278)
#define DSP2_MISC_REG_DP_GMA_CURVE_78      DSP2_MISC_REG_DP_GMA_CURVE_78
#define DSP2_MISC_REG_DP_GMA_CURVE_78_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_78_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_78_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_78_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_78_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_78_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_78_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_78_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_79      DSP2_MISC_REG_DP_GMA_CURVE_79
#define DSP2_MISC_REG_DP_GMA_CURVE_79_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_79_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_79_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_79_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_79_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_79_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_79_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_79_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_7A      DSP2_MISC_REG_DP_GMA_CURVE_7A
#define DSP2_MISC_REG_DP_GMA_CURVE_7A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_7A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_7A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_7A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_7B      DSP2_MISC_REG_DP_GMA_CURVE_7B
#define DSP2_MISC_REG_DP_GMA_CURVE_7B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_7B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_7B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_7B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7B_POS))

/* 0x27C : disp_gma_curve_7c */
#define DSP2_MISC_DISP_GMA_CURVE_7C_OFFSET (0x27C)
#define DSP2_MISC_REG_DP_GMA_CURVE_7C      DSP2_MISC_REG_DP_GMA_CURVE_7C
#define DSP2_MISC_REG_DP_GMA_CURVE_7C_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7C_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7C_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_7C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7C_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_7C_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_7C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7C_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_7D      DSP2_MISC_REG_DP_GMA_CURVE_7D
#define DSP2_MISC_REG_DP_GMA_CURVE_7D_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7D_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7D_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_7D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7D_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_7D_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_7D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7D_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_7E      DSP2_MISC_REG_DP_GMA_CURVE_7E
#define DSP2_MISC_REG_DP_GMA_CURVE_7E_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7E_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7E_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_7E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7E_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_7E_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_7E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7E_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_7F      DSP2_MISC_REG_DP_GMA_CURVE_7F
#define DSP2_MISC_REG_DP_GMA_CURVE_7F_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7F_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_7F_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_7F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7F_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_7F_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_7F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_7F_POS))

/* 0x280 : disp_gma_curve_80 */
#define DSP2_MISC_DISP_GMA_CURVE_80_OFFSET (0x280)
#define DSP2_MISC_REG_DP_GMA_CURVE_80      DSP2_MISC_REG_DP_GMA_CURVE_80
#define DSP2_MISC_REG_DP_GMA_CURVE_80_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_80_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_80_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_80_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_80_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_80_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_80_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_80_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_81      DSP2_MISC_REG_DP_GMA_CURVE_81
#define DSP2_MISC_REG_DP_GMA_CURVE_81_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_81_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_81_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_81_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_81_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_81_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_81_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_81_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_82      DSP2_MISC_REG_DP_GMA_CURVE_82
#define DSP2_MISC_REG_DP_GMA_CURVE_82_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_82_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_82_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_82_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_82_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_82_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_82_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_82_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_83      DSP2_MISC_REG_DP_GMA_CURVE_83
#define DSP2_MISC_REG_DP_GMA_CURVE_83_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_83_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_83_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_83_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_83_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_83_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_83_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_83_POS))

/* 0x284 : disp_gma_curve_84 */
#define DSP2_MISC_DISP_GMA_CURVE_84_OFFSET (0x284)
#define DSP2_MISC_REG_DP_GMA_CURVE_84      DSP2_MISC_REG_DP_GMA_CURVE_84
#define DSP2_MISC_REG_DP_GMA_CURVE_84_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_84_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_84_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_84_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_84_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_84_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_84_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_84_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_85      DSP2_MISC_REG_DP_GMA_CURVE_85
#define DSP2_MISC_REG_DP_GMA_CURVE_85_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_85_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_85_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_85_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_85_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_85_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_85_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_85_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_86      DSP2_MISC_REG_DP_GMA_CURVE_86
#define DSP2_MISC_REG_DP_GMA_CURVE_86_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_86_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_86_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_86_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_86_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_86_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_86_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_86_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_87      DSP2_MISC_REG_DP_GMA_CURVE_87
#define DSP2_MISC_REG_DP_GMA_CURVE_87_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_87_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_87_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_87_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_87_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_87_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_87_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_87_POS))

/* 0x288 : disp_gma_curve_88 */
#define DSP2_MISC_DISP_GMA_CURVE_88_OFFSET (0x288)
#define DSP2_MISC_REG_DP_GMA_CURVE_88      DSP2_MISC_REG_DP_GMA_CURVE_88
#define DSP2_MISC_REG_DP_GMA_CURVE_88_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_88_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_88_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_88_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_88_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_88_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_88_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_88_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_89      DSP2_MISC_REG_DP_GMA_CURVE_89
#define DSP2_MISC_REG_DP_GMA_CURVE_89_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_89_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_89_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_89_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_89_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_89_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_89_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_89_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_8A      DSP2_MISC_REG_DP_GMA_CURVE_8A
#define DSP2_MISC_REG_DP_GMA_CURVE_8A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_8A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_8A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_8A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_8B      DSP2_MISC_REG_DP_GMA_CURVE_8B
#define DSP2_MISC_REG_DP_GMA_CURVE_8B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_8B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_8B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_8B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8B_POS))

/* 0x28C : disp_gma_curve_8c */
#define DSP2_MISC_DISP_GMA_CURVE_8C_OFFSET (0x28C)
#define DSP2_MISC_REG_DP_GMA_CURVE_8C      DSP2_MISC_REG_DP_GMA_CURVE_8C
#define DSP2_MISC_REG_DP_GMA_CURVE_8C_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8C_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8C_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_8C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8C_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_8C_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_8C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8C_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_8D      DSP2_MISC_REG_DP_GMA_CURVE_8D
#define DSP2_MISC_REG_DP_GMA_CURVE_8D_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8D_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8D_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_8D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8D_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_8D_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_8D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8D_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_8E      DSP2_MISC_REG_DP_GMA_CURVE_8E
#define DSP2_MISC_REG_DP_GMA_CURVE_8E_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8E_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8E_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_8E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8E_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_8E_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_8E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8E_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_8F      DSP2_MISC_REG_DP_GMA_CURVE_8F
#define DSP2_MISC_REG_DP_GMA_CURVE_8F_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8F_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_8F_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_8F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8F_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_8F_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_8F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_8F_POS))

/* 0x290 : disp_gma_curve_90 */
#define DSP2_MISC_DISP_GMA_CURVE_90_OFFSET (0x290)
#define DSP2_MISC_REG_DP_GMA_CURVE_90      DSP2_MISC_REG_DP_GMA_CURVE_90
#define DSP2_MISC_REG_DP_GMA_CURVE_90_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_90_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_90_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_90_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_90_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_90_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_90_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_90_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_91      DSP2_MISC_REG_DP_GMA_CURVE_91
#define DSP2_MISC_REG_DP_GMA_CURVE_91_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_91_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_91_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_91_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_91_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_91_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_91_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_91_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_92      DSP2_MISC_REG_DP_GMA_CURVE_92
#define DSP2_MISC_REG_DP_GMA_CURVE_92_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_92_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_92_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_92_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_92_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_92_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_92_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_92_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_93      DSP2_MISC_REG_DP_GMA_CURVE_93
#define DSP2_MISC_REG_DP_GMA_CURVE_93_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_93_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_93_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_93_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_93_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_93_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_93_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_93_POS))

/* 0x294 : disp_gma_curve_94 */
#define DSP2_MISC_DISP_GMA_CURVE_94_OFFSET (0x294)
#define DSP2_MISC_REG_DP_GMA_CURVE_94      DSP2_MISC_REG_DP_GMA_CURVE_94
#define DSP2_MISC_REG_DP_GMA_CURVE_94_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_94_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_94_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_94_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_94_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_94_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_94_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_94_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_95      DSP2_MISC_REG_DP_GMA_CURVE_95
#define DSP2_MISC_REG_DP_GMA_CURVE_95_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_95_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_95_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_95_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_95_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_95_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_95_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_95_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_96      DSP2_MISC_REG_DP_GMA_CURVE_96
#define DSP2_MISC_REG_DP_GMA_CURVE_96_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_96_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_96_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_96_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_96_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_96_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_96_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_96_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_97      DSP2_MISC_REG_DP_GMA_CURVE_97
#define DSP2_MISC_REG_DP_GMA_CURVE_97_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_97_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_97_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_97_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_97_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_97_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_97_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_97_POS))

