RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x298 : disp_gma_curve_98 */
#define DSP2_MISC_DISP_GMA_CURVE_98_OFFSET (0x298)
#define DSP2_MISC_REG_DP_GMA_CURVE_98      DSP2_MISC_REG_DP_GMA_CURVE_98
#define DSP2_MISC_REG_DP_GMA_CURVE_98_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_98_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_98_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_98_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_98_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_98_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_98_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_98_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_99      DSP2_MISC_REG_DP_GMA_CURVE_99
#define DSP2_MISC_REG_DP_GMA_CURVE_99_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_99_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_99_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_99_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_99_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_99_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_99_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_99_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_9A      DSP2_MISC_REG_DP_GMA_CURVE_9A
#define DSP2_MISC_REG_DP_GMA_CURVE_9A_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9A_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9A_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_9A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9A_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_9A_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_9A_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9A_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_9B      DSP2_MISC_REG_DP_GMA_CURVE_9B
#define DSP2_MISC_REG_DP_GMA_CURVE_9B_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9B_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9B_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_9B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9B_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_9B_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_9B_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9B_POS))

/* 0x29C : disp_gma_curve_9c */
#define DSP2_MISC_DISP_GMA_CURVE_9C_OFFSET (0x29C)
#define DSP2_MISC_REG_DP_GMA_CURVE_9C      DSP2_MISC_REG_DP_GMA_CURVE_9C
#define DSP2_MISC_REG_DP_GMA_CURVE_9C_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9C_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9C_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_9C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9C_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_9C_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_9C_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9C_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_9D      DSP2_MISC_REG_DP_GMA_CURVE_9D
#define DSP2_MISC_REG_DP_GMA_CURVE_9D_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9D_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9D_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_9D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9D_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_9D_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_9D_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9D_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_9E      DSP2_MISC_REG_DP_GMA_CURVE_9E
#define DSP2_MISC_REG_DP_GMA_CURVE_9E_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9E_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9E_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_9E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9E_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_9E_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_9E_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9E_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_9F      DSP2_MISC_REG_DP_GMA_CURVE_9F
#define DSP2_MISC_REG_DP_GMA_CURVE_9F_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9F_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_9F_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_9F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9F_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_9F_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_9F_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_9F_POS))

/* 0x2A0 : disp_gma_curve_a0 */
#define DSP2_MISC_DISP_GMA_CURVE_A0_OFFSET (0x2A0)
#define DSP2_MISC_REG_DP_GMA_CURVE_A0      DSP2_MISC_REG_DP_GMA_CURVE_A0
#define DSP2_MISC_REG_DP_GMA_CURVE_A0_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A0_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A0_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A0_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A0_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A0_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_A1      DSP2_MISC_REG_DP_GMA_CURVE_A1
#define DSP2_MISC_REG_DP_GMA_CURVE_A1_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A1_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A1_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A1_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A1_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A1_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_A2      DSP2_MISC_REG_DP_GMA_CURVE_A2
#define DSP2_MISC_REG_DP_GMA_CURVE_A2_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A2_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A2_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A2_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A2_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A2_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_A3      DSP2_MISC_REG_DP_GMA_CURVE_A3
#define DSP2_MISC_REG_DP_GMA_CURVE_A3_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A3_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A3_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A3_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A3_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A3_POS))

/* 0x2A4 : disp_gma_curve_a4 */
#define DSP2_MISC_DISP_GMA_CURVE_A4_OFFSET (0x2A4)
#define DSP2_MISC_REG_DP_GMA_CURVE_A4      DSP2_MISC_REG_DP_GMA_CURVE_A4
#define DSP2_MISC_REG_DP_GMA_CURVE_A4_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A4_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A4_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A4_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A4_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A4_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_A5      DSP2_MISC_REG_DP_GMA_CURVE_A5
#define DSP2_MISC_REG_DP_GMA_CURVE_A5_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A5_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A5_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A5_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A5_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A5_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_A6      DSP2_MISC_REG_DP_GMA_CURVE_A6
#define DSP2_MISC_REG_DP_GMA_CURVE_A6_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A6_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A6_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A6_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A6_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A6_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_A7      DSP2_MISC_REG_DP_GMA_CURVE_A7
#define DSP2_MISC_REG_DP_GMA_CURVE_A7_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A7_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A7_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A7_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A7_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A7_POS))

/* 0x2A8 : disp_gma_curve_a8 */
#define DSP2_MISC_DISP_GMA_CURVE_A8_OFFSET (0x2A8)
#define DSP2_MISC_REG_DP_GMA_CURVE_A8      DSP2_MISC_REG_DP_GMA_CURVE_A8
#define DSP2_MISC_REG_DP_GMA_CURVE_A8_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A8_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A8_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A8_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A8_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A8_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_A9      DSP2_MISC_REG_DP_GMA_CURVE_A9
#define DSP2_MISC_REG_DP_GMA_CURVE_A9_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A9_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_A9_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_A9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A9_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_A9_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_A9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_A9_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_AA      DSP2_MISC_REG_DP_GMA_CURVE_AA
#define DSP2_MISC_REG_DP_GMA_CURVE_AA_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AA_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AA_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_AA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AA_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_AA_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_AA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AA_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_AB      DSP2_MISC_REG_DP_GMA_CURVE_AB
#define DSP2_MISC_REG_DP_GMA_CURVE_AB_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AB_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AB_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_AB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AB_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_AB_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_AB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AB_POS))

/* 0x2AC : disp_gma_curve_ac */
#define DSP2_MISC_DISP_GMA_CURVE_AC_OFFSET (0x2AC)
#define DSP2_MISC_REG_DP_GMA_CURVE_AC      DSP2_MISC_REG_DP_GMA_CURVE_AC
#define DSP2_MISC_REG_DP_GMA_CURVE_AC_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AC_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AC_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_AC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AC_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_AC_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_AC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AC_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_AD      DSP2_MISC_REG_DP_GMA_CURVE_AD
#define DSP2_MISC_REG_DP_GMA_CURVE_AD_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AD_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AD_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_AD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AD_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_AD_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_AD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AD_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_AE      DSP2_MISC_REG_DP_GMA_CURVE_AE
#define DSP2_MISC_REG_DP_GMA_CURVE_AE_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AE_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AE_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_AE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AE_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_AE_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_AE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AE_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_AF      DSP2_MISC_REG_DP_GMA_CURVE_AF
#define DSP2_MISC_REG_DP_GMA_CURVE_AF_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AF_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_AF_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_AF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AF_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_AF_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_AF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_AF_POS))

