RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x2CC : disp_gma_curve_cc */
#define DSP2_MISC_DISP_GMA_CURVE_CC_OFFSET (0x2CC)
#define DSP2_MISC_REG_DP_GMA_CURVE_CC      DSP2_MISC_REG_DP_GMA_CURVE_CC
#define DSP2_MISC_REG_DP_GMA_CURVE_CC_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CC_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CC_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_CC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CC_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_CC_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_CC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CC_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_CD      DSP2_MISC_REG_DP_GMA_CURVE_CD
#define DSP2_MISC_REG_DP_GMA_CURVE_CD_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CD_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CD_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_CD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CD_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_CD_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_CD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CD_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_CE      DSP2_MISC_REG_DP_GMA_CURVE_CE
#define DSP2_MISC_REG_DP_GMA_CURVE_CE_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CE_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CE_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_CE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CE_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_CE_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_CE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CE_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_CF      DSP2_MISC_REG_DP_GMA_CURVE_CF
#define DSP2_MISC_REG_DP_GMA_CURVE_CF_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CF_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_CF_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_CF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CF_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_CF_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_CF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_CF_POS))

/* 0x2D0 : disp_gma_curve_d0 */
#define DSP2_MISC_DISP_GMA_CURVE_D0_OFFSET (0x2D0)
#define DSP2_MISC_REG_DP_GMA_CURVE_D0      DSP2_MISC_REG_DP_GMA_CURVE_D0
#define DSP2_MISC_REG_DP_GMA_CURVE_D0_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D0_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D0_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D0_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D0_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D0_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_D1      DSP2_MISC_REG_DP_GMA_CURVE_D1
#define DSP2_MISC_REG_DP_GMA_CURVE_D1_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D1_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D1_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D1_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D1_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D1_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_D2      DSP2_MISC_REG_DP_GMA_CURVE_D2
#define DSP2_MISC_REG_DP_GMA_CURVE_D2_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D2_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D2_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D2_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D2_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D2_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_D3      DSP2_MISC_REG_DP_GMA_CURVE_D3
#define DSP2_MISC_REG_DP_GMA_CURVE_D3_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D3_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D3_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D3_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D3_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D3_POS))

/* 0x2D4 : disp_gma_curve_d4 */
#define DSP2_MISC_DISP_GMA_CURVE_D4_OFFSET (0x2D4)
#define DSP2_MISC_REG_DP_GMA_CURVE_D4      DSP2_MISC_REG_DP_GMA_CURVE_D4
#define DSP2_MISC_REG_DP_GMA_CURVE_D4_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D4_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D4_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D4_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D4_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D4_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_D5      DSP2_MISC_REG_DP_GMA_CURVE_D5
#define DSP2_MISC_REG_DP_GMA_CURVE_D5_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D5_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D5_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D5_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D5_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D5_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_D6      DSP2_MISC_REG_DP_GMA_CURVE_D6
#define DSP2_MISC_REG_DP_GMA_CURVE_D6_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D6_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D6_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D6_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D6_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D6_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_D7      DSP2_MISC_REG_DP_GMA_CURVE_D7
#define DSP2_MISC_REG_DP_GMA_CURVE_D7_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D7_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D7_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D7_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D7_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D7_POS))

/* 0x2D8 : disp_gma_curve_d8 */
#define DSP2_MISC_DISP_GMA_CURVE_D8_OFFSET (0x2D8)
#define DSP2_MISC_REG_DP_GMA_CURVE_D8      DSP2_MISC_REG_DP_GMA_CURVE_D8
#define DSP2_MISC_REG_DP_GMA_CURVE_D8_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D8_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D8_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D8_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D8_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D8_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_D9      DSP2_MISC_REG_DP_GMA_CURVE_D9
#define DSP2_MISC_REG_DP_GMA_CURVE_D9_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D9_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_D9_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_D9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D9_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_D9_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_D9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_D9_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_DA      DSP2_MISC_REG_DP_GMA_CURVE_DA
#define DSP2_MISC_REG_DP_GMA_CURVE_DA_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DA_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DA_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_DA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DA_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_DA_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_DA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DA_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_DB      DSP2_MISC_REG_DP_GMA_CURVE_DB
#define DSP2_MISC_REG_DP_GMA_CURVE_DB_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DB_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DB_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_DB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DB_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_DB_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_DB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DB_POS))

