RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
/* 0x2DC : disp_gma_curve_dc */
#define DSP2_MISC_DISP_GMA_CURVE_DC_OFFSET (0x2DC)
#define DSP2_MISC_REG_DP_GMA_CURVE_DC      DSP2_MISC_REG_DP_GMA_CURVE_DC
#define DSP2_MISC_REG_DP_GMA_CURVE_DC_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DC_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DC_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_DC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DC_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_DC_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_DC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DC_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_DD      DSP2_MISC_REG_DP_GMA_CURVE_DD
#define DSP2_MISC_REG_DP_GMA_CURVE_DD_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DD_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DD_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_DD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DD_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_DD_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_DD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DD_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_DE      DSP2_MISC_REG_DP_GMA_CURVE_DE
#define DSP2_MISC_REG_DP_GMA_CURVE_DE_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DE_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DE_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_DE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DE_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_DE_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_DE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DE_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_DF      DSP2_MISC_REG_DP_GMA_CURVE_DF
#define DSP2_MISC_REG_DP_GMA_CURVE_DF_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DF_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_DF_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_DF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DF_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_DF_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_DF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_DF_POS))

/* 0x2E0 : disp_gma_curve_e0 */
#define DSP2_MISC_DISP_GMA_CURVE_E0_OFFSET (0x2E0)
#define DSP2_MISC_REG_DP_GMA_CURVE_E0      DSP2_MISC_REG_DP_GMA_CURVE_E0
#define DSP2_MISC_REG_DP_GMA_CURVE_E0_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E0_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E0_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E0_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E0_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E0_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_E1      DSP2_MISC_REG_DP_GMA_CURVE_E1
#define DSP2_MISC_REG_DP_GMA_CURVE_E1_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E1_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E1_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E1_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E1_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E1_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_E2      DSP2_MISC_REG_DP_GMA_CURVE_E2
#define DSP2_MISC_REG_DP_GMA_CURVE_E2_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E2_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E2_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E2_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E2_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E2_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_E3      DSP2_MISC_REG_DP_GMA_CURVE_E3
#define DSP2_MISC_REG_DP_GMA_CURVE_E3_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E3_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E3_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E3_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E3_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E3_POS))

/* 0x2E4 : disp_gma_curve_e4 */
#define DSP2_MISC_DISP_GMA_CURVE_E4_OFFSET (0x2E4)
#define DSP2_MISC_REG_DP_GMA_CURVE_E4      DSP2_MISC_REG_DP_GMA_CURVE_E4
#define DSP2_MISC_REG_DP_GMA_CURVE_E4_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E4_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E4_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E4_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E4_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E4_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_E5      DSP2_MISC_REG_DP_GMA_CURVE_E5
#define DSP2_MISC_REG_DP_GMA_CURVE_E5_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E5_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E5_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E5_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E5_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E5_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_E6      DSP2_MISC_REG_DP_GMA_CURVE_E6
#define DSP2_MISC_REG_DP_GMA_CURVE_E6_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E6_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E6_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E6_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E6_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E6_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_E7      DSP2_MISC_REG_DP_GMA_CURVE_E7
#define DSP2_MISC_REG_DP_GMA_CURVE_E7_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E7_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E7_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E7_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E7_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E7_POS))

/* 0x2E8 : disp_gma_curve_e8 */
#define DSP2_MISC_DISP_GMA_CURVE_E8_OFFSET (0x2E8)
#define DSP2_MISC_REG_DP_GMA_CURVE_E8      DSP2_MISC_REG_DP_GMA_CURVE_E8
#define DSP2_MISC_REG_DP_GMA_CURVE_E8_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E8_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E8_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E8_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E8_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E8_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_E9      DSP2_MISC_REG_DP_GMA_CURVE_E9
#define DSP2_MISC_REG_DP_GMA_CURVE_E9_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E9_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_E9_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_E9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E9_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_E9_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_E9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_E9_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_EA      DSP2_MISC_REG_DP_GMA_CURVE_EA
#define DSP2_MISC_REG_DP_GMA_CURVE_EA_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EA_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EA_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_EA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EA_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_EA_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_EA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EA_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_EB      DSP2_MISC_REG_DP_GMA_CURVE_EB
#define DSP2_MISC_REG_DP_GMA_CURVE_EB_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EB_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EB_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_EB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EB_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_EB_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_EB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EB_POS))

/* 0x2EC : disp_gma_curve_ec */
#define DSP2_MISC_DISP_GMA_CURVE_EC_OFFSET (0x2EC)
#define DSP2_MISC_REG_DP_GMA_CURVE_EC      DSP2_MISC_REG_DP_GMA_CURVE_EC
#define DSP2_MISC_REG_DP_GMA_CURVE_EC_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EC_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EC_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_EC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EC_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_EC_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_EC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EC_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_ED      DSP2_MISC_REG_DP_GMA_CURVE_ED
#define DSP2_MISC_REG_DP_GMA_CURVE_ED_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_ED_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_ED_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_ED_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_ED_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_ED_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_ED_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_ED_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_EE      DSP2_MISC_REG_DP_GMA_CURVE_EE
#define DSP2_MISC_REG_DP_GMA_CURVE_EE_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EE_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EE_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_EE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EE_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_EE_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_EE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EE_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_EF      DSP2_MISC_REG_DP_GMA_CURVE_EF
#define DSP2_MISC_REG_DP_GMA_CURVE_EF_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EF_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_EF_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_EF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EF_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_EF_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_EF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_EF_POS))

/* 0x2F0 : disp_gma_curve_f0 */
#define DSP2_MISC_DISP_GMA_CURVE_F0_OFFSET (0x2F0)
#define DSP2_MISC_REG_DP_GMA_CURVE_F0      DSP2_MISC_REG_DP_GMA_CURVE_F0
#define DSP2_MISC_REG_DP_GMA_CURVE_F0_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F0_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F0_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F0_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F0_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F0_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F0_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_F1      DSP2_MISC_REG_DP_GMA_CURVE_F1
#define DSP2_MISC_REG_DP_GMA_CURVE_F1_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F1_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F1_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F1_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F1_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F1_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F1_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_F2      DSP2_MISC_REG_DP_GMA_CURVE_F2
#define DSP2_MISC_REG_DP_GMA_CURVE_F2_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F2_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F2_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F2_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F2_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F2_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F2_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_F3      DSP2_MISC_REG_DP_GMA_CURVE_F3
#define DSP2_MISC_REG_DP_GMA_CURVE_F3_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F3_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F3_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F3_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F3_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F3_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F3_POS))

/* 0x2F4 : disp_gma_curve_f4 */
#define DSP2_MISC_DISP_GMA_CURVE_F4_OFFSET (0x2F4)
#define DSP2_MISC_REG_DP_GMA_CURVE_F4      DSP2_MISC_REG_DP_GMA_CURVE_F4
#define DSP2_MISC_REG_DP_GMA_CURVE_F4_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F4_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F4_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F4_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F4_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F4_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F4_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_F5      DSP2_MISC_REG_DP_GMA_CURVE_F5
#define DSP2_MISC_REG_DP_GMA_CURVE_F5_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F5_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F5_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F5_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F5_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F5_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F5_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_F6      DSP2_MISC_REG_DP_GMA_CURVE_F6
#define DSP2_MISC_REG_DP_GMA_CURVE_F6_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F6_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F6_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F6_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F6_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F6_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F6_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_F7      DSP2_MISC_REG_DP_GMA_CURVE_F7
#define DSP2_MISC_REG_DP_GMA_CURVE_F7_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F7_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F7_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F7_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F7_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F7_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F7_POS))

/* 0x2F8 : disp_gma_curve_f8 */
#define DSP2_MISC_DISP_GMA_CURVE_F8_OFFSET (0x2F8)
#define DSP2_MISC_REG_DP_GMA_CURVE_F8      DSP2_MISC_REG_DP_GMA_CURVE_F8
#define DSP2_MISC_REG_DP_GMA_CURVE_F8_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F8_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F8_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F8_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F8_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F8_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F8_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_F9      DSP2_MISC_REG_DP_GMA_CURVE_F9
#define DSP2_MISC_REG_DP_GMA_CURVE_F9_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F9_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_F9_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_F9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F9_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_F9_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_F9_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_F9_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_FA      DSP2_MISC_REG_DP_GMA_CURVE_FA
#define DSP2_MISC_REG_DP_GMA_CURVE_FA_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FA_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FA_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_FA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FA_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_FA_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_FA_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FA_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_FB      DSP2_MISC_REG_DP_GMA_CURVE_FB
#define DSP2_MISC_REG_DP_GMA_CURVE_FB_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FB_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FB_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_FB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FB_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_FB_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_FB_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FB_POS))

/* 0x2FC : disp_gma_curve_fc */
#define DSP2_MISC_DISP_GMA_CURVE_FC_OFFSET (0x2FC)
#define DSP2_MISC_REG_DP_GMA_CURVE_FC      DSP2_MISC_REG_DP_GMA_CURVE_FC
#define DSP2_MISC_REG_DP_GMA_CURVE_FC_POS  (0U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FC_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FC_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_FC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FC_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_FC_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_FC_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FC_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_FD      DSP2_MISC_REG_DP_GMA_CURVE_FD
#define DSP2_MISC_REG_DP_GMA_CURVE_FD_POS  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FD_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FD_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_FD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FD_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_FD_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_FD_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FD_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_FE      DSP2_MISC_REG_DP_GMA_CURVE_FE
#define DSP2_MISC_REG_DP_GMA_CURVE_FE_POS  (16U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FE_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FE_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_FE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FE_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_FE_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_FE_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FE_POS))
#define DSP2_MISC_REG_DP_GMA_CURVE_FF      DSP2_MISC_REG_DP_GMA_CURVE_FF
#define DSP2_MISC_REG_DP_GMA_CURVE_FF_POS  (24U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FF_LEN  (8U)
#define DSP2_MISC_REG_DP_GMA_CURVE_FF_MSK  (((1U << DSP2_MISC_REG_DP_GMA_CURVE_FF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FF_POS)
#define DSP2_MISC_REG_DP_GMA_CURVE_FF_UMSK (~(((1U << DSP2_MISC_REG_DP_GMA_CURVE_FF_LEN) - 1) << DSP2_MISC_REG_DP_GMA_CURVE_FF_POS))

