RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
    /* 0x220 : disp_gma_curve_20 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_20 : 8; /* [ 7: 0],        r/w,       0x20 */
            uint32_t reg_dp_gma_curve_21 : 8; /* [15: 8],        r/w,       0x21 */
            uint32_t reg_dp_gma_curve_22 : 8; /* [23:16],        r/w,       0x22 */
            uint32_t reg_dp_gma_curve_23 : 8; /* [31:24],        r/w,       0x23 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_20;

    /* 0x224 : disp_gma_curve_24 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_24 : 8; /* [ 7: 0],        r/w,       0x24 */
            uint32_t reg_dp_gma_curve_25 : 8; /* [15: 8],        r/w,       0x25 */
            uint32_t reg_dp_gma_curve_26 : 8; /* [23:16],        r/w,       0x26 */
            uint32_t reg_dp_gma_curve_27 : 8; /* [31:24],        r/w,       0x27 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_24;

    /* 0x228 : disp_gma_curve_28 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_28 : 8; /* [ 7: 0],        r/w,       0x28 */
            uint32_t reg_dp_gma_curve_29 : 8; /* [15: 8],        r/w,       0x29 */
            uint32_t reg_dp_gma_curve_2a : 8; /* [23:16],        r/w,       0x2a */
            uint32_t reg_dp_gma_curve_2b : 8; /* [31:24],        r/w,       0x2b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_28;

    /* 0x22C : disp_gma_curve_2c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_2c : 8; /* [ 7: 0],        r/w,       0x2c */
            uint32_t reg_dp_gma_curve_2d : 8; /* [15: 8],        r/w,       0x2d */
            uint32_t reg_dp_gma_curve_2e : 8; /* [23:16],        r/w,       0x2e */
            uint32_t reg_dp_gma_curve_2f : 8; /* [31:24],        r/w,       0x2f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_2c;

    /* 0x230 : disp_gma_curve_30 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_30 : 8; /* [ 7: 0],        r/w,       0x30 */
            uint32_t reg_dp_gma_curve_31 : 8; /* [15: 8],        r/w,       0x31 */
            uint32_t reg_dp_gma_curve_32 : 8; /* [23:16],        r/w,       0x32 */
            uint32_t reg_dp_gma_curve_33 : 8; /* [31:24],        r/w,       0x33 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_30;

    /* 0x234 : disp_gma_curve_34 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_34 : 8; /* [ 7: 0],        r/w,       0x34 */
            uint32_t reg_dp_gma_curve_35 : 8; /* [15: 8],        r/w,       0x35 */
            uint32_t reg_dp_gma_curve_36 : 8; /* [23:16],        r/w,       0x36 */
            uint32_t reg_dp_gma_curve_37 : 8; /* [31:24],        r/w,       0x37 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_34;

    /* 0x238 : disp_gma_curve_38 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_38 : 8; /* [ 7: 0],        r/w,       0x38 */
            uint32_t reg_dp_gma_curve_39 : 8; /* [15: 8],        r/w,       0x39 */
            uint32_t reg_dp_gma_curve_3a : 8; /* [23:16],        r/w,       0x3a */
            uint32_t reg_dp_gma_curve_3b : 8; /* [31:24],        r/w,       0x3b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_38;

    /* 0x23C : disp_gma_curve_3c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_3c : 8; /* [ 7: 0],        r/w,       0x3c */
            uint32_t reg_dp_gma_curve_3d : 8; /* [15: 8],        r/w,       0x3d */
            uint32_t reg_dp_gma_curve_3e : 8; /* [23:16],        r/w,       0x3e */
            uint32_t reg_dp_gma_curve_3f : 8; /* [31:24],        r/w,       0x3f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_3c;

    /* 0x240 : disp_gma_curve_40 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_40 : 8; /* [ 7: 0],        r/w,       0x40 */
            uint32_t reg_dp_gma_curve_41 : 8; /* [15: 8],        r/w,       0x41 */
            uint32_t reg_dp_gma_curve_42 : 8; /* [23:16],        r/w,       0x42 */
            uint32_t reg_dp_gma_curve_43 : 8; /* [31:24],        r/w,       0x43 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_40;

    /* 0x244 : disp_gma_curve_44 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_44 : 8; /* [ 7: 0],        r/w,       0x44 */
            uint32_t reg_dp_gma_curve_45 : 8; /* [15: 8],        r/w,       0x45 */
            uint32_t reg_dp_gma_curve_46 : 8; /* [23:16],        r/w,       0x46 */
            uint32_t reg_dp_gma_curve_47 : 8; /* [31:24],        r/w,       0x47 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_44;

    /* 0x248 : disp_gma_curve_48 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_48 : 8; /* [ 7: 0],        r/w,       0x48 */
            uint32_t reg_dp_gma_curve_49 : 8; /* [15: 8],        r/w,       0x49 */
            uint32_t reg_dp_gma_curve_4a : 8; /* [23:16],        r/w,       0x4a */
            uint32_t reg_dp_gma_curve_4b : 8; /* [31:24],        r/w,       0x4b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_48;

    /* 0x24C : disp_gma_curve_4c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_4c : 8; /* [ 7: 0],        r/w,       0x4c */
            uint32_t reg_dp_gma_curve_4d : 8; /* [15: 8],        r/w,       0x4d */
            uint32_t reg_dp_gma_curve_4e : 8; /* [23:16],        r/w,       0x4e */
            uint32_t reg_dp_gma_curve_4f : 8; /* [31:24],        r/w,       0x4f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_4c;

    /* 0x250 : disp_gma_curve_50 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_50 : 8; /* [ 7: 0],        r/w,       0x50 */
            uint32_t reg_dp_gma_curve_51 : 8; /* [15: 8],        r/w,       0x51 */
            uint32_t reg_dp_gma_curve_52 : 8; /* [23:16],        r/w,       0x52 */
            uint32_t reg_dp_gma_curve_53 : 8; /* [31:24],        r/w,       0x53 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_50;

