RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
    /* 0x254 : disp_gma_curve_54 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_54 : 8; /* [ 7: 0],        r/w,       0x54 */
            uint32_t reg_dp_gma_curve_55 : 8; /* [15: 8],        r/w,       0x55 */
            uint32_t reg_dp_gma_curve_56 : 8; /* [23:16],        r/w,       0x56 */
            uint32_t reg_dp_gma_curve_57 : 8; /* [31:24],        r/w,       0x57 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_54;

    /* 0x258 : disp_gma_curve_58 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_58 : 8; /* [ 7: 0],        r/w,       0x58 */
            uint32_t reg_dp_gma_curve_59 : 8; /* [15: 8],        r/w,       0x59 */
            uint32_t reg_dp_gma_curve_5a : 8; /* [23:16],        r/w,       0x5a */
            uint32_t reg_dp_gma_curve_5b : 8; /* [31:24],        r/w,       0x5b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_58;

    /* 0x25C : disp_gma_curve_5c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_5c : 8; /* [ 7: 0],        r/w,       0x5c */
            uint32_t reg_dp_gma_curve_5d : 8; /* [15: 8],        r/w,       0x5d */
            uint32_t reg_dp_gma_curve_5e : 8; /* [23:16],        r/w,       0x5e */
            uint32_t reg_dp_gma_curve_5f : 8; /* [31:24],        r/w,       0x5f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_5c;

    /* 0x260 : disp_gma_curve_60 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_60 : 8; /* [ 7: 0],        r/w,       0x60 */
            uint32_t reg_dp_gma_curve_61 : 8; /* [15: 8],        r/w,       0x61 */
            uint32_t reg_dp_gma_curve_62 : 8; /* [23:16],        r/w,       0x62 */
            uint32_t reg_dp_gma_curve_63 : 8; /* [31:24],        r/w,       0x63 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_60;

    /* 0x264 : disp_gma_curve_64 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_64 : 8; /* [ 7: 0],        r/w,       0x64 */
            uint32_t reg_dp_gma_curve_65 : 8; /* [15: 8],        r/w,       0x65 */
            uint32_t reg_dp_gma_curve_66 : 8; /* [23:16],        r/w,       0x66 */
            uint32_t reg_dp_gma_curve_67 : 8; /* [31:24],        r/w,       0x67 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_64;

    /* 0x268 : disp_gma_curve_68 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_68 : 8; /* [ 7: 0],        r/w,       0x68 */
            uint32_t reg_dp_gma_curve_69 : 8; /* [15: 8],        r/w,       0x69 */
            uint32_t reg_dp_gma_curve_6a : 8; /* [23:16],        r/w,       0x6a */
            uint32_t reg_dp_gma_curve_6b : 8; /* [31:24],        r/w,       0x6b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_68;

    /* 0x26C : disp_gma_curve_6c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_6c : 8; /* [ 7: 0],        r/w,       0x6c */
            uint32_t reg_dp_gma_curve_6d : 8; /* [15: 8],        r/w,       0x6d */
            uint32_t reg_dp_gma_curve_6e : 8; /* [23:16],        r/w,       0x6e */
            uint32_t reg_dp_gma_curve_6f : 8; /* [31:24],        r/w,       0x6f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_6c;

    /* 0x270 : disp_gma_curve_70 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_70 : 8; /* [ 7: 0],        r/w,       0x70 */
            uint32_t reg_dp_gma_curve_71 : 8; /* [15: 8],        r/w,       0x71 */
            uint32_t reg_dp_gma_curve_72 : 8; /* [23:16],        r/w,       0x72 */
            uint32_t reg_dp_gma_curve_73 : 8; /* [31:24],        r/w,       0x73 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_70;

    /* 0x274 : disp_gma_curve_74 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_74 : 8; /* [ 7: 0],        r/w,       0x74 */
            uint32_t reg_dp_gma_curve_75 : 8; /* [15: 8],        r/w,       0x75 */
            uint32_t reg_dp_gma_curve_76 : 8; /* [23:16],        r/w,       0x76 */
            uint32_t reg_dp_gma_curve_77 : 8; /* [31:24],        r/w,       0x77 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_74;

    /* 0x278 : disp_gma_curve_78 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_78 : 8; /* [ 7: 0],        r/w,       0x78 */
            uint32_t reg_dp_gma_curve_79 : 8; /* [15: 8],        r/w,       0x79 */
            uint32_t reg_dp_gma_curve_7a : 8; /* [23:16],        r/w,       0x7a */
            uint32_t reg_dp_gma_curve_7b : 8; /* [31:24],        r/w,       0x7b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_78;

    /* 0x27C : disp_gma_curve_7c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_7c : 8; /* [ 7: 0],        r/w,       0x7c */
            uint32_t reg_dp_gma_curve_7d : 8; /* [15: 8],        r/w,       0x7d */
            uint32_t reg_dp_gma_curve_7e : 8; /* [23:16],        r/w,       0x7e */
            uint32_t reg_dp_gma_curve_7f : 8; /* [31:24],        r/w,       0x7f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_7c;

    /* 0x280 : disp_gma_curve_80 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_80 : 8; /* [ 7: 0],        r/w,       0x80 */
            uint32_t reg_dp_gma_curve_81 : 8; /* [15: 8],        r/w,       0x81 */
            uint32_t reg_dp_gma_curve_82 : 8; /* [23:16],        r/w,       0x82 */
            uint32_t reg_dp_gma_curve_83 : 8; /* [31:24],        r/w,       0x83 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_80;

    /* 0x284 : disp_gma_curve_84 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_84 : 8; /* [ 7: 0],        r/w,       0x84 */
            uint32_t reg_dp_gma_curve_85 : 8; /* [15: 8],        r/w,       0x85 */
            uint32_t reg_dp_gma_curve_86 : 8; /* [23:16],        r/w,       0x86 */
            uint32_t reg_dp_gma_curve_87 : 8; /* [31:24],        r/w,       0x87 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_84;

    /* 0x288 : disp_gma_curve_88 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_88 : 8; /* [ 7: 0],        r/w,       0x88 */
            uint32_t reg_dp_gma_curve_89 : 8; /* [15: 8],        r/w,       0x89 */
            uint32_t reg_dp_gma_curve_8a : 8; /* [23:16],        r/w,       0x8a */
            uint32_t reg_dp_gma_curve_8b : 8; /* [31:24],        r/w,       0x8b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_88;

    /* 0x28C : disp_gma_curve_8c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_8c : 8; /* [ 7: 0],        r/w,       0x8c */
            uint32_t reg_dp_gma_curve_8d : 8; /* [15: 8],        r/w,       0x8d */
            uint32_t reg_dp_gma_curve_8e : 8; /* [23:16],        r/w,       0x8e */
            uint32_t reg_dp_gma_curve_8f : 8; /* [31:24],        r/w,       0x8f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_8c;

    /* 0x290 : disp_gma_curve_90 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_90 : 8; /* [ 7: 0],        r/w,       0x90 */
            uint32_t reg_dp_gma_curve_91 : 8; /* [15: 8],        r/w,       0x91 */
            uint32_t reg_dp_gma_curve_92 : 8; /* [23:16],        r/w,       0x92 */
            uint32_t reg_dp_gma_curve_93 : 8; /* [31:24],        r/w,       0x93 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_90;

    /* 0x294 : disp_gma_curve_94 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_94 : 8; /* [ 7: 0],        r/w,       0x94 */
            uint32_t reg_dp_gma_curve_95 : 8; /* [15: 8],        r/w,       0x95 */
            uint32_t reg_dp_gma_curve_96 : 8; /* [23:16],        r/w,       0x96 */
            uint32_t reg_dp_gma_curve_97 : 8; /* [31:24],        r/w,       0x97 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_94;

