RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
    /* 0x298 : disp_gma_curve_98 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_98 : 8; /* [ 7: 0],        r/w,       0x98 */
            uint32_t reg_dp_gma_curve_99 : 8; /* [15: 8],        r/w,       0x99 */
            uint32_t reg_dp_gma_curve_9a : 8; /* [23:16],        r/w,       0x9a */
            uint32_t reg_dp_gma_curve_9b : 8; /* [31:24],        r/w,       0x9b */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_98;

    /* 0x29C : disp_gma_curve_9c */
    union {
        struct {
            uint32_t reg_dp_gma_curve_9c : 8; /* [ 7: 0],        r/w,       0x9c */
            uint32_t reg_dp_gma_curve_9d : 8; /* [15: 8],        r/w,       0x9d */
            uint32_t reg_dp_gma_curve_9e : 8; /* [23:16],        r/w,       0x9e */
            uint32_t reg_dp_gma_curve_9f : 8; /* [31:24],        r/w,       0x9f */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_9c;

    /* 0x2A0 : disp_gma_curve_a0 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_a0 : 8; /* [ 7: 0],        r/w,       0xa0 */
            uint32_t reg_dp_gma_curve_a1 : 8; /* [15: 8],        r/w,       0xa1 */
            uint32_t reg_dp_gma_curve_a2 : 8; /* [23:16],        r/w,       0xa2 */
            uint32_t reg_dp_gma_curve_a3 : 8; /* [31:24],        r/w,       0xa3 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_a0;

    /* 0x2A4 : disp_gma_curve_a4 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_a4 : 8; /* [ 7: 0],        r/w,       0xa4 */
            uint32_t reg_dp_gma_curve_a5 : 8; /* [15: 8],        r/w,       0xa5 */
            uint32_t reg_dp_gma_curve_a6 : 8; /* [23:16],        r/w,       0xa6 */
            uint32_t reg_dp_gma_curve_a7 : 8; /* [31:24],        r/w,       0xa7 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_a4;

    /* 0x2A8 : disp_gma_curve_a8 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_a8 : 8; /* [ 7: 0],        r/w,       0xa8 */
            uint32_t reg_dp_gma_curve_a9 : 8; /* [15: 8],        r/w,       0xa9 */
            uint32_t reg_dp_gma_curve_aa : 8; /* [23:16],        r/w,       0xaa */
            uint32_t reg_dp_gma_curve_ab : 8; /* [31:24],        r/w,       0xab */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_a8;

    /* 0x2AC : disp_gma_curve_ac */
    union {
        struct {
            uint32_t reg_dp_gma_curve_ac : 8; /* [ 7: 0],        r/w,       0xac */
            uint32_t reg_dp_gma_curve_ad : 8; /* [15: 8],        r/w,       0xad */
            uint32_t reg_dp_gma_curve_ae : 8; /* [23:16],        r/w,       0xae */
            uint32_t reg_dp_gma_curve_af : 8; /* [31:24],        r/w,       0xaf */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_ac;

    /* 0x2B0 : disp_gma_curve_b0 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_b0 : 8; /* [ 7: 0],        r/w,       0xb0 */
            uint32_t reg_dp_gma_curve_b1 : 8; /* [15: 8],        r/w,       0xb1 */
            uint32_t reg_dp_gma_curve_b2 : 8; /* [23:16],        r/w,       0xb2 */
            uint32_t reg_dp_gma_curve_b3 : 8; /* [31:24],        r/w,       0xb3 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_b0;

    /* 0x2B4 : disp_gma_curve_b4 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_b4 : 8; /* [ 7: 0],        r/w,       0xb4 */
            uint32_t reg_dp_gma_curve_b5 : 8; /* [15: 8],        r/w,       0xb5 */
            uint32_t reg_dp_gma_curve_b6 : 8; /* [23:16],        r/w,       0xb6 */
            uint32_t reg_dp_gma_curve_b7 : 8; /* [31:24],        r/w,       0xb7 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_b4;

    /* 0x2B8 : disp_gma_curve_b8 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_b8 : 8; /* [ 7: 0],        r/w,       0xb8 */
            uint32_t reg_dp_gma_curve_b9 : 8; /* [15: 8],        r/w,       0xb9 */
            uint32_t reg_dp_gma_curve_ba : 8; /* [23:16],        r/w,       0xba */
            uint32_t reg_dp_gma_curve_bb : 8; /* [31:24],        r/w,       0xbb */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_b8;

    /* 0x2BC : disp_gma_curve_bc */
    union {
        struct {
            uint32_t reg_dp_gma_curve_bc : 8; /* [ 7: 0],        r/w,       0xbc */
            uint32_t reg_dp_gma_curve_bd : 8; /* [15: 8],        r/w,       0xbd */
            uint32_t reg_dp_gma_curve_be : 8; /* [23:16],        r/w,       0xbe */
            uint32_t reg_dp_gma_curve_bf : 8; /* [31:24],        r/w,       0xbf */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_bc;

    /* 0x2C0 : disp_gma_curve_c0 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_c0 : 8; /* [ 7: 0],        r/w,       0xc0 */
            uint32_t reg_dp_gma_curve_c1 : 8; /* [15: 8],        r/w,       0xc1 */
            uint32_t reg_dp_gma_curve_c2 : 8; /* [23:16],        r/w,       0xc2 */
            uint32_t reg_dp_gma_curve_c3 : 8; /* [31:24],        r/w,       0xc3 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_c0;

    /* 0x2C4 : disp_gma_curve_c4 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_c4 : 8; /* [ 7: 0],        r/w,       0xc4 */
            uint32_t reg_dp_gma_curve_c5 : 8; /* [15: 8],        r/w,       0xc5 */
            uint32_t reg_dp_gma_curve_c6 : 8; /* [23:16],        r/w,       0xc6 */
            uint32_t reg_dp_gma_curve_c7 : 8; /* [31:24],        r/w,       0xc7 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_c4;

    /* 0x2C8 : disp_gma_curve_c8 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_c8 : 8; /* [ 7: 0],        r/w,       0xc8 */
            uint32_t reg_dp_gma_curve_c9 : 8; /* [15: 8],        r/w,       0xc9 */
            uint32_t reg_dp_gma_curve_ca : 8; /* [23:16],        r/w,       0xca */
            uint32_t reg_dp_gma_curve_cb : 8; /* [31:24],        r/w,       0xcb */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_c8;

