RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_misc_reg.h
    /* 0x2CC : disp_gma_curve_cc */
    union {
        struct {
            uint32_t reg_dp_gma_curve_cc : 8; /* [ 7: 0],        r/w,       0xcc */
            uint32_t reg_dp_gma_curve_cd : 8; /* [15: 8],        r/w,       0xcd */
            uint32_t reg_dp_gma_curve_ce : 8; /* [23:16],        r/w,       0xce */
            uint32_t reg_dp_gma_curve_cf : 8; /* [31:24],        r/w,       0xcf */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_cc;

    /* 0x2D0 : disp_gma_curve_d0 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_d0 : 8; /* [ 7: 0],        r/w,       0xd0 */
            uint32_t reg_dp_gma_curve_d1 : 8; /* [15: 8],        r/w,       0xd1 */
            uint32_t reg_dp_gma_curve_d2 : 8; /* [23:16],        r/w,       0xd2 */
            uint32_t reg_dp_gma_curve_d3 : 8; /* [31:24],        r/w,       0xd3 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_d0;

    /* 0x2D4 : disp_gma_curve_d4 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_d4 : 8; /* [ 7: 0],        r/w,       0xd4 */
            uint32_t reg_dp_gma_curve_d5 : 8; /* [15: 8],        r/w,       0xd5 */
            uint32_t reg_dp_gma_curve_d6 : 8; /* [23:16],        r/w,       0xd6 */
            uint32_t reg_dp_gma_curve_d7 : 8; /* [31:24],        r/w,       0xd7 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_d4;

    /* 0x2D8 : disp_gma_curve_d8 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_d8 : 8; /* [ 7: 0],        r/w,       0xd8 */
            uint32_t reg_dp_gma_curve_d9 : 8; /* [15: 8],        r/w,       0xd9 */
            uint32_t reg_dp_gma_curve_da : 8; /* [23:16],        r/w,       0xda */
            uint32_t reg_dp_gma_curve_db : 8; /* [31:24],        r/w,       0xdb */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_d8;

    /* 0x2DC : disp_gma_curve_dc */
    union {
        struct {
            uint32_t reg_dp_gma_curve_dc : 8; /* [ 7: 0],        r/w,       0xdc */
            uint32_t reg_dp_gma_curve_dd : 8; /* [15: 8],        r/w,       0xdd */
            uint32_t reg_dp_gma_curve_de : 8; /* [23:16],        r/w,       0xde */
            uint32_t reg_dp_gma_curve_df : 8; /* [31:24],        r/w,       0xdf */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_dc;

    /* 0x2E0 : disp_gma_curve_e0 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_e0 : 8; /* [ 7: 0],        r/w,       0xe0 */
            uint32_t reg_dp_gma_curve_e1 : 8; /* [15: 8],        r/w,       0xe1 */
            uint32_t reg_dp_gma_curve_e2 : 8; /* [23:16],        r/w,       0xe2 */
            uint32_t reg_dp_gma_curve_e3 : 8; /* [31:24],        r/w,       0xe3 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_e0;

    /* 0x2E4 : disp_gma_curve_e4 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_e4 : 8; /* [ 7: 0],        r/w,       0xe4 */
            uint32_t reg_dp_gma_curve_e5 : 8; /* [15: 8],        r/w,       0xe5 */
            uint32_t reg_dp_gma_curve_e6 : 8; /* [23:16],        r/w,       0xe6 */
            uint32_t reg_dp_gma_curve_e7 : 8; /* [31:24],        r/w,       0xe7 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_e4;

    /* 0x2E8 : disp_gma_curve_e8 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_e8 : 8; /* [ 7: 0],        r/w,       0xe8 */
            uint32_t reg_dp_gma_curve_e9 : 8; /* [15: 8],        r/w,       0xe9 */
            uint32_t reg_dp_gma_curve_ea : 8; /* [23:16],        r/w,       0xea */
            uint32_t reg_dp_gma_curve_eb : 8; /* [31:24],        r/w,       0xeb */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_e8;

    /* 0x2EC : disp_gma_curve_ec */
    union {
        struct {
            uint32_t reg_dp_gma_curve_ec : 8; /* [ 7: 0],        r/w,       0xec */
            uint32_t reg_dp_gma_curve_ed : 8; /* [15: 8],        r/w,       0xed */
            uint32_t reg_dp_gma_curve_ee : 8; /* [23:16],        r/w,       0xee */
            uint32_t reg_dp_gma_curve_ef : 8; /* [31:24],        r/w,       0xef */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_ec;

    /* 0x2F0 : disp_gma_curve_f0 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_f0 : 8; /* [ 7: 0],        r/w,       0xf0 */
            uint32_t reg_dp_gma_curve_f1 : 8; /* [15: 8],        r/w,       0xf1 */
            uint32_t reg_dp_gma_curve_f2 : 8; /* [23:16],        r/w,       0xf2 */
            uint32_t reg_dp_gma_curve_f3 : 8; /* [31:24],        r/w,       0xf3 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_f0;

    /* 0x2F4 : disp_gma_curve_f4 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_f4 : 8; /* [ 7: 0],        r/w,       0xf4 */
            uint32_t reg_dp_gma_curve_f5 : 8; /* [15: 8],        r/w,       0xf5 */
            uint32_t reg_dp_gma_curve_f6 : 8; /* [23:16],        r/w,       0xf6 */
            uint32_t reg_dp_gma_curve_f7 : 8; /* [31:24],        r/w,       0xf7 */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_f4;

    /* 0x2F8 : disp_gma_curve_f8 */
    union {
        struct {
            uint32_t reg_dp_gma_curve_f8 : 8; /* [ 7: 0],        r/w,       0xf8 */
            uint32_t reg_dp_gma_curve_f9 : 8; /* [15: 8],        r/w,       0xf9 */
            uint32_t reg_dp_gma_curve_fa : 8; /* [23:16],        r/w,       0xfa */
            uint32_t reg_dp_gma_curve_fb : 8; /* [31:24],        r/w,       0xfb */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_f8;

    /* 0x2FC : disp_gma_curve_fc */
    union {
        struct {
            uint32_t reg_dp_gma_curve_fc : 8; /* [ 7: 0],        r/w,       0xfc */
            uint32_t reg_dp_gma_curve_fd : 8; /* [15: 8],        r/w,       0xfd */
            uint32_t reg_dp_gma_curve_fe : 8; /* [23:16],        r/w,       0xfe */
            uint32_t reg_dp_gma_curve_ff : 8; /* [31:24],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } disp_gma_curve_fc;
};

typedef volatile struct dsp2_misc_reg dsp2_misc_reg_t;

#endif /* __DSP2_MISC_REG_H__ */
